{
    "S4.T1": {
        "caption": "Table 1: Normalized PAR10 scores of all base- and meta-algorithm selectors normalized wrt. the standard oracle and SBS. The result of the best approach is marked in bold for each scenario. Moreover, for the meta-algorithm selectors the values in brackets (a/b)𝑎𝑏(a/b) indicate that that the approach achieves a performance better or equal to a𝑎a base-approaches and is worse than b𝑏b base-approaches.",
        "table": null,
        "footnotes": [],
        "references": [
            "Table 1 shows the normalized PAR10 scores of all algorithm selectors and the corresponding algorithm selector selectors, both normalized with respect to the standard oracle and SBS. The result of the best approach is marked in bold for each scenario. A value of 0 corresponds to oracle performance, a value of 1 to SBS performance, and values in-between indicate an improvement over the SBS, whereas values above 1 indicate degradation compared to the SBS. Unsurprisingly, most algorithm selector selectors are able to consistently improve over the SBS. However, moving to the meta-level proves to be beneficial for only 3 scenarios, which is disappointing. A possible cause of this observation might be that the considered AS approaches are not able to unleash their full potential on the meta-level, although considerable SBAS/AS-oracle gaps exist, as we have seen previously. In order to further investigate this, we evaluate the different meta-AS approaches w.r.t. their meta-algorithm selection performance in the following."
        ]
    },
    "S4.T2": {
        "caption": "Table 2: Win/Tie/Loss statistics, comparing ASS to algorithm selectors across scenarios.",
        "table": null,
        "footnotes": [],
        "references": [
            "Table 2 shows a pairwise win/tie/loss between algorithm selectors and algorithm selector selectors aggregated across scenarios, giving a fairer idea of whether deciding for an algorithm selector selector is more beneficial than deciding for an algorithm selector. Although some ASS are able to beat many algorithm selectors on a majority of instances, ASS do not seem to be advantageous."
        ]
    },
    "S4.T3": {
        "caption": "Table 3: PAR10 scores normalized wrt. to the SBAS and AS-oracle of all considered meta-AS approaches. Values below 1, i.e., an improvement over the SBAS, are marked in bold.",
        "table": null,
        "footnotes": [],
        "references": [
            "Table 3 shows the PAR10 scores normalized w.r.t. to the SBAS and AS-oracle of all considered algorithm selector selectors, where improvements over the SBAS, i.e., values below 1, are marked in bold. A first observation to be made is that none of the meta-AS approaches is able to achieve an improvement over the SBAS on the majority of instances, indicating weaknesses in performing successful algorithm selection on the meta-level. This observation suggests that very successful AS approaches seem to have trouble to perform well on a meta-level. Note that these results have to be treated with care. Although the SBAS is essentially an algorithm selector, a score below 1 does not necessarily indicate that the corresponding ASS performs better than all algorithm selectors. The SBAS is determined on the training data, and hence an improvement over the SBAS on the test data is not equivalent to being better than all algorithm selectors on the test data."
        ]
    }
}