{
    "PAPER'S NUMBER OF TABLES": 2,
    "S4.T1": {
        "caption": "Table 1: Average standard deviation σ𝜎\\sigma and median absolute deviation (MAD) of contributions, by sampling using the strategies introduced in 3.2 and using FedRandom, lower is better.",
        "table": "",
        "footnotes": "",
        "references": [
            "FedRandom enables us to efficiently sample large amounts of contribution values, allowing the calculation of a statistically valid mean contribution.\nTable 1 contains the average standard deviation σ𝜎\\sigma and the median absolute deviation of (a) a sampling of the 10 strategies introduced in 3.2 over our experiments and (b) a FedRandom sampling on the same experiments. We observe that FedRandom allows us to drastically decrease both measures. Consequently, FedRandom sampling results in a more robust and stable contribution allocation, leading to more confidence and trust in individual contributions.",
            "Although we have shown in table 1 that sampling with FedRandom greatly decreases variance when comparing different aggregation strategies, this does not mean that FedRandom gives a realistic approximation of clients’ contributions.\nHowever, by studying how different aggregation strategies compare to FedRandom with Data Shapley as a baseline, we show that FedRandom outperforms all of the chosen aggregation strategies. Indeed, Figure 3 showcases the distributions of distances to Data Shapley, for individual strategies, as well as for different instances of FedRandom. FedRandom samplings are significantly better at approximating the Data Shapley baseline, especially for E=3𝐸3E=3. In addition, they deviate less from Data Shapley, leading to higher confidence in result accuracy. This is a strong argument for FedRandom, as it gives participants a guarantee that they will be remunerated based on their data contribution, and not on seemingly random factors when employing a single base strategy. To note that, since FedRandom outperforms any individual strategy, it outperforms a basic sampling using the mean contribution of multiple strategies as well."
        ]
    },
    "S4.T2": {
        "caption": "Table 2: Aggregation strategies’ mean difference to Data Shapley, compared to FedRandom sampling; lower is better. Strategies included in FedRandom are marked with ✓.",
        "table": "",
        "footnotes": "",
        "references": [
            "Table 2 goes into more detail about the difference to Data Shapley. We observe that, the average square distance of FedRandom, especially FedRandom-3, is considerably lower than that of basic aggregation strategies. Additionally, the ℒ∞subscriptℒ\\mathcal{L}_{\\infty} distance metric shows that we decrease the average maximal per-client difference to Data Shapley from more than 20%percent2020\\% in basic strategies to only 5%percent55\\% with FedRandom. This means that participants will, on average, only lose or gain a maximum amount of 5%percent55\\% of their Data Shapley contribution."
        ]
    }
}