{
    "id_table_1": {
        "caption": "Table 1:  Evaluation Results centered on a 95% confidence interval",
        "table": "S4.T1.1",
        "footnotes": [],
        "references": [
            "Given a natural language query  Q Q Q italic_Q  and a GitHub repository database  D D D italic_D , as seen in Figure  1  we enhance the query using an agent with internet access. The agents primary objectives are to contextualize  Q Q Q italic_Q  relative to  D D D italic_D   and to enrich  Q Q Q italic_Q  with additional details, thereby improving the match between the user input and the correct code snippet.",
            "Table  1  provides the evaluation results, comparing our method, RepoRift, against the baselines. The success rates are measured at two levels: Success@10 and Success@1, which indicate the percentage of correct snippets found within the top 10 and the top 1 results, respectively. Despite not being optimized for Success@1 due to its ensemble approach, RepoRift significantly outperforms all other methods. Specifically, RepoRift achieves an 78.2% 8.1 success rate at Success@10, which has a lower bound accuracy that is approximately 22.5% better than the highest-performing baseline (PSCS at 47.6%). For Success@1, RepoRift achieves a 34.6% 9.3 success rate, which has a lower bound accuracy that is approximately 2.4% better than the highest-performing baseline (PSCS at 22.9%)."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Success rates of various text queries.",
        "table": "S6.T2.1",
        "footnotes": [],
        "references": [
            "To determine the highest rank in our methodology, we look at all the streams in the multi-streamed process mentioned in the methods (Section  2.2 ), and take the snippet that was calculated with the highest cosine similarity. Additionally, since we reason that many methods can only be fully understood in the context of a class, we consider it a positive label if the class of the correct snippet is detected by RepoRift even if the individual function is not."
        ]
    },
    "global_footnotes": []
}