{
    "id_table_1": {
        "caption": "TABLE I:  Inference time and training time of our model (DeepLab v3+ + SlipNet) compared to the baseline methods executed on a workstation with NVidia GTX 1050 GPU. The training samples consist of 10,000 images resized to 256 X 256.",
        "table": "S2.E6",
        "footnotes": [],
        "references": [
            "This paper proposes SlipNet, an approach for real-time terrain classification and slip prediction applicable to autonomous navigation on deformable terrains. SlipNet dynamically reclassifies unseen terrains during deployment, enabling the rover to adapt to new and evolving terrain conditions (Fig.  1 ). Our method uses a dual-network architecture, with the segmentation network providing terrain classification and the Slip Risk module contributing slip prediction. The system integrates sensor data and camera input to generate a slip cost map (SCM) that aids in navigation. The main contributions of the paper are summarized as follows:"
        ]
    },
    "id_table_2": {
        "caption": "TABLE II:  Evaluation of slip hazard estimation performance for the different models studied and the baseline (TerrainNet) using MAE",
        "table": "S3.T1.1.1",
        "footnotes": [
            ""
        ],
        "references": [
            "As mentioned in Section  II-A , the slip ratio quantitatively describes the wheel slippage. The slip ratio can be classified into five different categories: ( 0 < s 1  0.2 0 subscript s 1 0.2 0<s_{1}\\leq 0.2 0 < italic_s start_POSTSUBSCRIPT 1 end_POSTSUBSCRIPT  0.2 ), ( 0.2 < s 2  0.4 0.2 subscript s 2 0.4 0.2<s_{2}\\leq 0.4 0.2 < italic_s start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT  0.4 ), ( 0.4 < s 3  0.6 0.4 subscript s 3 0.6 0.4<s_{3}\\leq 0.6 0.4 < italic_s start_POSTSUBSCRIPT 3 end_POSTSUBSCRIPT  0.6 ), ( 0.6 < s 4  0.8 0.6 subscript s 4 0.8 0.6<s_{4}\\leq 0.8 0.6 < italic_s start_POSTSUBSCRIPT 4 end_POSTSUBSCRIPT  0.8 ), and ( 0.8 < s 5 0.8 subscript s 5 0.8<s_{5} 0.8 < italic_s start_POSTSUBSCRIPT 5 end_POSTSUBSCRIPT ). The simulation results of the current study, as presented later, indicate that at low and moderate wheel speeds, the rover experiences slip values up to 0.4, but encounters high and unpredictable slip as the wheel speed increases significantly. Slip measures the navigation risk encountered by wheeled mobile robots on deformable terrains, which has been studied in previous literature  [ 43 ] . Before predicting risk, the slip ratio is estimated from a regression curve using collected slip versus speed data. The estimated slip ratio, denoted as  s s s italic_s , and a linear basis function  y  ( x , w ) y x w y(x,w) italic_y ( italic_x , italic_w )  as in ( 2 ).",
            "The Khalifa University Space Rover (KUSR), a differential drive grouser-wheeled rover  [ 45 ] , is used in a high-fidelity, physics-based simulator (Vortex Studio v22.8) [ 46 ,  43 ]  for data collection. Egocentric RGB terrain images, right and left wheel angular speed, and slippage data are generated from the navigation of the rover on six heterogeneous terrains. These terrains are created by generating patterns using eight different types of soils, which include four lunar soil textures and four soils commonly found on Earth, as in Fig.  2 . Mechanical properties such as soil friction angle, cohesion, and stiffness modulus are assigned to the rover tire model. A total of 24 trajectories were generated with a  20  m  20  m 20 m 20 m 20m\\times 20m 20 italic_m  20 italic_m  terrain dimension. In total, there are 10080 input labels split into 8064/2016 training/testing sets, respectively.",
            "We evaluate our models on test datasets that consist of 2016 terrain images. The rover used for simulation experiments is KUSR, which is lightweight (about 10 kg) with four grouser wheels of about  0.1  m 0.1 m 0.1m 0.1 italic_m  radius. We use a maximum angular speed range of  [  3.5 , 3.5 ] 3.5 3.5 [-3.5,3.5] [ - 3.5 , 3.5 ] rad/s with the differential drive to guide the rover from the start position to the goal position for each path-following scenario. Each scenario takes around 30 seconds. To generate rich data across a variety of terrains, various heterogeneous terrains were created with different complexities using a mixture of eight different soil textures given in Fig.  2 ."
        ]
    },
    "id_table_3": {
        "caption": "",
        "table": "S3.T2.1",
        "footnotes": [
            ""
        ],
        "references": [
            "The proposed SlipNet architecture consists of three major components as shown in Fig.  3 .  Terrain segmentation module , which converts a terrain image into a semantic segmentation map. Three semantic segmentation networks were explored in this study: U-Net, PSPNet, and DeepLab v3+. Due to its weak-supervision functionality, the DeepLab v3+  [ 47 ]  is adopted for segmentation. The  Slip Risk Module  maps the segmentation mask with in-situ wheel slip mean and standard deviation values for each terrain type. The  SlipNet  assigns slip risk classes to terrain segments and keeps track of all terrain classes and their corresponding slip risk estimates. In the SlipNet, the terrain segmented map is updated into a Slip Cost Map represented by jet colormap to indicate slippage risk zones."
        ]
    }
}