{
    "id_table_1": {
        "caption": "Table 1:  Quantitative comparisons of different approaches upon the  Seen  test set. The best in  bold , the second in underline.",
        "table": "S5.EGx1",
        "footnotes": [],
        "references": [
            "Non-line-of-sight (NLOS) imaging represents a groundbreaking advancement in visual perception, enabling the visualization of hidden objects with significant implications in diverse fields, including autonomous navigation, remote sensing, disaster recovery, and medical diagnostics  (Bauer et al.,  2015 ; Lindell et al.,  2019a ; Scheiner et al.,  2020 ; Laurenzis et al.,  2017 ; Wu et al.,  2021 ; Maeda et al.,  2019 ) . By harnessing sophisticated time-of-flight (ToF) configuration, NLOS imaging systems can effectively capture light signals bounced off hidden objects, even when direct line-of-sight visibility is obstructed, as illustrated in Fig.  1 (a). The core components of such systems typically include pulse lasers, which emit short bursts of light, and time-resolved detection sensors like Single Photon Avalanche Diode (SPAD) and Time-Correlated Single Photon Counting, which precisely capture the flight of the time that takes for photons to travel from the light source to the hidden object and back to the SPAD. The captured signals, known as transient measurement, undergo reconstruction using various algorithms, including traditional approaches  (Velten et al.,  2012 ; Arellano et al.,  2017 ; Liu et al.,  2019 )  and learning-based approaches  (Chen et al.,  2020 ; Grau Chopite et al.,  2020 ; Mu et al.,  2022 ; Yu et al.,  2023 ; Li et al.,  2023 ;  2024 ) .",
            "To address this phenomenon, quadratic and quartic operations are commonly applied to the light propagation path for retro-reflective and diffuse surfaces, respectively  (OToole et al.,  2018 ) , to compensate for intensity attenuation. However, since various surface materials coexist within the same scene, applying path compensation based on a single material type across the entire scene, as performed in physical priors or previous work, may not effectively counteract the effects of attenuation. Additionally, the problem is exacerbated by the low quantum efficiency of the imaging system, particularly over long distances. As shown in Fig.  1 (b), using a single coefficient to compensate for the entire scene can enhance the reconstruction of objects with corresponding material properties, but it will significantly reduce the SNR for other objects in the same scene. Another challenge is the limited generalization ability mainly caused by various noises. In this study, we concentrate on two specific noise sources: the dark count of the SPAD and the ambient light  (Hernandez et al.,  2017 ) . As the data acquisition time decreases, the signal-to-noise ratio (SNR) decreases, resulting in higher noise levels. The Poisson-distributed noise photons degrade the quality of transient measurements especially at low SNR, manifesting as high-frequency aliasing. This phenomenon poses grave challenges to existing approaches, with traditional ones yielding a plethora of artifacts, and learning-based ones experiencing a breakdown in their ability to generalize.",
            "To address the above two challenges, we propose a novel learning-based approach by leveraging the virtual wave phasor field  (Liu et al.,  2019 ) . Our approach incorporates two key designs: the Learnable Path Compensation (LPC) and the Adaptive Phasor Field (APF). Given that reflected light with different degrees of RIF may be captured simultaneously, the LPC utilizes three physics-based predefined compensation weights to initialize the features of transient measurements for path compensation. Subsequently, a convolutional neural network is trained to implicitly learn and assign distinct compensation coefficients to each scanning point in the transient measurements. By utilizing these learnable compensation coefficients, the LPC adaptively mitigates light wave attenuation in the same scene, as shown in Fig.  1 (b), particularly for distant regions. Meanwhile, the APF learns an applicable standard deviation for the Gaussian window of the illumination function, allowing it to dynamically choose the relevant spectrum band for each transient measurement. The emphasis on the effective spectrum enables the discrimination of useful information from noise under distinct SNR conditions.",
            "To address the problems mentioned in Section  1 , we integrate the proposed LPC and APF modules into the LFE  (Chen et al.,  2020 )  framework, which comprises a feature extraction module, a wave propagation module, and a rendering module. An overview of the network is shown in Fig.  2 . Given transient measurements as input, similar to those described in the literature  (Chen et al.,  2020 ; Li et al.,  2023 ) ), the feature extraction module downsamples the transient measurements in both spatial and temporal dimensions and extracts feature embeddings  F E subscript F E F_{E} italic_F start_POSTSUBSCRIPT italic_E end_POSTSUBSCRIPT .",
            "As described in the imaging formulation in Section  3.1 , the transient measurement is illuminated by the virtual illumination function. In the frequency domain, the illumination phasor field  P F  ( x p ,  ) subscript P F subscript x p  \\mathcal{P_{\\mathcal{F}}}(x_{p},\\Omega) caligraphic_P start_POSTSUBSCRIPT caligraphic_F end_POSTSUBSCRIPT ( italic_x start_POSTSUBSCRIPT italic_p end_POSTSUBSCRIPT , roman_ )  acts as a Gaussian filter on the feature of transient measurements, modulated to the central frequency   C subscript  C \\Omega_{C} roman_ start_POSTSUBSCRIPT italic_C end_POSTSUBSCRIPT . It should be noted that not all frequency components contribute positively to the final scene reconstruction, including frequency components associated with noise  (Liu et al.,  2020 ; Hernandez et al.,  2017 ) . Applying an illumination function to the feature of transient measurements can be understood as a process of selecting a certain effective frequency spectrum band      \\bigtriangleup\\Omega  roman_ . The bandwidth of the Gaussian function for the illumination function is decided by the standard deviation, which can be expressed as",
            "Quantitative evaluation . The quantitative evaluations presented in Table  1  demonstrate that our approach achieves decent advancements in NLOS reconstruction. For the synthetic results, our approach outperforms all competitors in terms of all evaluation metrics. Specifically, our approach exhibits a substantial enhancement over traditional approaches, achieving a 2.25 dB increase in PSNR compared to the leading approach RSD. Furthermore, when compared with the recent state-of-the-art (SOTA) learning-based approaches I-K and NLOST, our approach still achieves a 0.55 dB and 0.25 dB improvement in PSNR, respectively. The merits of our approach are further substantiated by the highest SSIM for intensity, which underscores the superior capability of our network in preserving the structural integrity of hidden scenes. Additionally, for the depth estimation, our approach reduces the RMSE and MAD metrics by 3.10% and 8.77%, respectively, over the strongest competitor NLOST."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Quantitative results on the  Unseen  test set under different SNRs. The best in  bold , the second in underline.",
        "table": "S5.EGx2",
        "footnotes": [],
        "references": [
            "To address the problems mentioned in Section  1 , we integrate the proposed LPC and APF modules into the LFE  (Chen et al.,  2020 )  framework, which comprises a feature extraction module, a wave propagation module, and a rendering module. An overview of the network is shown in Fig.  2 . Given transient measurements as input, similar to those described in the literature  (Chen et al.,  2020 ; Li et al.,  2023 ) ), the feature extraction module downsamples the transient measurements in both spatial and temporal dimensions and extracts feature embeddings  F E subscript F E F_{E} italic_F start_POSTSUBSCRIPT italic_E end_POSTSUBSCRIPT .",
            "Generalization evaluation . To further validate the networks generalization performance, we conduct quantitative tests under varying SNR conditions. Specifically, we test different approaches with the  Unseen  test set under varying SNR levels (10 dB, 5 dB, and 3 dB) of the Poisson noise. Extreme SNR conditions make separating background noise from the limited number of collected photons more challenging, while the new scenes in the Unseen test set validate the performance when transferred to unknown domains. As can be seen in Table  2 , in most cases, our approach achieves the best results compared to other approaches. These outstanding results demonstrate the superior generalization performance of our approach in dealing with test data that is distinct from the training data. This superiority is then further verified on various real-world data that has no ground truth below."
        ]
    },
    "id_table_3": {
        "caption": "",
        "table": "S5.EGx3",
        "footnotes": [],
        "references": [
            "To alleviate the aforementioned RIF, we design the LPC module, which can predict the clean transient measurements before attenuation. An overview of the LPC is shown in Fig.  3 . Given the features  F E subscript F E F_{E} italic_F start_POSTSUBSCRIPT italic_E end_POSTSUBSCRIPT  from the previous feature extraction module, the LPC first enhances the features using a convolutional layer with normalization, yielding  F E  superscript subscript F E  F_{E}^{{}^{\\prime}} italic_F start_POSTSUBSCRIPT italic_E end_POSTSUBSCRIPT start_POSTSUPERSCRIPT start_FLOATSUPERSCRIPT  end_FLOATSUPERSCRIPT end_POSTSUPERSCRIPT . Let  G Z subscript G Z G_{Z} italic_G start_POSTSUBSCRIPT italic_Z end_POSTSUBSCRIPT  denote the grid representing the distance from the hidden volume to the relay wall, we predefine three path compensation weights  { ( G Z ) r , r = 1 , 2 , 4 } formulae-sequence superscript subscript G Z r r 1 2 4 \\{(G_{Z})^{r},r=1,2,4\\} { ( italic_G start_POSTSUBSCRIPT italic_Z end_POSTSUBSCRIPT ) start_POSTSUPERSCRIPT italic_r end_POSTSUPERSCRIPT , italic_r = 1 , 2 , 4 } , which correspond to different attenuation amplitudes of surface materials, as referenced in  OToole et al. ( 2018 )  and  Liu et al. ( 2020 ) . The weights and enhanced features are multiplied to obtain initially compensated features  F C i  n  i superscript subscript F C i n i F_{C}^{ini} italic_F start_POSTSUBSCRIPT italic_C end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_i italic_n italic_i end_POSTSUPERSCRIPT , which can be expressed as:",
            "As described in the imaging formulation in Section  3.1 , the transient measurement is illuminated by the virtual illumination function. In the frequency domain, the illumination phasor field  P F  ( x p ,  ) subscript P F subscript x p  \\mathcal{P_{\\mathcal{F}}}(x_{p},\\Omega) caligraphic_P start_POSTSUBSCRIPT caligraphic_F end_POSTSUBSCRIPT ( italic_x start_POSTSUBSCRIPT italic_p end_POSTSUBSCRIPT , roman_ )  acts as a Gaussian filter on the feature of transient measurements, modulated to the central frequency   C subscript  C \\Omega_{C} roman_ start_POSTSUBSCRIPT italic_C end_POSTSUBSCRIPT . It should be noted that not all frequency components contribute positively to the final scene reconstruction, including frequency components associated with noise  (Liu et al.,  2020 ; Hernandez et al.,  2017 ) . Applying an illumination function to the feature of transient measurements can be understood as a process of selecting a certain effective frequency spectrum band      \\bigtriangleup\\Omega  roman_ . The bandwidth of the Gaussian function for the illumination function is decided by the standard deviation, which can be expressed as"
        ]
    },
    "id_table_4": {
        "caption": "",
        "table": "S5.EGx4",
        "footnotes": [],
        "references": [
            "As demonstrated in Section  4.5 , our carefully designed LPC module effectively mitigates the RIF issue, enhancing the reconstruction performance for challenging real-world scenes, especially in complex and distant regions.",
            "To address this problem, we devise the APF module to adaptively learn the standard deviation, as illustrated in Fig.  4 . Given the feature  F C subscript F C F_{C} italic_F start_POSTSUBSCRIPT italic_C end_POSTSUBSCRIPT , the first step is to transform the feature into the frequency domain along the temporal dimension. This allows the module to intuitively learn to distinguish between useful information and noise directly in the frequency domain. Subsequently, the Fourier features are convolved across the spatial and the spectrum parts successively to further enhance features. We then employ additional fully connected layers to predict the standard deviations   p  r  e  d subscript  p r e d \\sigma_{pred} italic_ start_POSTSUBSCRIPT italic_p italic_r italic_e italic_d end_POSTSUBSCRIPT  from frequency feature representation, generating the adaptive Gaussian function  K G  (  ) subscript K G  K_{G}(\\sigma) italic_K start_POSTSUBSCRIPT italic_G end_POSTSUBSCRIPT ( italic_ )  in the frequency domain. As such, the illumination phasor field can be formulated by the adaptive Gaussian function and the virtual waves  e j   C  t superscript e j subscript  C t e^{j\\Omega_{C}t} italic_e start_POSTSUPERSCRIPT italic_j roman_ start_POSTSUBSCRIPT italic_C end_POSTSUBSCRIPT italic_t end_POSTSUPERSCRIPT , as",
            "As demonstrated in Section  4.4  and Section  4.5 , the APF module selectively emphasizes useful information and attenuates noise across various SNR conditions within the transient measurements, thereby boosting the generalization capability and improving the reconstruction quality."
        ]
    },
    "id_table_5": {
        "caption": "",
        "table": "S5.EGx5",
        "footnotes": [],
        "references": [
            "As demonstrated in Section  4.5 , our carefully designed LPC module effectively mitigates the RIF issue, enhancing the reconstruction performance for challenging real-world scenes, especially in complex and distant regions.",
            "As demonstrated in Section  4.4  and Section  4.5 , the APF module selectively emphasizes useful information and attenuates noise across various SNR conditions within the transient measurements, thereby boosting the generalization capability and improving the reconstruction quality.",
            "Qualitative evaluation . We present the qualitative results of intensity images and depth error maps for visualization comparisons, depicted in Fig.  5  and Fig.  6 . Regarding the intensity visualization comparisons, LCT reconstructs the main content yet sacrifices details, FK fails to recover most of the structural information, and RSD introduces significant noise in the background. The LFE and I-K perform better than traditional approaches but still lack details. Compared to the SOTA approach NLOST, our approach generates content with greater fidelity and high-frequency details (e.g., the texture of the scene in the first row). In terms of the depth error map, the blue regions dominate the scene in the error map corresponding to our approach, indicating the smallest magnitude of the error. In contrast, traditional approaches as well as LFE demonstrate a greater tendency for errors, as shown by the increased presence of red parts, especially in distant regions (e.g., the right part of the motorcycles in the second row). These areas are challenging due to the complex geometrical features and distinct RIF degrees with different kinds of materials. While I-K and NLOST show improvement over the former approaches, they still fail to precisely estimate the depth in the wheel area, where our approach succeeds."
        ]
    },
    "id_table_6": {
        "caption": "",
        "table": "S5.EGx6",
        "footnotes": [],
        "references": [
            "Qualitative evaluation . We present the qualitative results of intensity images and depth error maps for visualization comparisons, depicted in Fig.  5  and Fig.  6 . Regarding the intensity visualization comparisons, LCT reconstructs the main content yet sacrifices details, FK fails to recover most of the structural information, and RSD introduces significant noise in the background. The LFE and I-K perform better than traditional approaches but still lack details. Compared to the SOTA approach NLOST, our approach generates content with greater fidelity and high-frequency details (e.g., the texture of the scene in the first row). In terms of the depth error map, the blue regions dominate the scene in the error map corresponding to our approach, indicating the smallest magnitude of the error. In contrast, traditional approaches as well as LFE demonstrate a greater tendency for errors, as shown by the increased presence of red parts, especially in distant regions (e.g., the right part of the motorcycles in the second row). These areas are challenging due to the complex geometrical features and distinct RIF degrees with different kinds of materials. While I-K and NLOST show improvement over the former approaches, they still fail to precisely estimate the depth in the wheel area, where our approach succeeds."
        ]
    },
    "id_table_7": {
        "caption": "",
        "table": "S5.EGx7",
        "footnotes": [],
        "references": [
            "Public data . Results on two public NLOS datasets are presented in Fig.  7 . When utilizing measurements with reduced acquisition time, nearly all approaches, except for NLOST and our approach, produce reconstructions with significant noise. The traditional approaches, while reconstructing main content, produces blurred results. LFE and I-K manage to reconstruct more objects but struggle to capture high-frequency details. NLOST excels in reducing background noise, but it still misses certain details such as the legs of the deer and the intricate patterns of the tablecloth. Our approach shows remarkable resilience to variation in different acquisition times, consistently delivering detailed reconstructions comparable to those of the same objects captured at high acquisition time. The exceptional robustness of our approach demonstrates the superior generalization ability over the existing approaches."
        ]
    },
    "id_table_8": {
        "caption": "",
        "table": "S4.T1.4",
        "footnotes": [
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        "references": [
            "Self-captured data . Apart from the public data, we also capture several new scenes with our own NLOS system for further assessment. We present results from three distinct scenes: one depicting retro-reflective letters arranged on a ladder (referred to as ladder), another featuring a panel composed of multiple A4 sheets inscribed with 123XYZ (referred to as resolution), and the third containing multiple objects with varying surface materials (referred to as composite). As shown in Fig.  8 , it can be observed that learning-based approaches still exhibit less reconstruction noise compared to traditional approaches. In the low SNR scenario of the ladder, other approaches either fail to reconstruct or produce poor-quality reconstructions. However, our reconstruction exhibits notably high quality, with the ladder legs even discernible. In the heavily attenuated diffuse reflection scenario resolution, our approach still manages to reconstruct relatively clear details. In the composite scene, which includes depth variations and multiple surface materials, our approach produces reconstruction with the least noise and the most complete structural information (e.g., the lower edge of the bookshelf and the letter S in the upper right of the scene). The promising outcomes achieved by our approach underscore its superiority over existing approaches."
        ]
    },
    "id_table_9": {
        "caption": "",
        "table": "S4.T2.4",
        "footnotes": [],
        "references": [
            "In this section, we ablate the contribution of the modules. As shown in the qualitative results in Fig.  9 , the LPC and the APF modules each contribute to improving the performance of the approach in distinct ways, with their combination yielding the best results. Specifically, it can be seen that the network without the proposed modules loses image details and contains significant noise in the reconstruction. In contrast, introducing the LPC module enhances object details (e.g., the deers legs), and introducing the APF module suppresses background artifacts. When both the APF and the LPC modules are integrated, the network produces images with complete details and clear boundaries."
        ]
    }
}