{
    "id_table_1": {
        "caption": "TABLE I:  Lexical similarities of the generated synthetic letters against references on the testing dataset.",
        "table": "S5.T1.1",
        "footnotes": [],
        "references": [
            "This section describes the design of our system in detail, following the pipeline displayed in Figure  1 .",
            "Data utility  measures the usefulness and applicability of a dataset for practical purposes. Specifically, it is evaluated by determining how well the generated data captures the critical characteristics present in the real data. To assess this characteristic, we evaluate the extent to which our synthetic records retain the capability of training machine learning models that perform comparably to those trained using real data. This is done through a downstream NER task, similarly to  [ 11 ,  12 ]  and described in subsection  V-C 1 ."
        ]
    },
    "id_table_2": {
        "caption": "TABLE II:  Average number of overlap between the top 5, 10, 20, 50 and 100 features identified across the real and synthetic datasets, without stopwords.",
        "table": "S5.T2.1",
        "footnotes": [],
        "references": [
            "In this evaluation phase, we determine how well the generated data captures the critical characteristics present in the real data by evaluating the extent to which our synthetic data retains the capability of training machine learning models that perform comparably to those trained using real data. We display the downstream pipeline in Figure  2  and describe it below in more detail. Finally, we give the results of the data utility evaluation."
        ]
    },
    "id_table_3": {
        "caption": "TABLE III:  Readability scores of the generated synthetic letters against references on the testing dataset.",
        "table": "S5.T3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_4": {
        "caption": "TABLE IV:  Average Precision, Recall and F1-score for two labels (DISEASE and CHEMICAL) using Synthetic data   1 absent 1 \\times 1  1 ,   2 absent 2 \\times 2  2 , and Real data on the testing dataset.",
        "table": "S5.T4.5",
        "footnotes": [],
        "references": []
    }
}