{
    "id_table_1": {
        "caption": "Table 1 :  Synthetic dataset results. Mean (Std)",
        "table": "S3.T1.4.4",
        "footnotes": [],
        "references": [
            "Skeletonization has been a powerful approach for modeling anatomical structures because they model both the objects boundary and its interior, as compared with simpler models such as calculating densely sampled boundary landmarks. Historically, a popular way to define the skeleton of an object is through Blums medial axis transform  [ 1 ]  (MAT)(fig.  1 .b). The MAT consists of a set of points and associated radii, which we call spokes, that form the set of maximally inscribed spheres inside the shape. MAT-based models have been used for a wide range of applications  [ 2 ]  such as segmentation, registration and statistics of object shape.",
            "The main limitation of medial models is that they have a tendency to amplify small-scale noise on an objects boundary, resulting in inconsistencies in skeleton location and topology across a population. This makes this representation hard to apply to real life problems where objects from the same population are usually highly variable. This limitation has led to multiple variations of the MAT  [ 3 ,  4 ] . In particular,  skeletal representations (s-reps)   [ 5 ] (fig.  1 , right) are a class of discrete skeletal representations that relate to the MAT but have a fixed topology and can achieve consistent sampling across a population. This is done by fitting a template s-rep to an object via optimization  [ 6 ]  rather than direct computation from the objects boundary. Having a fixed template that is optimized to fit each individual object yields improved consistency, correspondence and resistance to local noise. The optimization process has constraints that allow the final object be nearly medial, including enforcing points on the skeleton to be approximately equidistant from the top and bottom of the objects surface, and the radii associated to these points to be nearly orthogonal to the boundary. The optimization can be slow and often requires manual template generation and parameter tuning when applied to a new data set.",
            "An s-rep consists of a grid of points on the skeleton and a set of vectors emanating from the skeleton to the boundary called spokes (see  1 .b.), that explicitly represent both the objects full interior and surface. Because an s-rep has a fixed grid structure of corresponding points on both the skeleton and boundary, we can easily use it to derive the volumetric graph representation needed by the method described in section   2.2 . By connecting each quad of neighboring points on the skeletal surface and the corresponding quad on the object boundary, we form a single volumetric element which is then decomposed into tetrahedra. While in this work we only use one element to connect the skeleton to the boundary, this could be made more dense by subdividing based on distance along the spokes. Others have used a similar approach to generate models for finite element analysis from s-reps  [ 15 ] .",
            "Table  1  shows results on the synthetic ellipsoid data. The point-based metrics show strong performance in producing predicted models close to the analytically derived s-reps on both the skeleton and boundary. The angle measure shows good agreement between the spoke directions of the GT and predicted models. This model serves as the base for the finetuning experiments on clinical Hippocampus data."
        ]
    },
    "id_table_2": {
        "caption": "Table 2 :  Hippocampus dataset results. Mean (Std)",
        "table": "S3.T2.4.4",
        "footnotes": [],
        "references": [
            "An s-rep consists of a grid of points on the skeleton and a set of vectors emanating from the skeleton to the boundary called spokes (see  1 .b.), that explicitly represent both the objects full interior and surface. Because an s-rep has a fixed grid structure of corresponding points on both the skeleton and boundary, we can easily use it to derive the volumetric graph representation needed by the method described in section   2.2 . By connecting each quad of neighboring points on the skeletal surface and the corresponding quad on the object boundary, we form a single volumetric element which is then decomposed into tetrahedra. While in this work we only use one element to connect the skeleton to the boundary, this could be made more dense by subdividing based on distance along the spokes. Others have used a similar approach to generate models for finite element analysis from s-reps  [ 15 ] .",
            "HybridVNet  [ 14 ]  employs a hybrid encoder-decoder architecture tailored for generating meshes directly from images. Figure  2  shows the proposed HybridVNets single view architecture, that encompasses a 3D convolutional encoder to encode input images and derive a latent space representation of the target object. The resulting encoded representation is further processed through a fully-connected layer and reshaped to initialize features for the subsequent decoder stage.",
            "Table  2  show results from the hippocampus experiment in which the model trained on the synthetic data was finetuned with progressively more hippocampus examples. The results indicate relatively favorable performance in estimating skeletal features. Particularly in capturing angle differences between the predicted and ground truth models, consistent preservation of medialness across experiments and comparable orthogonality metrics to existing fitting methods (used as ground truth) suggest the proposed approachs validity and feasibility in generating s-reps from real hippocampal data."
        ]
    }
}