{
    "id_table_1": {
        "caption": "Table 1 :  Summary of ControlFace10k Characteristics",
        "table": "S3.T1.2",
        "footnotes": [],
        "references": [
            "TheImage Generator consumes prompts from the Prompt Builder to generate the images. The core of this component is the  StableDiffusionControlNetPipeline , from Hugging Faces Diffusers library  [ 55 ]  which facilitates the integration of ControlNets  [ 60 ]  within the Image Generator to guide image synthesis. For instance, the OpenPose ControlNet  [ 59 ]  captures the desired poses for synthetic identities. It estimates pose information from a reference image featuring a person in various orientations  Figure   1(a) . The estimated pose information  Figure   1(b)  is reused across generations to condition the poses featured by synthetic identities.",
            "Using the SIG pipeline described in  Section   3 , we generated ControlFace10k, an evaluation face dataset containing  10 , 008 10 008 10,008 10 , 008  images of  3 , 336 3 336 3,336 3 , 336  synthetic identities balanced across race, gender, age and pose,  Table   1 . This dataset is specifically designed for the evaluation and testing of face recognition systems, not for training purposes. ControlFace10k is stratified into four race groups: African, Asian, Caucasian, and Indian, with  834 834 834 834  identities in each group. Each synthetic identity contains images featuring right-facing, front-facing, and left-facing poses. Synthetic identities featured in this evaluation dataset are also equally distributed across three predefined age groups of 25, 50, and 65 years. Samples of male and female synthetic identities for each race group are shown in  Figure   3 .",
            "To demonstrate the consistency of images within synthetic identities generated by SIG, we generated an additional sample of 3360 synthetic identities, all featuring a frontal pose (SIG Frontal sample). Utilizing embedding vectors from state-of-the-art face recognition models, ArcFace and GhostFaceNet, we calculated similarity scores between  distinct  images of each synthetic identity. Our goal was twofold: firstly, to validate that images belonging to the same synthetic identity maintain consistent facial attributes across different poses, as per our definition of a synthetic identity in  Section   3.1.1 ; and secondly, to provide an insight into the performance of current face recognition systems. We achieved this by constructing a density curve illustrating the distribution of similarity scores for synthetic identity within ControlFace10k. The resulting distributions for both models are shown in  Figure   5 . The comparison between the distributions of similarity scores for ControlFace10k, with varying pose, and images from the same synthetic identity, with frontal pose, indicates that while current face recognition systems perform well on frontal poses, there is room for improvement in recognizing faces across different poses. These differences can be explained by the poorer performance for both ArcFace and GhostFaceNet on non-frontal face images, as observed in their original papers  [ 14 ,  1 ] ."
        ]
    },
    "id_table_2": {
        "caption": "Table 2 :  Countries used to generate names for each race.",
        "table": "A3.T2.4",
        "footnotes": [],
        "references": [
            "ControlFace10k provides a balanced and controlled environment for assessing face recognition systems across various demographic groups and poses. Despite the ideal conditions of our dataset, our findings in  Section   5.2  demonstrate that models may still struggle to correctly match images across varying poses when evaluated using ControlFace10k. These discrepancies highlight the importance of having robust evaluation datasets like ControlFace10k to effectively identify and measure biases, demonstrating false positives and negatives that vary across demographic groups.",
            "The GPT-4 large language model is then utilized to produce names that are found in the identified countries, see  Table   2  below, with a target of 50 names per gender per country. From this effort, we gathered 100 names (50 per gender) from 139 countries, plus an additional 2,000 names specifically for Indian demographics, resulting in a total of 15,900 names. These are evenly distributed among four racial groups, providing approximately 3,975 names per group."
        ]
    }
}