{
    "id_table_1": {
        "caption": "Table 1.  Summary of interview participants pseudonyms and research topics.",
        "table": "S3.T1.1",
        "footnotes": [],
        "references": [
            "The second component, the interview area, enabled researchers to conduct interviews with simulated participants, while the third component, the conversation history viewer, recorded all interactions between the researcher and the LLM. This feature allowed researchers to filter conversations by each system prompt, facilitating a review and analysis of the interview data if they conducted multiple interviews. The purpose of this study is not to compare different models or benchmark their capabilities. Rather than evaluating and making claims about specific LLMs, our goal is to highlight the unique characteristics, values, and tensions with the use of LLMs, in general, in qualitative research. Drawing on prior research, we used the GPT-4-turbo API due to its superior performance as of February 2024  (Zhou et al . ,  2023 ) . Refer to image  1  for an example interaction.",
            "Participants.  We recruited researchers through multiple channels: advertising on social networks, such as Twitter and LinkedIn, emailing direct contacts and messaging forums internal to our institution, and flyers around our campus. We solicited participants with prior training in qualitative methods and experience with at least one research project involving semi-structured interviews. Eleven participants had 3-5 years of experience with qualitative research, six had more than 5 years, and two had between 1-3 years of experience. Although we invited qualitative researchers from various types of institutions, the majority of our interviewees are working in academia (16), with a smaller representation from industry (2) and the non-profit sector (1). All our participants were located in the United States. Refer to Table  1  for details on the participants research areas. To protect anonymity and minimize the risk of identification, we have not linked participants research topics with their demographic information. Each interviewee received a $45 gift card for their participation.",
            "In this section, we present an analysis of how researchers interacted with LLMs, capturing their observations and the dynamics of these interactions, including how they defined personas (section  4.1 ). Our findings focus on six key limitations researchers identified with using LLMs as simulated participants (section  4.2 ). While most participants advised against using LLMs as the primary source of research data, they also acknowledged certain contexts where LLMs might be applied, albeit with significant caveats (section  4.3 )."
        ]
    },
    "id_table_2": {
        "caption": "Table 2.  Summary of the interaction data with n = 179 total turns and n = 44 total system prompts across 19 qualitative researchers. Specified demographics show how often particular demographic details were included in the system prompts. Examples of specified background highlight research topic-related information included in the system prompts.",
        "table": "S4.T2.1.1",
        "footnotes": [],
        "references": [
            "Interview probe.  We created a probe to scaffold researchers reflections on using LLMs in qualitative research. We designed the probe as a simple functional prototype to observe existing practices and gain insights into the social contexts where the technology might be used. This probe consisted of three components. The first component, the system prompt area, allowed researchers to set the context, provide instructions, and define participant descriptions for the LLM before posing interview questions. A system prompt can help establish a role for the LLM to follow throughout the conversation. The most common approach to using LLMs to simulate human behavior involves assigning specific roles to the model (see section  2.2 ), and while we recognize that personas are abstract representations, we adopted this method as it reflects current practice. We provided researchers with an initial system prompt template with placeholders for research topics and persona, formulated through multiple iterations, including pilot studies and involvement from research team members with expertise in qualitative research. The system prompt template was as follows:",
            "In this section, we present an analysis of how researchers interacted with LLMs, capturing their observations and the dynamics of these interactions, including how they defined personas (section  4.1 ). Our findings focus on six key limitations researchers identified with using LLMs as simulated participants (section  4.2 ). While most participants advised against using LLMs as the primary source of research data, they also acknowledged certain contexts where LLMs might be applied, albeit with significant caveats (section  4.3 ).",
            "Participants elaborated on the objectives of qualitative research, often drawing on metaphors of distance to illustrate their argument. Alice, for instance, expressed uncertainty about whether  using something several degrees removed from the source would tell [them] a lot about human behavior and underlying traits of people,  suggesting that such an approach might be futile in understanding people. Jenna further argued that the strength of qualitative studies lies in their capacity to capture unique, embodied experiences. Participants also reflected on the broader contexts of their work. Harper, an industry researcher, described her primary responsibility as storytelling with qualitative data and emphasized the importance of ensuring the data is  convincing enough  to guide team members and management toward the right decisions. While acknowledging that LLMs could generate quick yes/no responses, she remained skeptical of their ability to surface underlying assumptions, challenges, and unspoken nuances that arent easily captured in writing. Overall, participants expressed skepticism about using LLMs but were intrigued by the opportunity to explore the technology through the interview probe. We include a descriptive analysis of the interaction data in table  2 ."
        ]
    }
}