{
    "id_table_1": {
        "caption": "Table 1:  Performance of LLMs on WiFi-based Indoor Localization task.  Since this is a regression task, we choose the Root Mean Square Error (RMSE), Mean Absolute Error (MAE), and standard deviation (STD) of the RMSE as the main performance metrics.",
        "table": "S4.T1.3.1",
        "footnotes": [],
        "references": [
            "We draw inspiration from how humans understand the physical world: perception to acquire information and reasoning with relevant domain knowledge. Firstly, humans perceive the world via a multitude of sensory organs, such as eyes for sight and ears for hearing. To empower machine perception, Internet of Things (IoT) sensors are developed. Since the first IoT sensor was designed for Coke machines to count the number of bottles in the 1980s  ( madakam2015internet ) , IoT sensors become the sensory organs of machines, modeling the physical world for machine automation.  Secondly, humans understand the world via the perception data with domain knowledge gained from experience and education. Similarly, LLMs can learn domain knowledge of both the physical world and sensors from the context to have stronger reasoning capabilities by in-context learning. In this manner, as shown in Fig.  1 , we believe perception data with pertinent knowledge can enable LLMs to address complex problems with IoT-enabled perception in the real world. In this work, we aim to explore the following questions: (1) What types of real-world tasks can LLMs perform via the IoT perception of the physical world? (2) How can we enhance the LLM capability to deal with real-world tasks? (3) Do LLMs truly understand perception data and apply knowledge to realize real-world tasks?",
            "Unlike textual human tasks that have been learned by LLMs, IoT data for IoT task reasoning presents unique challenges that hinder LLMs comprehension. Firstly, IoT data encompasses a diverse range of types and forms, many of which are complex time-series data (e.g., electrocardiogram readings)  ( Goldberger2000 )  or multi-variant data (e.g., WiFi CSI)  ( yang2024mm ) . LLMs often struggle with accurately interpreting dense numerical data, especially when it involves long-sequence time-series data  ( Zhang2024LargeLM ) . Secondly, IoT data is typically composed of raw numerical values. This data often lacks essential textual annotations, such as units of measurement and metadata about the data collection process, which are critical for LLMs to interpret effectively in real-world applications. In summary, raw IoT data requires (1) appropriate simplification and (2) information enrichment. Previous studies  ( xu2024penetrative )  have employed down-sampling techniques for time-series data but they only achieve coarse-grained simplification at a length level without enhancing the informational content of the IoT data. In contrast, we not only simplify IoT data at the token level but also enrich the IoT data by providing additional information to facilitate better understanding by LLMs (as illustrated in Fig.  10  in Appendix  B ). In this way, we transform complex raw IoT data into an LLM-friendly format for IoT task reasoning.",
            "To evaluate the efficacy of our proposed framework in enhancing the capabilities of IoT task reasoning for LLMs, we use HarGPT  ( ji2024hargpt )  as the baseline, of which the prompts only contain raw IoT data and corresponding task descriptions, without any data preprocessing, domain knowledge, and demonstrations. The overall performance of LLMs on IoT tasks is shown in Table  1  and Table  2 . The results show that our proposed method consistently boosts the performance of all the LLMs to complete IoT tasks in real-world scenarios. Notably, advanced LLMs such as Claude-3.5, Gemini-pro, and GPT-4 have demonstrated significant performance improvements, evolving from near-random guessing to effectively solving certain tasks. After analyzing the overall performance and outputs of LLMs in IoT task reasoning, we can answer the questions we proposed in the introduction now. Here is a summary of our arguments regarding the IoT task reasoning with LLMs."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Overall performance of LLMs on IoT tasks .  HAR-2cls  stands for classifying walking and standing activities.  HAR-3cls  stands for classifying lying, walking upstairs, and transitioning from lying to sitting activities.  Heartbeat  stands for classifying normal and abnormal heartbeats.  Machine  stands for determining whether the coolers work properly or not.  Occupancy  stands for detecting the presence of a person in a room.",
        "table": "S4.T2.1.1.1",
        "footnotes": [],
        "references": [
            "At first, we employ LLMs to execute IoT tasks in a basic setting, similar to the existing approaches  ( ji2024hargpt ;  xu2024penetrative ) , where the prompt provided to the LLMs includes only raw IoT data and the associated query. However, the performance of LLMs remains suboptimal. As shown by the baseline results in Table  2 , even GPT-4 only achieves an accuracy of 43% for 3-way activity recognition and 50% for machine diagnosis based on their approach. These preliminary results akin to near-random guessing suggest a lack of comprehension of IoT data and tasks by this naive prompting way.  Upon analyzing the characteristics of IoT data and real-world tasks, we identify that the challenges stem from the abstraction of dense numeric data and the lack of domain knowledge within LLMs. To address these challenges, we propose a unified framework (Fig.  2 ) consisting of three key stages: (1) IoT data simplification and enrichment, (2) IoT-oriented knowledge augmentation, and (3) prompt configuration. Each stage addresses specific difficulties encountered by LLMs for IoT task reasoning, and we introduce each stage one by one.",
            "To evaluate the efficacy of our proposed framework in enhancing the capabilities of IoT task reasoning for LLMs, we use HarGPT  ( ji2024hargpt )  as the baseline, of which the prompts only contain raw IoT data and corresponding task descriptions, without any data preprocessing, domain knowledge, and demonstrations. The overall performance of LLMs on IoT tasks is shown in Table  1  and Table  2 . The results show that our proposed method consistently boosts the performance of all the LLMs to complete IoT tasks in real-world scenarios. Notably, advanced LLMs such as Claude-3.5, Gemini-pro, and GPT-4 have demonstrated significant performance improvements, evolving from near-random guessing to effectively solving certain tasks. After analyzing the overall performance and outputs of LLMs in IoT task reasoning, we can answer the questions we proposed in the introduction now. Here is a summary of our arguments regarding the IoT task reasoning with LLMs."
        ]
    },
    "id_table_3": {
        "caption": "Table 3:  Ablation study of different modules within our framework on three tasks.",
        "table": "S4.T3.1.1.1",
        "footnotes": [],
        "references": [
            "In our study, we prompt LLMs to generate both an analysis of the task and the final answer. Based on this analysis, we demonstrate that LLMs can fully comprehend preprocessed IoT data and effectively utilize the provided knowledge to perform IoT tasks. Unlike traditional DL/ML methods, which are trained end-to-end to produce only the final answer, LLMs offer more explainable results. Specifically, LLMs not only provide the final answer but also the reasoning behind it, akin to expert suggestions in daily life. For instance, when tasked with human activity recognition (as illustrated in Fig. 3 ), the LLM delivers a detailed step-by-step analysis before presenting the final answer.",
            "To evaluate the impact of different components within our framework, we performed an ablation study using GPT-4 on HAR and industrial anomaly detection tasks. We tested the following configurations: (1) IoT data simplification and enrichment, (2) addition of retrieved domain knowledge based on (1), (3) inclusion of retrieved demonstrations based on (2), and (4) the full configuration, which incorporates role descriptions and chain-of-thought techniques as outlined in the Prompt Configuration stage. The results, presented in Table  3 , reveal that for straightforward tasks such as classifying walking and standing activities, IoT data simplification and enrichment and domain knowledge retrieval are sufficient. However, for more complex tasks, the inclusion of additional modules significantly boosts performance. Overall, our findings indicate that each module in our framework progressively enhances the ability of LLMs to perform IoT-related tasks using IoT data."
        ]
    },
    "global_footnotes": []
}