{
    "S3.T1": {
        "caption": "Table 1: Few Shot Classification results on Omniglot dataset for fully connected network and convolutional network on 5-way setting, where * means re-run results as there is no general training/test splitting available for Omniglot, thus we re-run compared models with the same splitting used in running the TAML for a fair comparison.\nThe ±plus-or-minus\\pm shows 95% confidence interval over tasks.",
        "table": null,
        "footnotes": [],
        "references": [
            "We report the results for 5-way Omniglot for both fully connected network and convolutional network. The convolutional network learned by TAML outperforms all the state-of-the-art methods in Table 1. For 20-way classification, we re-ran the Meta-SGD algorithm with our own training/test splitting for fair comparison since the Meta-SGD is not open-sourced and their training/test split is neither available. The results are reported in the Table 2. It can be shown that TAML outperforms MAML and Meta-SGD for both 1-shot and 5-shot settings."
        ]
    },
    "S4.T2": {
        "caption": "Table 2: Few Shot Classification results on Omniglot dataset for CNN on 20-way setting. For a fair comparison, * denotes re-run results by both meta-learning approaches on the same training/test split used in TAML models. The proposed TAML approaches outperform both MAML and Meta-SGD.",
        "table": null,
        "footnotes": [],
        "references": [
            "We report the results for 5-way Omniglot for both fully connected network and convolutional network. The convolutional network learned by TAML outperforms all the state-of-the-art methods in Table 1. For 20-way classification, we re-ran the Meta-SGD algorithm with our own training/test splitting for fair comparison since the Meta-SGD is not open-sourced and their training/test split is neither available. The results are reported in the Table 2. It can be shown that TAML outperforms MAML and Meta-SGD for both 1-shot and 5-shot settings."
        ]
    },
    "S4.T3": {
        "caption": "Table 3: Few Shot Classification results on Mini-Imagenet dataset on 5-way and 20-way setting. The results for other methods on 5-way are reported from MAML, and for 20-way, the results are reported from Meta-SGD. TAML approaches outperform MAML on both settings and Meta-SGD on 20-way setting.",
        "table": null,
        "footnotes": [],
        "references": [
            "For MiniImagenet, the proposed TAML approaches outperform the compared ones for 5-way classification problem. The entropy based TAML achieves the best performance compared with inequality-minimization TAML for 5-shot problem. For 20-way setting, we use the reported results from Meta-SGD for both MAML and Meta-SGD. We outperform both MAML and Meta-SGD for both 1-shot and 5-shot settings. It is interesting to note that MAML performs poor compared with matching nets and Meta-learner LSTM when it is trained using one gradient step as reported in Table 3."
        ]
    }
}