{
    "S4.T1": {
        "caption": "Table 1: Classification accuracies of ProtoNet variants. Best performing methods and any other runs within 95%percent9595\\% confidence margin is in bold",
        "table": null,
        "footnotes": [],
        "references": [
            "EST performance results: Table 1 summarizes the performance of the evaluated methods on all data sets. Due to space constraints, only 1-shot, 5-shot, 10-shot and 1-10 shot average performance are included. Additional results are in the appendix. The best performing method in each evaluation is in bold. On Omniglot, there is no significant difference in performance between the best performing vanilla ProtoNet and any other methods. We attribute this to the already high accuracy of the baseline model. On miniImageNet and tieredImageNet, EST-ProtoNet significantly outperforms baseline methods and PCA-protonet in terms of average accuracy over test runs with different shots."
        ]
    },
    "A1.T2": {
        "caption": "Table 2: Classification Accuracy on miniImageNet-5-way, with 4 layer CNN + 1 Fully connected layer embedding network.",
        "table": null,
        "footnotes": [],
        "references": []
    },
    "A1.T3": {
        "caption": "Table 3: Classification Accuracy on miniImageNet-5-way, with 4 layer CNN embedding network.",
        "table": null,
        "footnotes": [],
        "references": []
    },
    "A1.T4": {
        "caption": "Table 4: Classification Accuracy on tieredImageNet-5-way, with 4 layer CNN embedding network.",
        "table": null,
        "footnotes": [],
        "references": []
    },
    "A1.T5": {
        "caption": "Table 5: Classification Accuracy on Omniglot-20-way, with 4 layer CNN embedding network.",
        "table": null,
        "footnotes": [],
        "references": []
    },
    "A1.T6": {
        "caption": "Table 6: Classification Accuracy on miniImageNet-5-way, with 7 layer ResNet embedding network.",
        "table": null,
        "footnotes": [],
        "references": []
    },
    "A1.T7": {
        "caption": "Table 7: Classification Accuracy on tieredImageNet-5-way, with 7 layer ResNet embedding network.",
        "table": null,
        "footnotes": [],
        "references": []
    },
    "A1.T8": {
        "caption": "Table 8: Classification Accuracy on Omniglot-20-way, with 7 layer ResNet embedding network.",
        "table": null,
        "footnotes": [],
        "references": []
    }
}