{
    "S4.T1": {
        "caption": "TABLE I: Few-shot classification accuracy results on MiniImageNet and TieredImageNet on 5-way 1-shot, 5-way 5-shot tasks. All accuracy results are reported with 95% confidence intervals.\nFor each task, the best-performing method is highlighted. ‘-’: the results are not reported.",
        "table": null,
        "footnotes": [],
        "references": [
            "As detailed in Table I, the proposed method is compared with models including classic methods and recent methods under two tasks (5-way 1-shot, 5-way 5-shot) on two datasets (MiniImageNet and TieredImageNet). It can be seen that our method achieves state-of-the-art results.\nIn particular, our method yields a margin of increment over the current state-of-the-art approach LEO [26] under WRN embedding network in all tasks on two datasets. For example, in TieredImageNet, the results in two tasks from our method and LEO are 69.82% vs. 66.33% and 85.83% vs. 81.44%. Furthermore, the proposed method achieve competitive result comparing to MetaOpt [14] and CTM [15] which are the state-of-the-art results with ResNet. Our result with ResNet in MiniImageNet is slightly worse than the result of CTM as their embedding network is deeper. On the other hand, our result is better in tasks on TieredImageNet even with less complex embedding network.\nNote that some of the methods even apply a deeper feature embedding network with much more parameters to train, such as ResNet-50 used by Sel-Jig [40], ResNet-34 used by Discriminative k-shot [2]. Even so, our method still achieves better performance applying a simpler embedding network.",
            "Metric module. In addition, we further perform an ablation study to show the effectiveness of the semantic regularization module by simply applying Euclidean distance and relation network as metric (same as ProtoNet+ and RelationNet+). The result is shown in Table III. For clarity, we show the performance of all models with the same embedding network. It can be seen that due to the effectiveness of the proposed semantic regularization method, the network without relation module still achieves a competitive result against methods listed in Table I and Table II. Relation module combined with Euclidean distance further improves the performance."
        ]
    },
    "S4.T2": {
        "caption": "TABLE II: Few-shot classification accuracy results on CUB dataset [34] on 5-way 1-shot task, 5-way task 5-shot. All accuracy results are reported with 95% confidence intervals.\nFor each task, the best-performing method is highlighted. ‘+’: re-implementation results for a fair comparison.",
        "table": null,
        "footnotes": [],
        "references": [
            "Table II summarizes the comparisons on the CUB dataset. Our method yields the highest accuracy from all trials. In the 5-way 1-shot test, we achieves 67.85%percent67.8567.85\\% accuracy which improves to the classic MatchingNet [33] by 6.69%percent6.696.69\\%. More significant improvement is achieved for the 5-shot 5-way test. Our classification accuracy is 83.53%percent83.5383.53\\%, an improvement of 4.47%percent4.474.47\\% over ProtoNet+. Comparing to the recently proposed Baseline++ [3], our method demonstrates a significant improvement of 7.32%percent7.327.32\\% and 4.19%percent4.194.19\\% in tests.",
            "Metric module. In addition, we further perform an ablation study to show the effectiveness of the semantic regularization module by simply applying Euclidean distance and relation network as metric (same as ProtoNet+ and RelationNet+). The result is shown in Table III. For clarity, we show the performance of all models with the same embedding network. It can be seen that due to the effectiveness of the proposed semantic regularization method, the network without relation module still achieves a competitive result against methods listed in Table I and Table II. Relation module combined with Euclidean distance further improves the performance."
        ]
    },
    "S4.T3": {
        "caption": "TABLE III: Ablation study on two datasets by comparing ProtoNet+ (Row1), RelationNet+(Row2), our method without relation module (Row3), and with relation module (Row4).",
        "table": null,
        "footnotes": [],
        "references": [
            "Metric module. In addition, we further perform an ablation study to show the effectiveness of the semantic regularization module by simply applying Euclidean distance and relation network as metric (same as ProtoNet+ and RelationNet+). The result is shown in Table III. For clarity, we show the performance of all models with the same embedding network. It can be seen that due to the effectiveness of the proposed semantic regularization method, the network without relation module still achieves a competitive result against methods listed in Table I and Table II. Relation module combined with Euclidean distance further improves the performance."
        ]
    }
}