{
    "S3.T1": {
        "caption": "Table 1: Component overview of all considered methods: Baseline, joint training (JT) and test-time training (TTT) with either cross-entropy (CE), rotation augmentation Gidaris \\BOthers. (\\APACyear2018) or BYOL Grill \\BOthers. (\\APACyear2020); usage of batch augmentation ℬℬ\\mathcal{B}; and used training principles, joint training or meta training with or without test-time adaption.",
        "table": null,
        "footnotes": [],
        "references": [
            "In our experiments, we first analyze the training behavior of our method MT3 followed by a detailed analysis of the impact of meta-learning. For this, we compare to our own baseline and pure joint training (JT) without the meta-learning component. Finally, we compare our results with the state-of-the art method TTT Sun \\BOthers. (\\APACyear2020). An overview of all methods is given in Table 1.",
            "We compare our method to the state-of-the-art TTT Sun \\BOthers. (\\APACyear2020) as shown in Table 2 and Figure 5. Besides our results, we discuss the baseline, joint training (JT) and joint training with test-time adaption (TTT) of \\citeAsun2020ttt. The difference between all analyzed methods are shown in Table 1."
        ]
    },
    "S3.T2": {
        "caption": "Table 2: Performance on the CIFAR-10-Corrupted dataset for MT3 compared to the results from Sun \\BOthers. (\\APACyear2020), including their baseline, joint training with rotation loss (JT), and test-time adaption (TTT). Additionally, we report our results of MT3 without test-time adaption (MT), our baseline, joint training (JT), and test-time adaption (TTT) using BYOL. Mean and standard deviation are reported over 3 runs.",
        "table": null,
        "footnotes": [],
        "references": [
            "We first compare our baseline and joint training without test-time adaption against our proposed method MT3. Additionally, we show the results of MT3 with fixed parameters at test-time (MT), thus without a gradient step at test-time. The results on the 15 corruption types of the CIFAR-10-Corrupted images are shown in Table 2 with their mean and standard deviation estimated over 3 runs. Furthermore, the average accuracy over all corruption types for each run is given by its mean and standard deviation. In case of TTT, the model parameters are adapted before the prediction of each single test image. The final accuracy is then calculated over the predictions of the 10,000 adapted models.",
            "We compare our method to the state-of-the-art TTT Sun \\BOthers. (\\APACyear2020) as shown in Table 2 and Figure 5. Besides our results, we discuss the baseline, joint training (JT) and joint training with test-time adaption (TTT) of \\citeAsun2020ttt. The difference between all analyzed methods are shown in Table 1."
        ]
    },
    "S3.T3": {
        "caption": "Table 3: Accuracy on the CIFAR-100-Corrupted dataset for MT3 compared to our baselines. Mean and standard deviation are reported over 3 runs.",
        "table": null,
        "footnotes": [],
        "references": [
            "To show the success and scalability of MT3, we evaluate our method on the more challenging CIFAR-100-Corrupted dataset Krizhevsky \\BOthers. (\\APACyear2009); Hendrycks \\BBA Dietterich (\\APACyear2019). Since \\citeAsun2020ttt did not evaluate this dataset and \\citeAwang2020tent only for the online adaption, we only show the results compared to our baselines. We use the same hyperparameter as for CIFAR-10 except the test learning rate is lowered to α=0.05𝛼0.05\\alpha=0.05. As shown in Table 3, our method is also capable to learn to adapt on the more complex dataset CIFAR-100 with a similar behavior as for the CIFAR-10-Corrupted dataset."
        ]
    }
}