{
    "S3.T1": {
        "caption": "Table 1: Results on BSCD-FSL Benchmark. Includes ablation studies and results from prior work.",
        "table": null,
        "footnotes": [],
        "references": [
            "From Table 1, DAMSL with both feature backbones outperform previous methods, even without using data augmentation. We see that DAMSL v1 achieves an average accuracy of 72.13% while DAMSL v2 achieves an average accuracy of 74.34%. With data augmentation, DAMSL v1 (Aug) achieves an average accuracy of 74.06% while DAMSL v2 (Aug) achieves an average accuracy of 74.99%.",
            "We focus on DAMSL v2 in our comparison with other methods as it has the highest performance. DAMSL v2 (Aug) outperforms TransFT by 6.86% and ProtoNet by 15.21%. From Table 1, we see that DAMSL (Aug) v2 still significantly outperforms TransFT (Aug), with the exception of 5-way 5-shot Chest-X. In terms of average accuracy, DAMSL v2 (Aug) outperforms TransFT (Aug) by 3.84%.",
            "To investigate the effect of each component of separately, we include a Linear Ensemble (L-Ensem), a Fine-Tuned encoder + GNN (FT-GNN), and Score-based ProtoNets (S-Proto) in Table 1. The L-Ensem is a simple addition of the post-softmax scores from the two fine-tuned feature encoders, to see the performance from a simple fine-tuned ensemble. FT-GNN is directly fitted to a feature vector that has been fine-tuned on the support set, to demonstrate the performance boost from score-based learning. The Score-based ProtoNets replaces the GNN module with an embedding MLP and a nearest centroid classifier, to demonstrate the additional gains from a GNN module."
        ]
    },
    "S4.T2": {
        "caption": "Table 2: Results on Additional Test Domains",
        "table": null,
        "footnotes": [],
        "references": [
            "From Table 2, we clearly see that DAMSL v2 delivers out-performance over the previous baselines across almost all settings and all shots, with the only exception of 5-shot setting for Places. In terms of average accuracy, DAMSL v1 achieves 81.48% while DAMSL v2 achieves 85.46% . These values are considerably higher (>5%(>5\\%) than the linear ensembles, which yields 74.31% and 77.91% respectively. The results clearly validate our method as DAMSL performs better than previous methods on data-sets other than those in the BSCD-FSL benchmark."
        ]
    }
}