{
    "S4.T1": {
        "caption": "TABLE I: Statistics of Datasets",
        "table": null,
        "footnotes": [],
        "references": [
            "We evaluate the proposed framework on two real-world datasets, which have high quality and are widely used. including Taobao111https://tianchi.aliyun.com/dataset/dataDetail?dataId=649 and Tmall222https://tianchi.aliyun.com/dataset/dataDetail?dataId=47.\nTo ensure the quality of the datasets, we follow the customary practice [30] to discard users and items with less than five interactions of buy. We also filter users with too much interactions of page view in Tmall to discard noise. The statistics of the filtered datasets are shown in Table I.",
            "Table II lists the comparison experiment results for all methods on two datasets. Overall, the proposed framework HMG-CR with different graph encoders consistently and significantly outperforms all baselines in terms of all metrics. Particularly, our proposed framework has more significant improvement on the metric NDCG, which shows that our proposed framework pays more attention to sorting recommended items. Note that HMG-CR on dataset Taobao slightly outperforms that on dataset Tmall. According to the statistics of the two datasets, as shown in Table I, we note that the average numbers of total interactions for each user are close in two datasets, but there are differences among the distribution of numbers of different user behaviors. The ratio of add to cart in dataset Tmall is much less than that in dataset Taobao. Each user in both datasets has four hyper meta-graphs since there are four different types of user behaviors. Due to lack of add to cart in dataset Tmall, the third hyper meta-graph for a user, including page view, add to cart, and buy, is similar to the second hyper meta-graph for the user, including page view and buy. Under such a scenario, it is hard for graph contrastive learning to maximize the dissimilarities between the second hyper meta-graph and the third hyper meta-graph. Hence, the user behavior pattern embedding generated in this part would be misleading for unified user behavior pattern embedding generation."
        ]
    },
    "S4.T2": {
        "caption": "TABLE II: Comparison experiment results of HMG-CR and baselines",
        "table": null,
        "footnotes": [],
        "references": [
            "Table II lists the comparison experiment results for all methods on two datasets. Overall, the proposed framework HMG-CR with different graph encoders consistently and significantly outperforms all baselines in terms of all metrics. Particularly, our proposed framework has more significant improvement on the metric NDCG, which shows that our proposed framework pays more attention to sorting recommended items. Note that HMG-CR on dataset Taobao slightly outperforms that on dataset Tmall. According to the statistics of the two datasets, as shown in Table I, we note that the average numbers of total interactions for each user are close in two datasets, but there are differences among the distribution of numbers of different user behaviors. The ratio of add to cart in dataset Tmall is much less than that in dataset Taobao. Each user in both datasets has four hyper meta-graphs since there are four different types of user behaviors. Due to lack of add to cart in dataset Tmall, the third hyper meta-graph for a user, including page view, add to cart, and buy, is similar to the second hyper meta-graph for the user, including page view and buy. Under such a scenario, it is hard for graph contrastive learning to maximize the dissimilarities between the second hyper meta-graph and the third hyper meta-graph. Hence, the user behavior pattern embedding generated in this part would be misleading for unified user behavior pattern embedding generation.",
            "Graph Encoder Choosing a proper graph encoder for the framework determines whether it can achieve good performances. We select three common categories GNNs, conventional message passing based GNNs including SG [32] and GCN, attention mechanism based GNNs including GAT, and graph topological or geometric structure aware GNNs including TAG [28] and GIN [27]. The experiment results are shown in the Table II. According to the results, the proposed HMG-CR with any graph encoders outperforms all baselines. Specifically, HMG-CR with SG or GCN slightly outperforms baselines since conventional message passing based GNNs are insufficient to capture complex user behavior features from the constructed hyper meta-graphs. Despite the user-item interactions in the hyper meta-graphs, there are also chronological dependencies among different user behaviors. With such sophisticated relations in the hyper meta-graphs, GAT leverages attention mechanism to learn user behavior embeddings via adaptively distinguish different relations (edges) in the hyper-meta graphs. However, we replaced different types of edges, which represent user behaviors, with different types of nodes in the hyper meta-graphs. We explicitly add the information of interactions among users and items into the hyper meta-graph. It means that the improvement brought by attention mechanism, distinguishing different edges is limited. Note that the hyper meta-graphs have a structure which is similar to tree topology. Hence, the hyper meta-graphs have not only fruitful semantic information but also excellent structure. HMG-CR with graph structure aware graph encoders leverages the advantages of the hyper meta-graphs and achieve the best results in our experiments. To verify the improvement is brought by our proposed framework instead of TAG or GIN solely, we conduct supplementary experiments with TAG and GIN shown in the Table III."
        ]
    },
    "S4.T3": {
        "caption": "TABLE III: Supplementary experiment results of GIN and TAG",
        "table": null,
        "footnotes": [],
        "references": [
            "Graph Encoder Choosing a proper graph encoder for the framework determines whether it can achieve good performances. We select three common categories GNNs, conventional message passing based GNNs including SG [32] and GCN, attention mechanism based GNNs including GAT, and graph topological or geometric structure aware GNNs including TAG [28] and GIN [27]. The experiment results are shown in the Table II. According to the results, the proposed HMG-CR with any graph encoders outperforms all baselines. Specifically, HMG-CR with SG or GCN slightly outperforms baselines since conventional message passing based GNNs are insufficient to capture complex user behavior features from the constructed hyper meta-graphs. Despite the user-item interactions in the hyper meta-graphs, there are also chronological dependencies among different user behaviors. With such sophisticated relations in the hyper meta-graphs, GAT leverages attention mechanism to learn user behavior embeddings via adaptively distinguish different relations (edges) in the hyper-meta graphs. However, we replaced different types of edges, which represent user behaviors, with different types of nodes in the hyper meta-graphs. We explicitly add the information of interactions among users and items into the hyper meta-graph. It means that the improvement brought by attention mechanism, distinguishing different edges is limited. Note that the hyper meta-graphs have a structure which is similar to tree topology. Hence, the hyper meta-graphs have not only fruitful semantic information but also excellent structure. HMG-CR with graph structure aware graph encoders leverages the advantages of the hyper meta-graphs and achieve the best results in our experiments. To verify the improvement is brought by our proposed framework instead of TAG or GIN solely, we conduct supplementary experiments with TAG and GIN shown in the Table III."
        ]
    },
    "S4.T4": {
        "caption": "TABLE IV: Performances of HMG-CR(GAT) with different fusion layers on both datasets\n(β=0.4𝛽0.4\\beta=0.4 for dataset Taobao and β=0.2𝛽0.2\\beta=0.2 for dataset Tmall)",
        "table": null,
        "footnotes": [],
        "references": [
            "Fusion Layer Fusion layer is the output layer of the proposed framework. We focus on two categories of fusion layers, linear fusion layer, mean and sum, and non-linear fusion layer, MLP and PNLF. The experimental results are shown in the Table IV. According to the results, HMG-CR taking mean as the fusion layer achieves the best result.\nOverall, HMG-CR with linear fusion layer has better performances in our experiments. We note that there are mapping layers in MLP and PNLF.\nIn this component, mapping mechanism may disturb the user behavior pattern obtained in the space in which the graph contrastive learning was conducted. Hence, we should take linear fusion layer to output the unified user behavior pattern embeddings to avoid disturbing caused by conducting fusion in another embedding space."
        ]
    }
}