{
    "id1.1": {
        "caption": [],
        "table": "<table id=\"id1.1\" class=\"ltx_tabular\">\n<tr id=\"id1.1.1\" class=\"ltx_tr\">\n<td id=\"id1.1.1.1\" class=\"ltx_td\"><img src=\"/html/2206.15089/assets/figs/Nan.png\" id=\"id1.1.1.1.g1\" class=\"ltx_graphics ltx_img_portrait\" width=\"100\" height=\"125\" alt=\"[Uncaptioned image]\"></td>\n<td id=\"id1.1.1.2\" class=\"ltx_td\">\n<span id=\"id1.1.1.2.1\" class=\"ltx_inline-block\">\n<span id=\"id1.1.1.2.1.1\" class=\"ltx_p\"><span id=\"id1.1.1.2.1.1.1\" class=\"ltx_text ltx_font_bold\">Nan Wu</span>  is currently pursuing the Ph.D. degree with Macquarie University and CSIRO’s Data61, Australia. Nan received the B.S. degrees (Hons.) in electronic and communication systems from the Australian National University, Australia, in 2015, and from the Beijing Institute of Technology, China, in 2016, and the M.Res. degree in computer science from Macquarie University, Australia, in 2019. Her research interests include privacy-preserving machine learning, game theory, security and privacy, data sharing, data mining, and record linkage.</span>\n</span>\n</td>\n</tr>\n</table>\n",
        "footnotes": [],
        "references": []
    }
}{
    "id2.1": {
        "caption": [],
        "table": "<table id=\"id2.1\" class=\"ltx_tabular\">\n<tr id=\"id2.1.1\" class=\"ltx_tr\">\n<td id=\"id2.1.1.1\" class=\"ltx_td\"><img src=\"/html/2206.15089/assets/figs/Dinusha.jpg\" id=\"id2.1.1.1.g1\" class=\"ltx_graphics ltx_img_square\" width=\"100\" height=\"106\" alt=\"[Uncaptioned image]\"></td>\n<td id=\"id2.1.1.2\" class=\"ltx_td\">\n<span id=\"id2.1.1.2.1\" class=\"ltx_inline-block\">\n<span id=\"id2.1.1.2.1.1\" class=\"ltx_p\"><span id=\"id2.1.1.2.1.1.1\" class=\"ltx_text ltx_font_bold\">Dinusha Vatsalan</span> \nis a Senior Lecturer in Cyber Security at Macquarie University. Dinusha received her PhD in Computer Science from Australian National\nUniversity and BSc (Hons) from University of Colombo, Sri Lanka. She was\na Research Scientist at Data61, CSIRO.\nHer research interests include privacy-preserving technologies for record linkage, data mining, machine learning, data sharing, and data\nanalytics, privacy attacks and defences, and privacy risk quantification. Dinusha has authored over 60 scientific articles in these research topics.</span>\n</span>\n</td>\n</tr>\n</table>\n",
        "footnotes": [],
        "references": []
    }
}{
    "id3.1": {
        "caption": [],
        "table": "<table id=\"id3.1\" class=\"ltx_tabular\">\n<tr id=\"id3.1.1\" class=\"ltx_tr\">\n<td id=\"id3.1.1.1\" class=\"ltx_td\"><img src=\"/html/2206.15089/assets/figs/SunnyVerma.jpg\" id=\"id3.1.1.1.g1\" class=\"ltx_graphics ltx_img_portrait\" width=\"84\" height=\"125\" alt=\"[Uncaptioned image]\"></td>\n<td id=\"id3.1.1.2\" class=\"ltx_td\">\n<span id=\"id3.1.1.2.1\" class=\"ltx_inline-block\">\n<span id=\"id3.1.1.2.1.1\" class=\"ltx_p\"><span id=\"id3.1.1.2.1.1.1\" class=\"ltx_text ltx_font_bold\">Sunny Verma</span> \nreceived his Ph.D. degree in Computer Science from the University of Technology Sydney in 2020. He is currently working as Postdoctoral Research Fellow on identifying cyberattacks on Human-bot teams within AUSMURI at Macquarie University. He previously worked at the Data Science Institute, University of Technology Sydney, and Data61, CSIRO. His research interests include data mining, FATE, and interpretable deep learning.</span>\n</span>\n</td>\n</tr>\n</table>\n",
        "footnotes": [],
        "references": []
    }
}{
    "id4.1": {
        "caption": [],
        "table": "<table id=\"id4.1\" class=\"ltx_tabular\">\n<tr id=\"id4.1.1\" class=\"ltx_tr\">\n<td id=\"id4.1.1.1\" class=\"ltx_td\"><img src=\"/html/2206.15089/assets/figs/Dali.png\" id=\"id4.1.1.1.g1\" class=\"ltx_graphics ltx_img_portrait\" width=\"100\" height=\"125\" alt=\"[Uncaptioned image]\"></td>\n<td id=\"id4.1.1.2\" class=\"ltx_td\">\n<span id=\"id4.1.1.2.1\" class=\"ltx_inline-block\">\n<span id=\"id4.1.1.2.1.1\" class=\"ltx_p\"><span id=\"id4.1.1.2.1.1.1\" class=\"ltx_text ltx_font_bold\">Mohamed Ali (Dali) Kaafar</span> is a Professor at the Faculty of Science and Engineering at Macquarie University and the Executive Director of the Optus-Macquarie University Cyber Security Hub. He is also the founder of the Information Security and Privacy group at CSIRO Data61. Prior to that, Dali was the research leader of the Data Privacy and Mobile systems groups at NICTA and Senior principal researcher at INRIA, the French research institution of computer science and automation. He received his PhD from University of Nice Sophia Antipolis and INRIA in France where he pioneered research in the security of Internet Coordinate Systems.</span>\n<span id=\"id4.1.1.2.1.2\" class=\"ltx_p\">Prof. Kaafar is an associate editor of IEEE Transactions on Information Forensics &amp; Security and serves in the Editorial Board of the Journal on Privacy Enhancing Technologies. He published over 300 scientific peer-reviewed papers with several and repetitive publications in the prestigious IEEE Symposium on Security and Privacy (IEEE S&amp;P), ACM SIGCOMM, WWW, NDSS and PETS.\nHe received several awards including the INRIA Excellence of research National Award, and the Andreas Pfitzman award from the Privacy Enhancing Technologies symposium in 2011. In 2019, he has also been awarded the prestigious and selective Chinese Academy of Sciences President’s Professorial fellowship Award.</span>\n</span>\n</td>\n</tr>\n</table>\n",
        "footnotes": [],
        "references": []
    }
}