{
    "S8.T1": {
        "caption": "TABLE I: System Parameters",
        "table": null,
        "footnotes": [],
        "references": [
            "In this section, we evaluate the effectiveness of the proposed meta-IoT system.\nSpecifically, we first provide simulation results for the optimal meta-IoT structure obtained by AlgorithmÂ 1.\nThen, we provide the experimental results for the multi-antenna wireless transceiver to validate its capability of sensing meta-IoT sensor arrays at different heights.\nFollowing that, we provide the experimental results for the prototype system to detect and locate humidity and temperature anomalies, in the cases of different measuring distances, anomaly scales, noise levels, and depths of the neural network.\nThe detailed parameters of the system are summarized in TableÂ I.",
            "Then, the evaluation of the optimal meta-IoT structure obtained by AlgorithmÂ 1 is provided.\nSpecifically, when solving AlgorithmÂ 1, the same system parameters used in the experimental evaluation in TableÂ I are adopted.\nBesides, the additional parameters in the simulation can be explained as follows.\nThe thickness of the wall Dw=30subscriptğ·w30D_{\\mathrm{w}}=30 mm, and the relative index of refraction of the wall is nw=4.2subscriptğ‘›w4.2n_{\\mathrm{w}}=4.2 based onÂ [47].\nMoreover, we consider the performance of meta-IoT sensors in three environmental condition cases, which are the normal caseÂ (temperature 20âˆ˜superscript2020^{\\circ}C, humidity 55%percent5555\\%), temperature anomaly caseÂ (temperature 50âˆ˜superscript5050^{\\circ}C, humidity 55%percent5555\\%), and humidity anomaly caseÂ (temperature 20âˆ˜superscript2020^{\\circ}C, humidity 75%percent7575\\%).\nBased onÂ [46, 45], the conductivities of the temperature sensitive material in normal and anomaly cases are 0.320.320.32 and 0.970.970.97 [S/m], and those of the humidity sensitive material are 0.110.110.11 and 0.670.670.67 [S/m], respectively.\nFurthermore, the available meta-IoT structure set is ğ’ŸA={ğ’…|diâˆˆ[0.5,2]\\mathcal{D}_{\\mathrm{A}}=\\{\\bm{d}|d_{i}\\!\\in\\![0.5,2], diâˆˆâ„,i=1,2}d_{i}\\in\\mathbb{R},i\\!=\\!1,2\\}, which ensures the resonant absorption peaks of the two SRRs within [3.5,4]3.54[3.5,4] GHz, and the sampled meta-IoT structure set is ğ’Ÿ^A={ğ’…|diâˆˆ{0.5,1,1.5,2},i=1,2}subscript^ğ’ŸAconditional-setğ’…formulae-sequencesubscriptğ‘‘ğ‘–0.511.52ğ‘–12\\hat{\\mathcal{D}}_{\\mathrm{A}}=\\{\\bm{d}|d_{i}\\!\\in\\!\\{0.5,1,1.5,2\\},i\\!=\\!1,2\\}.\nGiven the above simulation setting, the optimal meta-IoT structure obtained by AlgorithmÂ 1 is ğ’…âˆ—=(1.126,1.761)superscriptğ’…1.1261.761\\bm{d}^{*}=(1.126,1.761) mm."
        ]
    },
    "S8.T2": {
        "caption": "TABLE II: Comparison of the proposed system with existing works",
        "table": null,
        "footnotes": [],
        "references": [
            "As a summary, we compare the proposed system with the existing works mentioned in SectionÂ II which use passive chipless sensors working in a similar frequency band and having similar functions.\nThe comparison results are shown in TableÂ II, where the sensitivity is defined by the deviation of the minimum reflected coefficient for a unit environmental condition change, i.e., for 1âˆ˜superscript11^{\\circ}C temperature or 1%percent11\\% humidity.\nFrom TableÂ II, the following three conclusions can be made."
        ]
    }
}