{
    "PAPER'S NUMBER OF TABLES": 2,
    "S3.T1": {
        "caption": "TABLE I: Classification of attacks in FL",
        "table": "<img src=\"/html/2211.14952/assets/x3.png\" id=\"S3.T1.g1\" class=\"ltx_graphics ltx_centering ltx_img_landscape\" width=\"196\" height=\"85\" alt=\"[Uncaptioned image]\">\n\n",
        "footnotes": "",
        "references": [
            "There are many types of attacks in FL, with different standards for the classification of attacks in previous studies. For instance, Chen et al. [43] classified attacks based on three different principles of information security named CIA (confidentiality, integrity, and availability). Liu et al. [42] listed the corresponding possible attacks based on the three phases of the FL (including data auditing, training, and predicting). Wu et al. [44] enumerated types of attacks according to the potential attackers of the FL system (including local workers, the central server, and the eavesdropper). In this section, we categorize and introduce the major attacks using the above criteria. As shown in Table I, we retain two classification standards: potential attack roles and three principles of information security. Since most attacks exist in the latter two phases, we remove the data auditing phase [42]. In addition, FL is usually in the training phase in most cases. However, we believe that for attackers, when the model is trained to a certain extent, they can enter the prediction stage and carry out some attacks through this stage, even though the model is not fully trained. Therefore, in our opinion, the prediction stage is also an important part of federated learning."
        ]
    },
    "S4.T2": {
        "caption": "TABLE II: Privacy protection methods in FL.",
        "table": "<img src=\"/html/2211.14952/assets/x4.png\" id=\"S4.T2.g1\" class=\"ltx_graphics ltx_centering ltx_img_landscape\" width=\"196\" height=\"103\" alt=\"[Uncaptioned image]\">\n\n",
        "footnotes": "",
        "references": [
            "In this section, some privacy protection methods are discussed for defending against attacks at the privacy level. Table II describes these approaches, including the types of attacks they defend against and their shortcomings."
        ]
    }
}