{
    "PAPER'S NUMBER OF TABLES": 8,
    "S1.T1": {
        "caption": "Table 1. Selected surveys of FL.",
        "table": "<table id=\"S1.T1.2\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S1.T1.2.1\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.1.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:70%;\">Paper</span></td>\n<td id=\"S1.T1.2.1.2\" class=\"ltx_td ltx_align_left ltx_border_tt\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.1.2.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:70%;\">Description</span></td>\n</tr>\n<tr id=\"S1.T1.2.2\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.2.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S1.T1.2.2.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Yang\net al<span class=\"ltx_text\">.</span><span id=\"S1.T1.2.2.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib156\" title=\"\" class=\"ltx_ref\">2019</a><span id=\"S1.T1.2.2.1.3.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite></td>\n<td id=\"S1.T1.2.2.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<table id=\"S1.T1.2.2.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S1.T1.2.2.2.1.1\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.2.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.2.2.1.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">Concepts and applications of FL in terms of its definition, privacy techniques, and</span></td>\n</tr>\n<tr id=\"S1.T1.2.2.2.1.2\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.2.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.2.2.1.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">categories, including horizontal FL, vertical FL, and federated transfer learning.</span></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S1.T1.2.3\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.3.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S1.T1.2.3.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Niknam\net al<span class=\"ltx_text\">.</span><span id=\"S1.T1.2.3.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib112\" title=\"\" class=\"ltx_ref\">2020</a><span id=\"S1.T1.2.3.1.3.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite></td>\n<td id=\"S1.T1.2.3.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<table id=\"S1.T1.2.3.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S1.T1.2.3.2.1.1\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.3.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.3.2.1.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">Federated machine learning in wireless networks in terms of its applications and challenges.</span></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S1.T1.2.4\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.4.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S1.T1.2.4.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Li\net al<span class=\"ltx_text\">.</span><span id=\"S1.T1.2.4.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib87\" title=\"\" class=\"ltx_ref\">2020f</a><span id=\"S1.T1.2.4.1.3.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite></td>\n<td id=\"S1.T1.2.4.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<table id=\"S1.T1.2.4.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S1.T1.2.4.2.1.1\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.4.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.4.2.1.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">Unique characteristics and challenges of FL, including expensive communication, systems heterogeneity,</span></td>\n</tr>\n<tr id=\"S1.T1.2.4.2.1.2\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.4.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.4.2.1.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">statistical heterogeneity, and privacy concerns, and existing studies and directions to solve these challenges.</span></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S1.T1.2.5\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.5.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S1.T1.2.5.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Wei\net al<span class=\"ltx_text\">.</span><span id=\"S1.T1.2.5.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib149\" title=\"\" class=\"ltx_ref\">2020</a><span id=\"S1.T1.2.5.1.3.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite></td>\n<td id=\"S1.T1.2.5.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<table id=\"S1.T1.2.5.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S1.T1.2.5.2.1.1\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.5.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.5.2.1.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">Survey on FL implementing in mobile edge networks in terms of several</span></td>\n</tr>\n<tr id=\"S1.T1.2.5.2.1.2\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.5.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.5.2.1.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">challenges, including communication costs, resource allocation, and privacy and security.</span></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S1.T1.2.6\" class=\"ltx_tr\">\n<td id=\"S1.T1.2.6.1\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S1.T1.2.6.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>et al<span id=\"S1.T1.2.6.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib35\" title=\"\" class=\"ltx_ref\">2019</a><span id=\"S1.T1.2.6.1.3.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite></td>\n<td id=\"S1.T1.2.6.2\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S1.T1.2.6.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Survey on comprehensive FL.</span></td>\n</tr>\n</table>\n\n",
        "footnotes": "",
        "references": [
            [
                "With the rapid development of information technology, a growing amount of data is generated by people’s daily activities, which has become an invaluable asset in modern society.\nBig data has created enormous benefits for society by providing businesses and individuals with new insights and foresights, but this reliance on data has also raised concerns about privacy and data security.",
                "In recent years, with the European Union’s enactment of the General Data Protection Regulation ",
                "(E.U., ",
                "2016",
                ")",
                " and legislative efforts in data security by the United States ",
                "(of the NATIONAL SCIENCE & TECHNOLOGY COUNCIL, ",
                "2019",
                ")",
                " and China ",
                "(CHINA, ",
                "2017",
                ")",
                ", data security and privacy protection have entered an important stage of development, i.e., the secure computation techniques including differential privacy, secure multi-party computing and FL have been increasingly emphasized and widely applied in various industries.",
                "Federated learning provides an effective solution for ensuring compliant and secure data flow. As a new paradigm of machine learning, it is essentially a distributed machine learning framework that collaboratively solves a learning task by the federation of participating clients which are coordinated by a central server. Typically, the procedures of FL involve client selection, broadcasting, the local computation with client’s own data and global aggregation on the server ",
                "(McMahan et al",
                ".",
                ", ",
                "2017",
                ")",
                ".\nIt has been generally categorized into the following architectures ",
                "(Yang\net al",
                ".",
                ", ",
                "2019",
                ")",
                ":",
                "Horizontal FL (HFL): HFL is the most common scenario in FL, where the data owners share the same feature space but different samples. HFL has been widely investigated since this scenario is widely popular in real applications. For example, with increasing health consciousness, a large amount of people wear smartwatch to monitor their health, these devices will generate massive data sharing the same features for collaboratively learning the model together with coordination of the central server.",
                "Vertical FL (VFL): VFL is mainly dealing with the case that the datasets over clients have different feature spaces but share the same sample ID space. It was first considered for two-party collaboration and recently has been extended to multiple-party scenario. VFL matches the real world applications very well. For example, a patient can have the medical record in different hospitals and each may have distinct features. With many samples, these hospitals will have more complete features and is able to jointly learn the model in a more accurate fashion.",
                "Federated transfer learning (FTL): FTL deals with the case that the dataset have both different feature spaces and sample ID spaces. For example, in social computing network ",
                "(Zhang\net al",
                ".",
                ", ",
                "2022",
                ")",
                ", it requires highly expensive and time consuming data labeling process. FTL techniques can be applied to alleviate the computation burden and provide the solutions for the entire sample and feature space under a federation.",
                "Additionally, FL can conveniently merge multiple techniques for application scenario expansions, further promoting the industrial development. For example, FL has been applied in edge computing, which efficiently leverages the edge device’s processing power to train the model, preventing the leakage of sensitive data without data transmission ",
                "(Xia\net al",
                ".",
                ", ",
                "2021",
                ")",
                ". Moreover, reinforcement learning has been incorporated for optimizing the resource allocations over both clients and servers ",
                "(Su\net al",
                ".",
                ", ",
                "2022",
                ")",
                ". It has reached the incentive mechanism to encourage the clients’ participation.",
                "Currently, the field of FL has witnessed many outstanding research achievements, and these include performance ",
                "(Sattler\net al",
                ".",
                ", ",
                "2021",
                "; Karimireddy et al",
                ".",
                ", ",
                "2020b",
                "; Li\net al",
                ".",
                ", ",
                "2020d",
                ")",
                " and security enhancements",
                "(Sun\net al",
                ".",
                ", ",
                "2021",
                "; Dubey and\nPentland, ",
                "2020",
                "; Geiping et al",
                ".",
                ", ",
                "2020",
                ")",
                ", etc. In terms of performance, FL frequently faces the issues of communication bottlenecks caused by heterogeneous networks, physical distance, and communication overhead. For mitigating these issues, novel FL algorithms have been investigated for improving the efficiency of training complex models. They include local and global acceleration strategies, asynchronous coordination, compression and sparsification. Regarding security issues, since FL requires participation from multiple parties, it may introduce extra security risks. In recent years, new solutions and technologies have emerged for enhancing security defense capabilities, resisting data leakage and backdoor attacks that may occur during the FL process. In summary, It is foreseeable that the huge demand for secure computing will drive the continuous and fast development of FL, including:",
                "The continuous improvement of the system and increasing unification of industry standards:",
                " the application of FL requires standardized specifications. With the rapidly increasing implementation, standard formulation work is also in progress. Various international organizations have started developing the standards of FL since 2018. Currently, IEEE and ITU-T have released framework and function standards ",
                "(iu-, ",
                "2021",
                "; 938, ",
                "2021",
                ")",
                ". Moreover, the security requirement standards and technical application standards for FL with multi-party secure computation are also in the process of being drafted.",
                "Increasingly diverse application scenarios and growing number of applications:",
                " many traditional industries that urgently require digital transformation have the characteristics of data-intensive, such as the financial industry and internet of things. They generally have large-scale application scenarios for data flow and put forward more stringent requirements for security management. These traditional industries are in an urgent need to establish the secure and private data flow to achieve effective data fusion and utilization. Therefore, FL can be a fit for ensuring the secure and compliant data flow and promotes the digital development of traditional industries.",
                "On the one hand, both the developments of applications and techniques in FL become increasingly mature, and on the other hand, the problems faced in FL applications are also becoming increasingly complicated. Therefore, our survey targets at answering the following questions:",
                "How to abstract problems from a specified actual application and propose solutions for FL?",
                "How to deploy multiple (semi-) decentralized parameter servers to establish a (semi-) decentralized FL system?",
                "How to build an efficient, secure, trustworthy, and scalable FL system?",
                "Differences between existing surveys.    ",
                "\nThere have been a number of existing surveys about FL techniques. Next, we provide the introduction of the representative surveys. As the pioneer FL survey,\nYang et al. ",
                "(Yang\net al",
                ".",
                ", ",
                "2019",
                ")",
                " introduce the concepts and applications of FL in terms of its definition, privacy techniques, and categories, including horizontal FL, vertical FL, and federated transfer learning.\nNiknam et al. ",
                "(Niknam\net al",
                ".",
                ", ",
                "2020",
                ")",
                " investigate federated machine learning in wireless networks in terms of its applications and challenges.\nLi et al. ",
                "(Li\net al",
                ".",
                ", ",
                "2020f",
                ")",
                " focus on unique characteristics and challenges of FL, including expensive communication, systems heterogeneity, statistical heterogeneity, and privacy concerns, and existing studies and directions to solve these challenges.\nWei et al. ",
                "(Wei\net al",
                ".",
                ", ",
                "2020",
                ")",
                " focus on FL implementing in mobile edge networks in terms of several challenges, including communication costs, resource allocation, and privacy and security.\nKairouz et al. ",
                "(et al, ",
                "2019",
                ")",
                " focus on the privacy and security issues in the FL system, and they mainly summarize existing studies in terms of attack methods and defence methods.",
                "Different from existing surveys, we have a thoughtful summary and discussion of existing literature, which not only digs deep into the existing perspectives, but also provides analysis from different perspectives.\nSpecifically, in terms of the FL architecture, based on the existing taxonomy, we further focus on the topological structures of the FL systems. Moreover, based on the seldom surveys on FedOpt ",
                "(et al., ",
                "2021",
                ")",
                ", we have summarized and analyzed the existing FedOpt algorithms, which play a key role in improving performance. In particular for many first-order FedOpt, we provide the general frameworks including local and global acceleration strategies. In addition, based on the existing surveys on FL applications, we have provided a generalized federated base models and offered our solutions to facilitate larger-scale applications.",
                "Our contributions.    ",
                "\nIn this survey, we provide a comprehensive and motivative review for targeting at developing high-performance and privacy-preserving approaches, as to integrate FL into real-world applications. To be specific, from theoretical perspectives, we review the architectures and optimization methods, both of which play a fundamental role in the performance. We review the FL applications, abstract the federated base models underlying them, and propose our solutions. Moreover, privacy and security are investigated with the existing attack scenarios and the defense methods. Finally, we classify the existing works in applications and project our insights into challenges and opportunities.\nOverall, we summarize the contributions we make in this survey as follows:\n",
                "New summarization on FL trends:",
                " We have conducted the extensive review in the topics of FL research papers and surveys from the year 2018 to 2022, ",
                "including 2,713 research papers and 93 surveys",
                ", and the results are shown in Fig. ",
                "1",
                ". In general, we can draw the conclusions as follows:",
                "A novel taxonomy:",
                "\nWith elaborately partitioning strategy to show the development of FL in each topic, we can classify the existing FL works into knowledge domain, privacy and security, network, real application, architecture, theoretical approach, and graph domain. In particular, optimization theory dominates the theoretical approach in FL.",
                "Rapid development:",
                " FL has been maintaining a fast development speed. In particular, there are 1,389 FL papers released in 2022, which is nearly the sum of works in previous years. Especially, with the development of smart city worldwide, the FL applications will maintain a fast growth speed, which will also drive the theoretical approach development.",
                "Lack of surveys in theoretical approaches:",
                " We also find the FL field lacks significantly the related surveys in theoretical approaches, while they are the underlying basis supporting the FL development. Although the year 2022 has witnessed FL surveys becoming booming on broad topics, there are only exactly 2 surveys on the theoretical approach topic.",
                "Federated base model abstraction and our proposed solutions:",
                " From Fig. ",
                "1",
                ", we can see FL applications constitute a significant proportion in the studies on FL. We project our insights into these applications and abstract the problems, then we have thoroughly analyzed and classified these problems with federated solutions. In general, the underlying issues of these applications can be reduced to the popular machine learning model training, non-smooth regularization, multi-task learning, and matrix factorization, in the context of FL. ",
                "It is worth emphasizing that we have provided novel approaches for learning these models under federated settings. ",
                "Proposed algorithmic design frameworks:",
                " FedOpt algorithms play the fundamental role in FL and they also occupy a significant proportion in the research efforts of FL. Therefore, we carry out a comprehensive review of the works in FedOpt algorithms, delving deeply into the generalization of the common patterns underlying these algorithms. Specifically, the FedOpt algorithms are identified into first-order (majority in FedOpt), second-order and ADMM based scenarios. In particular, we further generalize the existing first-order works into the local acceleration and global acceleration frameworks respectively, which can be simply instantiated for algorithm development. ",
                "To the best of our knowledge, we are among the first-tier for comprehensively surveying the theoretical approaches in FedOpt.",
                "The rest of this survey is organized as follows: Section ",
                "2",
                " discusses the FL architectures. Section ",
                "3",
                " illustrates the application problem abstraction. In Section ",
                "4",
                ", FedOpt algorithms are reviewed and we also provide the instantiations in the supplementary material. Section ",
                "5",
                " studies the privacy and security issues. Section ",
                "6",
                " presents both the technical and real applications. Section ",
                "7",
                " illustrate the challenges and future directions."
            ]
        ]
    },
    "S2.T2": {
        "caption": "Table 2. Existing architectures in FL.",
        "table": "<table id=\"S2.T2.2\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S2.T2.2.1\" class=\"ltx_tr\">\n<td id=\"S2.T2.2.1.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S2.T2.2.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Categories</span></td>\n<td id=\"S2.T2.2.1.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S2.T2.2.1.2.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Topological structure</span></td>\n<td id=\"S2.T2.2.1.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S2.T2.2.1.3.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Feature</span></td>\n<td id=\"S2.T2.2.1.4\" class=\"ltx_td ltx_align_left ltx_border_tt\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S2.T2.2.1.4.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Ref.</span></td>\n</tr>\n<tr id=\"S2.T2.2.2\" class=\"ltx_tr\">\n<td id=\"S2.T2.2.2.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\" rowspan=\"2\"><span id=\"S2.T2.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Centralized FL</span></td>\n<td id=\"S2.T2.2.2.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S2.T2.2.2.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Traditional Centralized FL</span></td>\n<td id=\"S2.T2.2.2.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S2.T2.2.2.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">One centralized server aggregates all model parameters updated by clients.</span></td>\n<td id=\"S2.T2.2.2.4\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<span id=\"S2.T2.2.2.4.1\" class=\"ltx_text\"></span><span id=\"S2.T2.2.2.4.2\" class=\"ltx_text\" style=\"font-size:50%;\">\n<span id=\"S2.T2.2.2.4.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S2.T2.2.2.4.2.1.1\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.2.4.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\">(McMahan et al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib105\" title=\"\" class=\"ltx_ref\">2017</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Yang\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib158\" title=\"\" class=\"ltx_ref\">2021a</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Yang\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib155\" title=\"\" class=\"ltx_ref\">2020</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Xu\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib154\" title=\"\" class=\"ltx_ref\">2021</a>)</cite>,</span></span>\n<span id=\"S2.T2.2.2.4.2.1.2\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.2.4.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\">(Fan\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib38\" title=\"\" class=\"ltx_ref\">2021</a>)</cite></span></span>\n</span></span><span id=\"S2.T2.2.2.4.3\" class=\"ltx_text\"></span><span id=\"S2.T2.2.2.4.4\" class=\"ltx_text\" style=\"font-size:50%;\"></span>\n</td>\n</tr>\n<tr id=\"S2.T2.2.3\" class=\"ltx_tr\">\n<td id=\"S2.T2.2.3.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S2.T2.2.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Hierarchical FL</span></td>\n<td id=\"S2.T2.2.3.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<span id=\"S2.T2.2.3.2.1\" class=\"ltx_text\"></span><span id=\"S2.T2.2.3.2.2\" class=\"ltx_text\" style=\"font-size:50%;\">\n<span id=\"S2.T2.2.3.2.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S2.T2.2.3.2.2.1.1\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.3.2.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">The client-edge-cloud structure:</span></span>\n<span id=\"S2.T2.2.3.2.2.1.2\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.3.2.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">One cloud server is connected to edge servers in the middle layer.</span></span>\n<span id=\"S2.T2.2.3.2.2.1.3\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.3.2.2.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">Every edge server connects to partial clients in the bottom layer.</span></span>\n</span></span><span id=\"S2.T2.2.3.2.3\" class=\"ltx_text\"></span><span id=\"S2.T2.2.3.2.4\" class=\"ltx_text\" style=\"font-size:50%;\"></span>\n</td>\n<td id=\"S2.T2.2.3.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<span id=\"S2.T2.2.3.3.1\" class=\"ltx_text\"></span><span id=\"S2.T2.2.3.3.2\" class=\"ltx_text\" style=\"font-size:50%;\">\n<span id=\"S2.T2.2.3.3.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S2.T2.2.3.3.2.1.1\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.3.3.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\">(Liu\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib96\" title=\"\" class=\"ltx_ref\">2020d</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Shi\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib129\" title=\"\" class=\"ltx_ref\">2021</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Wang and Wang, <a href=\"#bib.bib147\" title=\"\" class=\"ltx_ref\">2022</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Zheng\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib169\" title=\"\" class=\"ltx_ref\">2021</a>)</cite>,</span></span>\n<span id=\"S2.T2.2.3.3.2.1.2\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.3.3.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\">(Abad\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib4\" title=\"\" class=\"ltx_ref\">2020</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Aygün et al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib13\" title=\"\" class=\"ltx_ref\">2022</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Liu\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib98\" title=\"\" class=\"ltx_ref\">2022b</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Xu\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib153\" title=\"\" class=\"ltx_ref\">2022</a>)</cite>,</span></span>\n<span id=\"S2.T2.2.3.3.2.1.3\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.3.3.2.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\">(De Rango et al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib30\" title=\"\" class=\"ltx_ref\">2021</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Zhong\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib171\" title=\"\" class=\"ltx_ref\">2022b</a>)</cite></span></span>\n</span></span><span id=\"S2.T2.2.3.3.3\" class=\"ltx_text\" style=\"font-size:50%;\"> </span><span id=\"S2.T2.2.3.3.4\" class=\"ltx_text\"></span><span id=\"S2.T2.2.3.3.5\" class=\"ltx_text\" style=\"font-size:50%;\">.</span>\n</td>\n</tr>\n<tr id=\"S2.T2.2.4\" class=\"ltx_tr\">\n<td id=\"S2.T2.2.4.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S2.T2.2.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Decentralized FL</span></td>\n<td id=\"S2.T2.2.4.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S2.T2.2.4.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Decentralized FL</span></td>\n<td id=\"S2.T2.2.4.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<span id=\"S2.T2.2.4.3.1\" class=\"ltx_text\"></span><span id=\"S2.T2.2.4.3.2\" class=\"ltx_text\" style=\"font-size:50%;\">\n<span id=\"S2.T2.2.4.3.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S2.T2.2.4.3.2.1.1\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.4.3.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">Without central server.</span></span>\n<span id=\"S2.T2.2.4.3.2.1.2\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.4.3.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">All clients communicate with each other in a distributed way.</span></span>\n</span></span><span id=\"S2.T2.2.4.3.3\" class=\"ltx_text\"></span><span id=\"S2.T2.2.4.3.4\" class=\"ltx_text\" style=\"font-size:50%;\"></span>\n</td>\n<td id=\"S2.T2.2.4.4\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<span id=\"S2.T2.2.4.4.1\" class=\"ltx_text\"></span><span id=\"S2.T2.2.4.4.2\" class=\"ltx_text\" style=\"font-size:50%;\">\n<span id=\"S2.T2.2.4.4.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S2.T2.2.4.4.2.1.1\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.4.4.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\">(Kim\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib69\" title=\"\" class=\"ltx_ref\">2020</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Korkmaz et al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib77\" title=\"\" class=\"ltx_ref\">2020</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Tseng\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib140\" title=\"\" class=\"ltx_ref\">2022</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Liu\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib100\" title=\"\" class=\"ltx_ref\">2022a</a>)</cite>,</span></span>\n<span id=\"S2.T2.2.4.4.2.1.2\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.4.4.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\">(Hashemi et al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib56\" title=\"\" class=\"ltx_ref\">2022</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Gholami\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib46\" title=\"\" class=\"ltx_ref\">2022</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Gouissem et al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib52\" title=\"\" class=\"ltx_ref\">2022</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Che\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib22\" title=\"\" class=\"ltx_ref\">2022</a>)</cite>,</span></span>\n<span id=\"S2.T2.2.4.4.2.1.3\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.4.4.2.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\">(Li\net al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib80\" title=\"\" class=\"ltx_ref\">2022a</a>)</cite>, <cite class=\"ltx_cite ltx_citemacro_citep\">(Xiao et al<span class=\"ltx_text\">.</span>, <a href=\"#bib.bib152\" title=\"\" class=\"ltx_ref\">2021</a>)</cite></span></span>\n</span></span><span id=\"S2.T2.2.4.4.3\" class=\"ltx_text\" style=\"font-size:50%;\"> </span><span id=\"S2.T2.2.4.4.4\" class=\"ltx_text\"></span><span id=\"S2.T2.2.4.4.5\" class=\"ltx_text\" style=\"font-size:50%;\">.</span>\n</td>\n</tr>\n<tr id=\"S2.T2.2.5\" class=\"ltx_tr\">\n<td id=\"S2.T2.2.5.1\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\" rowspan=\"4\"><span id=\"S2.T2.2.5.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Clustered FL</span></td>\n<td id=\"S2.T2.2.5.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<span id=\"S2.T2.2.5.2.1\" class=\"ltx_text\"></span><span id=\"S2.T2.2.5.2.2\" class=\"ltx_text\" style=\"font-size:50%;\">\n<span id=\"S2.T2.2.5.2.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S2.T2.2.5.2.2.1.1\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.5.2.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">Centralized Intra-cluster,</span></span>\n<span id=\"S2.T2.2.5.2.2.1.2\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.5.2.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">Decentralized Inter-cluster</span></span>\n</span></span><span id=\"S2.T2.2.5.2.3\" class=\"ltx_text\"></span><span id=\"S2.T2.2.5.2.4\" class=\"ltx_text\" style=\"font-size:50%;\"></span>\n</td>\n<td id=\"S2.T2.2.5.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<span id=\"S2.T2.2.5.3.1\" class=\"ltx_text\"></span><span id=\"S2.T2.2.5.3.2\" class=\"ltx_text\" style=\"font-size:50%;\">\n<span id=\"S2.T2.2.5.3.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S2.T2.2.5.3.2.1.1\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.5.3.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">Some client are connected with one edge server.</span></span>\n<span id=\"S2.T2.2.5.3.2.1.2\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.5.3.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">The edge servers are decentraliedly connected with each other.</span></span>\n</span></span><span id=\"S2.T2.2.5.3.3\" class=\"ltx_text\"></span><span id=\"S2.T2.2.5.3.4\" class=\"ltx_text\" style=\"font-size:50%;\"></span>\n</td>\n<td id=\"S2.T2.2.5.4\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S2.T2.2.5.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Gou\net al<span class=\"ltx_text\">.</span><span id=\"S2.T2.2.5.4.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib51\" title=\"\" class=\"ltx_ref\">2022</a><span id=\"S2.T2.2.5.4.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite><span id=\"S2.T2.2.5.4.4\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S2.T2.2.5.4.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Sun\net al<span class=\"ltx_text\">.</span><span id=\"S2.T2.2.5.4.6.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib136\" title=\"\" class=\"ltx_ref\">2022</a><span id=\"S2.T2.2.5.4.7.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite><span id=\"S2.T2.2.5.4.8\" class=\"ltx_text\" style=\"font-size:50%;\">.</span>\n</td>\n</tr>\n<tr id=\"S2.T2.2.6\" class=\"ltx_tr\">\n<td id=\"S2.T2.2.6.1\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<span id=\"S2.T2.2.6.1.1\" class=\"ltx_text\"></span><span id=\"S2.T2.2.6.1.2\" class=\"ltx_text\" style=\"font-size:50%;\">\n<span id=\"S2.T2.2.6.1.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S2.T2.2.6.1.2.1.1\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.6.1.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">Decentralized Intra-cluster,</span></span>\n<span id=\"S2.T2.2.6.1.2.1.2\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.6.1.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">Centralized Inter-cluster</span></span>\n</span></span><span id=\"S2.T2.2.6.1.3\" class=\"ltx_text\"></span><span id=\"S2.T2.2.6.1.4\" class=\"ltx_text\" style=\"font-size:50%;\"></span>\n</td>\n<td id=\"S2.T2.2.6.2\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<span id=\"S2.T2.2.6.2.1\" class=\"ltx_text\"></span><span id=\"S2.T2.2.6.2.2\" class=\"ltx_text\" style=\"font-size:50%;\">\n<span id=\"S2.T2.2.6.2.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S2.T2.2.6.2.2.1.1\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.6.2.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">Each client is decentraliedly connected with each other.</span></span>\n<span id=\"S2.T2.2.6.2.2.1.2\" class=\"ltx_tr\">\n<span id=\"S2.T2.2.6.2.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">Global aggregations is aggregated by a central server.</span></span>\n</span></span><span id=\"S2.T2.2.6.2.3\" class=\"ltx_text\"></span><span id=\"S2.T2.2.6.2.4\" class=\"ltx_text\" style=\"font-size:50%;\"></span>\n</td>\n<td id=\"S2.T2.2.6.3\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S2.T2.2.6.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Ghosh\net al<span class=\"ltx_text\">.</span><span id=\"S2.T2.2.6.3.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib47\" title=\"\" class=\"ltx_ref\">2020a</a><span id=\"S2.T2.2.6.3.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite><span id=\"S2.T2.2.6.3.4\" class=\"ltx_text\" style=\"font-size:50%;\">,</span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S2.T2.2.6.3.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Lin et al<span class=\"ltx_text\">.</span><span id=\"S2.T2.2.6.3.6.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib91\" title=\"\" class=\"ltx_ref\">2021</a><span id=\"S2.T2.2.6.3.7.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite><span id=\"S2.T2.2.6.3.8\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S2.T2.2.6.3.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Li\net al<span class=\"ltx_text\">.</span><span id=\"S2.T2.2.6.3.10.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib81\" title=\"\" class=\"ltx_ref\">2022b</a><span id=\"S2.T2.2.6.3.11.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite><span id=\"S2.T2.2.6.3.12\" class=\"ltx_text\" style=\"font-size:50%;\">.</span>\n</td>\n</tr>\n</table>\n\n",
        "footnotes": "",
        "references": [
            [
                "In practice, the centralized FL is vulnerable when suffering from server malfunctions, malicious attacks and untrustworthy servers. For addressing these issues, Li et al. ",
                "(Li et al",
                ".",
                ", ",
                "2022c",
                ")",
                " propose a decentralized framework with the integration of the blockchain to delegate the responsibility of storing the model to the nodes on the network, it also optimizes the computing resource allocation. Liu et al. ",
                "(Liu\net al",
                ".",
                ", ",
                "2022a",
                ")",
                " suggest a generic decentralized FL framework , which implements both multiple local updates and multiple inter-node communications with the compression technique periodically. Hashemi et al. ",
                "(Hashemi et al",
                ".",
                ", ",
                "2022",
                ")",
                " propose DeLi-CoCo and demonstrate how the decentralized FL benefiting from additional gossip stages between gradient iterations for faster convergence. For further improving the performance, Li et al. ",
                "(Li\net al",
                ".",
                ", ",
                "2022a",
                ")",
                " propose a Def-KT algorithm to fuse models among clients by transferring their learned knowledge to each other and has alleviated the client-drift issue. Xiao et al. ",
                "(Xiao et al",
                ".",
                ", ",
                "2021",
                ")",
                " develop a decentralized FL framework with an inexact stochastic parallel random walk, which can be partially immune to the time-varying dynamic\nnetwork.",
                "In terms of security, since decentralized clients can only talk to their neighbors, the dissensus attack can poison the clients’ collaboration. To overcome this issue, He et al. ",
                "(He\net al",
                ".",
                ", ",
                "2022",
                ")",
                " propose a Self-Centered Clipping (SCClip) algorithm for Byzantine-robust consensus and optimization. Che et al. ",
                "(Che\net al",
                ".",
                ", ",
                "2022",
                ")",
                " adopt the committee mechanism to track the uploaded local gradients, which has shown both performance and security improvement."
            ]
        ]
    },
    "S3.T3": {
        "caption": "Table 3. Training models via FL paradigm.",
        "table": "<table id=\"S3.T3.2\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S3.T3.2.1\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.1.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:70%;\">Model</span></td>\n<td id=\"S3.T3.2.1.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.1.2.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:70%;\">Federated training procedure</span></td>\n</tr>\n<tr id=\"S3.T3.2.2\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.2.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">MLP</span></td>\n<td id=\"S3.T3.2.2.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\" rowspan=\"4\"><span id=\"S3.T3.2.2.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">\n<span id=\"S3.T3.2.2.2.1.1\" class=\"ltx_tabular ltx_align_middle\">\n<span id=\"S3.T3.2.2.2.1.1.1\" class=\"ltx_tr\">\n<span id=\"S3.T3.2.2.2.1.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\">The client performs multiple SGD to obtain the local model,</span></span>\n<span id=\"S3.T3.2.2.2.1.1.2\" class=\"ltx_tr\">\n<span id=\"S3.T3.2.2.2.1.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\">and then the server performs aggregation to update the global model.</span></span>\n</span></span></td>\n</tr>\n<tr id=\"S3.T3.2.3\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.3.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.3.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">CNN</span></td>\n</tr>\n<tr id=\"S3.T3.2.4\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.4.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.4.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">LSTM</span></td>\n</tr>\n<tr id=\"S3.T3.2.5\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.5.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.5.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">GRU</span></td>\n</tr>\n<tr id=\"S3.T3.2.6\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.6.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.6.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">TM</span></td>\n<td id=\"S3.T3.2.6.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\">\n<table id=\"S3.T3.2.6.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S3.T3.2.6.2.1.1\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.6.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.6.2.1.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">The client performs Metropolis Hastings based private computations to obtain the local model,</span></td>\n</tr>\n<tr id=\"S3.T3.2.6.2.1.2\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.6.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.6.2.1.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">then the server performs integration of the received local topic models.</span></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S3.T3.2.7\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.7.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\">\n<table id=\"S3.T3.2.7.1.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S3.T3.2.7.1.1.1\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.7.1.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.7.1.1.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">Nonsmooth</span></td>\n</tr>\n<tr id=\"S3.T3.2.7.1.1.2\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.7.1.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.7.1.1.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">regularization</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S3.T3.2.7.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\">\n<table id=\"S3.T3.2.7.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S3.T3.2.7.2.1.1\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.7.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.7.2.1.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">The client performs multiple mirror descent steps to update the local model and</span></td>\n</tr>\n<tr id=\"S3.T3.2.7.2.1.2\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.7.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.7.2.1.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">then the server performs aggregation to update the global model.</span></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S3.T3.2.8\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.8.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.8.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">MTL</span></td>\n<td id=\"S3.T3.2.8.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\">\n<table id=\"S3.T3.2.8.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S3.T3.2.8.2.1.1\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.8.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.8.2.1.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">The client performs ADMM subproblems to update the local model and Lagrangian multiplier</span></td>\n</tr>\n<tr id=\"S3.T3.2.8.2.1.2\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.8.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.8.2.1.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">and the server performs the aggregation to obtain the global model corresponding to the task.</span></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S3.T3.2.9\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.9.1\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.9.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">MF</span></td>\n<td id=\"S3.T3.2.9.2\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_t\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\">\n<table id=\"S3.T3.2.9.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S3.T3.2.9.2.1.1\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.9.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.9.2.1.1.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">The client performs ADMM subproblems to update user item vector and Lagrangian multiplier</span></td>\n</tr>\n<tr id=\"S3.T3.2.9.2.1.2\" class=\"ltx_tr\">\n<td id=\"S3.T3.2.9.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:1.05pt;padding-bottom:1.05pt;\"><span id=\"S3.T3.2.9.2.1.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">and the server performs the subproblem to update the item profile matrix.</span></td>\n</tr>\n</table>\n</td>\n</tr>\n</table>\n\n",
        "footnotes": "",
        "references": [
            [
                "While FL techniques have laid the foundation of massive applications, the fast growing applications will adversely demand the development of techniques. Through comprehensively surveying the applications of FL, we further deeply abstract the application problems and explore the underlying techniques that support these applications. As a result, ",
                "they can be generally categorized into a basic paradigm consisting of a federated base model combined with a federated training framework",
                ". Specifically, we first discuss several popular machine learning models, which can be straightforwardly trained through the popular FL methods. Furthermore, we discuss the nonsmooth regularization due to its promising potential in biomedical applications. Considering the more general and practical fashion that different clients may have different tasks, we introduce multi-task learning under FL solution. Next follows matrix factorization, which has been widely employed in recommendation systems, our strategy is to formulate the problem with nuclear norm to accurately constrain the matrix being low-ranked. In general, our goal is to provide the FL schemes covering sufficient cases to facilitate larger-scale FL applications."
            ]
        ]
    },
    "S4.T4": {
        "caption": "Table 4. Representative federated optimization methods based on first-order gradient. Specifically, M.D. is acronym for model divergence, synchony and asynchrony are abbreviated as SC and AS respectively, the abbreviation of partial client participation is PCP.",
        "table": "<table id=\"S4.T4.27.27\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S4.T4.27.27.28\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Algorithm</span></td>\n<td id=\"S4.T4.27.27.28.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.28.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.28.2.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.2.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Local</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.28.2.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.2.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.27.27.28.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.28.3.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.28.3.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.3.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.3.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Local</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.28.3.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.3.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.3.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">steps</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.27.27.28.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.28.4.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.28.4.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.4.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.4.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Local</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.28.4.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.4.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.4.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">complexity</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.27.27.28.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.28.5.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.28.5.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.5.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.5.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Transmission</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.28.5.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.5.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.5.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">quantity</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.27.27.28.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.28.6.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.28.6.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.6.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.6.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Global</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.28.6.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.6.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.6.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.27.27.28.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.28.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.28.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.7.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Convergence</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.28.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.7.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">speed</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.27.27.28.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.28.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.28.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.8.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Dealing</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.28.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.28.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.8.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">with M.D.</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.27.27.28.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.9.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">SC/AS</span></td>\n<td id=\"S4.T4.27.27.28.10\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.28.10.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">PCP</span></td>\n</tr>\n<tr id=\"S4.T4.3.3.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">VRL-SGD</span></td>\n<td id=\"S4.T4.3.3.3.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.3.3.3.5.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.3.3.3.5.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.5.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.5.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Variance</span></td>\n</tr>\n<tr id=\"S4.T4.3.3.3.5.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.5.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.5.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">reduced</span></td>\n</tr>\n<tr id=\"S4.T4.3.3.3.5.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.5.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.5.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">SGD</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.3.3.3.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.3.3.3.6.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.3.3.3.6.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.6.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.6.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Multiple</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.1.1.1.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.1.1.1.1.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.1.1.1.1.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.1.1.1.1.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.1.1.1.1.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(T\\cdot d)\" display=\"inline\"><semantics id=\"S4.T4.1.1.1.1.1.1.1.m1.1a\"><mrow id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.3\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.2\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.2\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.cmml\">(</mo><mrow id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.cmml\"><mi mathsize=\"50%\" id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.2\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.2.cmml\">T</mi><mo lspace=\"0.222em\" mathsize=\"50%\" rspace=\"0.222em\" id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.1\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.1.cmml\">⋅</mo><mi mathsize=\"50%\" id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.3\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.3.cmml\">d</mi></mrow><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.3\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.1.1.1.1.1.1.1.m1.1b\"><apply id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1\"><times id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.2\"></times><ci id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1\"><ci id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.1\">⋅</ci><ci id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.2\">𝑇</ci><ci id=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T4.1.1.1.1.1.1.1.m1.1.1.1.1.1.3\">𝑑</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.1.1.1.1.1.1.1.m1.1c\">\\mathcal{O}(T\\cdot d)</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.3.3.3.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.3.3.3.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.3.3.3.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local and</span></td>\n</tr>\n<tr id=\"S4.T4.3.3.3.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global models</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.3.3.3.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.3.3.3.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.3.3.3.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Weight</span></td>\n</tr>\n<tr id=\"S4.T4.3.3.3.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">averaging</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.2.2.2.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.2.2.2.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.2.2.2.2.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.2.2.2.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.2.2.2.2.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}\\big{(}\\frac{1}{R}\\big{)}\" display=\"inline\"><semantics id=\"S4.T4.2.2.2.2.1.1.1.m1.1a\"><mrow id=\"S4.T4.2.2.2.2.1.1.1.m1.1.2\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.2\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.1\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.3.2\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.cmml\"><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.3.2.1\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T4.2.2.2.2.1.1.1.m1.1.1\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.2\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.2.cmml\">1</mn><mi mathsize=\"50%\" id=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.3\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.3.cmml\">R</mi></mfrac><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.3.2.2\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.2.2.2.2.1.1.1.m1.1b\"><apply id=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.cmml\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.2\"><times id=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.1.cmml\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.1\"></times><ci id=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.2.cmml\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.2\">𝒪</ci><apply id=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.3.2\"><divide id=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.1.cmml\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.2\">1</cn><ci id=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T4.2.2.2.2.1.1.1.m1.1.1.3\">𝑅</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.2.2.2.2.1.1.1.m1.1c\">\\mathcal{O}\\big{(}\\frac{1}{R}\\big{)}</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.3.3.3.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.3.3.3.9.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.3.3.3.9.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.9.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.9.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.3.3.3.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.3.3.3.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">SC</span></td>\n<td id=\"S4.T4.3.3.3.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.3.3.3.3.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.3.3.3.3.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.3.3.3.3.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.3.3.3.3.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\times\" display=\"inline\"><semantics id=\"S4.T4.3.3.3.3.1.1.1.m1.1a\"><mo mathsize=\"50%\" id=\"S4.T4.3.3.3.3.1.1.1.m1.1.1\" xref=\"S4.T4.3.3.3.3.1.1.1.m1.1.1.cmml\">×</mo><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.3.3.3.3.1.1.1.m1.1b\"><times id=\"S4.T4.3.3.3.3.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.3.3.3.3.1.1.1.m1.1.1\"></times></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.3.3.3.3.1.1.1.m1.1c\">\\times</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S4.T4.6.6.6\" class=\"ltx_tr\">\n<td id=\"S4.T4.6.6.6.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">MFL</span></td>\n<td id=\"S4.T4.6.6.6.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">MGD</span></td>\n<td id=\"S4.T4.6.6.6.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.6.1\" class=\"ltx_text\" style=\"font-size:50%;\">Multiple</span></td>\n<td id=\"S4.T4.4.4.4.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.4.4.4.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(Td)\" display=\"inline\"><semantics id=\"S4.T4.4.4.4.1.m1.1a\"><mrow id=\"S4.T4.4.4.4.1.m1.1.1\" xref=\"S4.T4.4.4.4.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.4.4.4.1.m1.1.1.3\" xref=\"S4.T4.4.4.4.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.4.4.4.1.m1.1.1.2\" xref=\"S4.T4.4.4.4.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T4.4.4.4.1.m1.1.1.1.1\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.4.4.4.1.m1.1.1.1.1.2\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.cmml\">(</mo><mrow id=\"S4.T4.4.4.4.1.m1.1.1.1.1.1\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.cmml\"><mi mathsize=\"50%\" id=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.2\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.2.cmml\">T</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.1\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.1.cmml\">​</mo><mi mathsize=\"50%\" id=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.3\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.3.cmml\">d</mi></mrow><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.4.4.4.1.m1.1.1.1.1.3\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.4.4.4.1.m1.1b\"><apply id=\"S4.T4.4.4.4.1.m1.1.1.cmml\" xref=\"S4.T4.4.4.4.1.m1.1.1\"><times id=\"S4.T4.4.4.4.1.m1.1.1.2.cmml\" xref=\"S4.T4.4.4.4.1.m1.1.1.2\"></times><ci id=\"S4.T4.4.4.4.1.m1.1.1.3.cmml\" xref=\"S4.T4.4.4.4.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1\"><times id=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.1\"></times><ci id=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.2\">𝑇</ci><ci id=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T4.4.4.4.1.m1.1.1.1.1.1.3\">𝑑</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.4.4.4.1.m1.1c\">\\mathcal{O}(Td)</annotation></semantics></math></td>\n<td id=\"S4.T4.6.6.6.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.6.6.6.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.6.6.6.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.6.6.6.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local model</span></td>\n</tr>\n<tr id=\"S4.T4.6.6.6.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.6.6.6.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and momentum</span></td>\n</tr>\n<tr id=\"S4.T4.6.6.6.7.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.6.6.6.7.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.7.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global model</span></td>\n</tr>\n<tr id=\"S4.T4.6.6.6.7.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T4.6.6.6.7.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.7.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and momentum</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.6.6.6.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.6.6.6.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.6.6.6.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.6.6.6.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Weight</span></td>\n</tr>\n<tr id=\"S4.T4.6.6.6.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.6.6.6.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">averaging</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.5.5.5.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.5.5.5.2.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(\\frac{1}{R})\" display=\"inline\"><semantics id=\"S4.T4.5.5.5.2.m1.1a\"><mrow id=\"S4.T4.5.5.5.2.m1.1.2\" xref=\"S4.T4.5.5.5.2.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.5.5.5.2.m1.1.2.2\" xref=\"S4.T4.5.5.5.2.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.5.5.5.2.m1.1.2.1\" xref=\"S4.T4.5.5.5.2.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.5.5.5.2.m1.1.2.3.2\" xref=\"S4.T4.5.5.5.2.m1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.5.5.5.2.m1.1.2.3.2.1\" xref=\"S4.T4.5.5.5.2.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T4.5.5.5.2.m1.1.1\" xref=\"S4.T4.5.5.5.2.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T4.5.5.5.2.m1.1.1.2\" xref=\"S4.T4.5.5.5.2.m1.1.1.2.cmml\">1</mn><mi mathsize=\"50%\" id=\"S4.T4.5.5.5.2.m1.1.1.3\" xref=\"S4.T4.5.5.5.2.m1.1.1.3.cmml\">R</mi></mfrac><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.5.5.5.2.m1.1.2.3.2.2\" xref=\"S4.T4.5.5.5.2.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.5.5.5.2.m1.1b\"><apply id=\"S4.T4.5.5.5.2.m1.1.2.cmml\" xref=\"S4.T4.5.5.5.2.m1.1.2\"><times id=\"S4.T4.5.5.5.2.m1.1.2.1.cmml\" xref=\"S4.T4.5.5.5.2.m1.1.2.1\"></times><ci id=\"S4.T4.5.5.5.2.m1.1.2.2.cmml\" xref=\"S4.T4.5.5.5.2.m1.1.2.2\">𝒪</ci><apply id=\"S4.T4.5.5.5.2.m1.1.1.cmml\" xref=\"S4.T4.5.5.5.2.m1.1.2.3.2\"><divide id=\"S4.T4.5.5.5.2.m1.1.1.1.cmml\" xref=\"S4.T4.5.5.5.2.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T4.5.5.5.2.m1.1.1.2.cmml\" xref=\"S4.T4.5.5.5.2.m1.1.1.2\">1</cn><ci id=\"S4.T4.5.5.5.2.m1.1.1.3.cmml\" xref=\"S4.T4.5.5.5.2.m1.1.1.3\">𝑅</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.5.5.5.2.m1.1c\">\\mathcal{O}(\\frac{1}{R})</annotation></semantics></math></td>\n<td id=\"S4.T4.6.6.6.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T4.6.6.6.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.6.6.6.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">SC</span></td>\n<td id=\"S4.T4.6.6.6.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.6.6.6.3.m1.1\" class=\"ltx_Math\" alttext=\"\\times\" display=\"inline\"><semantics id=\"S4.T4.6.6.6.3.m1.1a\"><mo mathsize=\"50%\" id=\"S4.T4.6.6.6.3.m1.1.1\" xref=\"S4.T4.6.6.6.3.m1.1.1.cmml\">×</mo><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.6.6.6.3.m1.1b\"><times id=\"S4.T4.6.6.6.3.m1.1.1.cmml\" xref=\"S4.T4.6.6.6.3.m1.1.1\"></times></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.6.6.6.3.m1.1c\">\\times</annotation></semantics></math></td>\n</tr>\n<tr id=\"S4.T4.9.9.9\" class=\"ltx_tr\">\n<td id=\"S4.T4.9.9.9.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">QSGD</span></td>\n<td id=\"S4.T4.9.9.9.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.9.9.9.5.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.9.9.9.5.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.9.9.9.5.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.5.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Calculate</span></td>\n</tr>\n<tr id=\"S4.T4.9.9.9.5.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.9.9.9.5.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.5.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">quantized</span></td>\n</tr>\n<tr id=\"S4.T4.9.9.9.5.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.9.9.9.5.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.5.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">gradient</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.9.9.9.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.6.1\" class=\"ltx_text\" style=\"font-size:50%;\">Single</span></td>\n<td id=\"S4.T4.7.7.7.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.7.7.7.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(d)\" display=\"inline\"><semantics id=\"S4.T4.7.7.7.1.m1.1a\"><mrow id=\"S4.T4.7.7.7.1.m1.1.2\" xref=\"S4.T4.7.7.7.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.7.7.7.1.m1.1.2.2\" xref=\"S4.T4.7.7.7.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.7.7.7.1.m1.1.2.1\" xref=\"S4.T4.7.7.7.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.7.7.7.1.m1.1.2.3.2\" xref=\"S4.T4.7.7.7.1.m1.1.2.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.7.7.7.1.m1.1.2.3.2.1\" xref=\"S4.T4.7.7.7.1.m1.1.2.cmml\">(</mo><mi mathsize=\"50%\" id=\"S4.T4.7.7.7.1.m1.1.1\" xref=\"S4.T4.7.7.7.1.m1.1.1.cmml\">d</mi><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.7.7.7.1.m1.1.2.3.2.2\" xref=\"S4.T4.7.7.7.1.m1.1.2.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.7.7.7.1.m1.1b\"><apply id=\"S4.T4.7.7.7.1.m1.1.2.cmml\" xref=\"S4.T4.7.7.7.1.m1.1.2\"><times id=\"S4.T4.7.7.7.1.m1.1.2.1.cmml\" xref=\"S4.T4.7.7.7.1.m1.1.2.1\"></times><ci id=\"S4.T4.7.7.7.1.m1.1.2.2.cmml\" xref=\"S4.T4.7.7.7.1.m1.1.2.2\">𝒪</ci><ci id=\"S4.T4.7.7.7.1.m1.1.1.cmml\" xref=\"S4.T4.7.7.7.1.m1.1.1\">𝑑</ci></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.7.7.7.1.m1.1c\">\\mathcal{O}(d)</annotation></semantics></math></td>\n<td id=\"S4.T4.9.9.9.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.9.9.9.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.9.9.9.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.9.9.9.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Quantized</span></td>\n</tr>\n<tr id=\"S4.T4.9.9.9.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.9.9.9.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">gradient</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.9.9.9.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.9.9.9.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.9.9.9.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.9.9.9.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global</span></td>\n</tr>\n<tr id=\"S4.T4.9.9.9.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.9.9.9.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">SGD</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.8.8.8.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.8.8.8.2.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(\\frac{1}{R})\" display=\"inline\"><semantics id=\"S4.T4.8.8.8.2.m1.1a\"><mrow id=\"S4.T4.8.8.8.2.m1.1.2\" xref=\"S4.T4.8.8.8.2.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.8.8.8.2.m1.1.2.2\" xref=\"S4.T4.8.8.8.2.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.8.8.8.2.m1.1.2.1\" xref=\"S4.T4.8.8.8.2.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.8.8.8.2.m1.1.2.3.2\" xref=\"S4.T4.8.8.8.2.m1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.8.8.8.2.m1.1.2.3.2.1\" xref=\"S4.T4.8.8.8.2.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T4.8.8.8.2.m1.1.1\" xref=\"S4.T4.8.8.8.2.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T4.8.8.8.2.m1.1.1.2\" xref=\"S4.T4.8.8.8.2.m1.1.1.2.cmml\">1</mn><mi mathsize=\"50%\" id=\"S4.T4.8.8.8.2.m1.1.1.3\" xref=\"S4.T4.8.8.8.2.m1.1.1.3.cmml\">R</mi></mfrac><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.8.8.8.2.m1.1.2.3.2.2\" xref=\"S4.T4.8.8.8.2.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.8.8.8.2.m1.1b\"><apply id=\"S4.T4.8.8.8.2.m1.1.2.cmml\" xref=\"S4.T4.8.8.8.2.m1.1.2\"><times id=\"S4.T4.8.8.8.2.m1.1.2.1.cmml\" xref=\"S4.T4.8.8.8.2.m1.1.2.1\"></times><ci id=\"S4.T4.8.8.8.2.m1.1.2.2.cmml\" xref=\"S4.T4.8.8.8.2.m1.1.2.2\">𝒪</ci><apply id=\"S4.T4.8.8.8.2.m1.1.1.cmml\" xref=\"S4.T4.8.8.8.2.m1.1.2.3.2\"><divide id=\"S4.T4.8.8.8.2.m1.1.1.1.cmml\" xref=\"S4.T4.8.8.8.2.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T4.8.8.8.2.m1.1.1.2.cmml\" xref=\"S4.T4.8.8.8.2.m1.1.1.2\">1</cn><ci id=\"S4.T4.8.8.8.2.m1.1.1.3.cmml\" xref=\"S4.T4.8.8.8.2.m1.1.1.3\">𝑅</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.8.8.8.2.m1.1c\">\\mathcal{O}(\\frac{1}{R})</annotation></semantics></math></td>\n<td id=\"S4.T4.9.9.9.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T4.9.9.9.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.9.9.9.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">SC</span></td>\n<td id=\"S4.T4.9.9.9.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.9.9.9.3.m1.1\" class=\"ltx_Math\" alttext=\"\\times\" display=\"inline\"><semantics id=\"S4.T4.9.9.9.3.m1.1a\"><mo mathsize=\"50%\" id=\"S4.T4.9.9.9.3.m1.1.1\" xref=\"S4.T4.9.9.9.3.m1.1.1.cmml\">×</mo><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.9.9.9.3.m1.1b\"><times id=\"S4.T4.9.9.9.3.m1.1.1.cmml\" xref=\"S4.T4.9.9.9.3.m1.1.1\"></times></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.9.9.9.3.m1.1c\">\\times</annotation></semantics></math></td>\n</tr>\n<tr id=\"S4.T4.13.13.13\" class=\"ltx_tr\">\n<td id=\"S4.T4.13.13.13.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.13.13.13.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">FedAvg</span></td>\n<td id=\"S4.T4.13.13.13.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.13.13.13.6.1\" class=\"ltx_text\" style=\"font-size:50%;\">SGD</span></td>\n<td id=\"S4.T4.13.13.13.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.13.13.13.7.1\" class=\"ltx_text\" style=\"font-size:50%;\">Multiple</span></td>\n<td id=\"S4.T4.10.10.10.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.10.10.10.1.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.10.10.10.1.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.10.10.10.1.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.10.10.10.1.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(T\\cdot d)\" display=\"inline\"><semantics id=\"S4.T4.10.10.10.1.1.1.1.m1.1a\"><mrow id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.3\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.2\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.2\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.cmml\">(</mo><mrow id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.cmml\"><mi mathsize=\"50%\" id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.2\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.2.cmml\">T</mi><mo lspace=\"0.222em\" mathsize=\"50%\" rspace=\"0.222em\" id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.1\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.1.cmml\">⋅</mo><mi mathsize=\"50%\" id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.3\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.3.cmml\">d</mi></mrow><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.3\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.10.10.10.1.1.1.1.m1.1b\"><apply id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1\"><times id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.2\"></times><ci id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1\"><ci id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.1\">⋅</ci><ci id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.2\">𝑇</ci><ci id=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T4.10.10.10.1.1.1.1.m1.1.1.1.1.1.3\">𝑑</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.10.10.10.1.1.1.1.m1.1c\">\\mathcal{O}(T\\cdot d)</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.13.13.13.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.13.13.13.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.13.13.13.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.13.13.13.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.13.13.13.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local model,</span></td>\n</tr>\n<tr id=\"S4.T4.13.13.13.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.13.13.13.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.13.13.13.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global model</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.13.13.13.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.13.13.13.9.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.13.13.13.9.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.13.13.13.9.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.13.13.13.9.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Weight</span></td>\n</tr>\n<tr id=\"S4.T4.13.13.13.9.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.13.13.13.9.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.13.13.13.9.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">averaging</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.11.11.11.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.11.11.11.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.11.11.11.2.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.11.11.11.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.11.11.11.2.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}\\big{(}\\frac{1}{R\\cdot T}\\big{)}\" display=\"inline\"><semantics id=\"S4.T4.11.11.11.2.1.1.1.m1.1a\"><mrow id=\"S4.T4.11.11.11.2.1.1.1.m1.1.2\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.2\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.1\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.3.2\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.cmml\"><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.3.2.1\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.2\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.2.cmml\">1</mn><mrow id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.cmml\"><mi mathsize=\"50%\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.2\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.2.cmml\">R</mi><mo lspace=\"0.222em\" mathsize=\"50%\" rspace=\"0.222em\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.1\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.1.cmml\">⋅</mo><mi mathsize=\"50%\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.3\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.3.cmml\">T</mi></mrow></mfrac><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.3.2.2\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1b\"><apply id=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.2\"><times id=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.1.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.1\"></times><ci id=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.2.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.2\">𝒪</ci><apply id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.3.2\"><divide id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.1.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.2\">1</cn><apply id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3\"><ci id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.1.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.1\">⋅</ci><ci id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.2.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.2\">𝑅</ci><ci id=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.3.cmml\" xref=\"S4.T4.11.11.11.2.1.1.1.m1.1.1.3.3\">𝑇</ci></apply></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.11.11.11.2.1.1.1.m1.1c\">\\mathcal{O}\\big{(}\\frac{1}{R\\cdot T}\\big{)}</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.12.12.12.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.12.12.12.3.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.12.12.12.3.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.12.12.12.3.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.12.12.12.3.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T4.12.12.12.3.1.1.1.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T4.12.12.12.3.1.1.1.m1.1.1\" xref=\"S4.T4.12.12.12.3.1.1.1.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.12.12.12.3.1.1.1.m1.1b\"><ci id=\"S4.T4.12.12.12.3.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.12.12.12.3.1.1.1.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.12.12.12.3.1.1.1.m1.1c\">\\checkmark</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.13.13.13.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.13.13.13.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">AS</span></td>\n<td id=\"S4.T4.13.13.13.4\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.13.13.13.4.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.13.13.13.4.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.13.13.13.4.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.13.13.13.4.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\times\" display=\"inline\"><semantics id=\"S4.T4.13.13.13.4.1.1.1.m1.1a\"><mo mathsize=\"50%\" id=\"S4.T4.13.13.13.4.1.1.1.m1.1.1\" xref=\"S4.T4.13.13.13.4.1.1.1.m1.1.1.cmml\">×</mo><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.13.13.13.4.1.1.1.m1.1b\"><times id=\"S4.T4.13.13.13.4.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.13.13.13.4.1.1.1.m1.1.1\"></times></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.13.13.13.4.1.1.1.m1.1c\">\\times</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S4.T4.17.17.17\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">SCAFFOLD</span></td>\n<td id=\"S4.T4.17.17.17.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.17.17.17.6.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.17.17.17.6.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.6.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.6.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Variance</span></td>\n</tr>\n<tr id=\"S4.T4.17.17.17.6.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.6.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.6.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">reduced</span></td>\n</tr>\n<tr id=\"S4.T4.17.17.17.6.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.6.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.6.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">SGD</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.17.17.17.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.7.1\" class=\"ltx_text\" style=\"font-size:50%;\">Multiple</span></td>\n<td id=\"S4.T4.14.14.14.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.14.14.14.1.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.14.14.14.1.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.14.14.14.1.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.14.14.14.1.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(T\\cdot d)\" display=\"inline\"><semantics id=\"S4.T4.14.14.14.1.1.1.1.m1.1a\"><mrow id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.3\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.2\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.2\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.cmml\">(</mo><mrow id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.cmml\"><mi mathsize=\"50%\" id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.2\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.2.cmml\">T</mi><mo lspace=\"0.222em\" mathsize=\"50%\" rspace=\"0.222em\" id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.1\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.1.cmml\">⋅</mo><mi mathsize=\"50%\" id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.3\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.3.cmml\">d</mi></mrow><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.3\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.14.14.14.1.1.1.1.m1.1b\"><apply id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1\"><times id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.2\"></times><ci id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1\"><ci id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.1\">⋅</ci><ci id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.2\">𝑇</ci><ci id=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T4.14.14.14.1.1.1.1.m1.1.1.1.1.1.3\">𝑑</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.14.14.14.1.1.1.1.m1.1c\">\\mathcal{O}(T\\cdot d)</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.17.17.17.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.17.17.17.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.17.17.17.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local model</span></td>\n</tr>\n<tr id=\"S4.T4.17.17.17.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient,</span></td>\n</tr>\n<tr id=\"S4.T4.17.17.17.8.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.8.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.8.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global model</span></td>\n</tr>\n<tr id=\"S4.T4.17.17.17.8.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.8.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.8.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.17.17.17.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.17.17.17.9.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.17.17.17.9.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.9.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.9.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Weight</span></td>\n</tr>\n<tr id=\"S4.T4.17.17.17.9.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.9.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.9.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">averaging</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.15.15.15.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.15.15.15.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.15.15.15.2.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.15.15.15.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.15.15.15.2.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}\\big{(}\\frac{1}{R\\cdot T}\\big{)}\" display=\"inline\"><semantics id=\"S4.T4.15.15.15.2.1.1.1.m1.1a\"><mrow id=\"S4.T4.15.15.15.2.1.1.1.m1.1.2\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.2\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.1\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.3.2\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.cmml\"><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.3.2.1\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.2\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.2.cmml\">1</mn><mrow id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.cmml\"><mi mathsize=\"50%\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.2\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.2.cmml\">R</mi><mo lspace=\"0.222em\" mathsize=\"50%\" rspace=\"0.222em\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.1\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.1.cmml\">⋅</mo><mi mathsize=\"50%\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.3\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.3.cmml\">T</mi></mrow></mfrac><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.3.2.2\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1b\"><apply id=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.2\"><times id=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.1.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.1\"></times><ci id=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.2.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.2\">𝒪</ci><apply id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.3.2\"><divide id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.1.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.2\">1</cn><apply id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3\"><ci id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.1.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.1\">⋅</ci><ci id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.2.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.2\">𝑅</ci><ci id=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.3.cmml\" xref=\"S4.T4.15.15.15.2.1.1.1.m1.1.1.3.3\">𝑇</ci></apply></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.15.15.15.2.1.1.1.m1.1c\">\\mathcal{O}\\big{(}\\frac{1}{R\\cdot T}\\big{)}</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.16.16.16.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.16.16.16.3.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.16.16.16.3.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.16.16.16.3.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.16.16.16.3.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T4.16.16.16.3.1.1.1.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T4.16.16.16.3.1.1.1.m1.1.1\" xref=\"S4.T4.16.16.16.3.1.1.1.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.16.16.16.3.1.1.1.m1.1b\"><ci id=\"S4.T4.16.16.16.3.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.16.16.16.3.1.1.1.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.16.16.16.3.1.1.1.m1.1c\">\\checkmark</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.17.17.17.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.17.17.17.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">AS</span></td>\n<td id=\"S4.T4.17.17.17.4\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.17.17.17.4.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.17.17.17.4.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.17.17.17.4.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.17.17.17.4.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T4.17.17.17.4.1.1.1.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T4.17.17.17.4.1.1.1.m1.1.1\" xref=\"S4.T4.17.17.17.4.1.1.1.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.17.17.17.4.1.1.1.m1.1b\"><ci id=\"S4.T4.17.17.17.4.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.17.17.17.4.1.1.1.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.17.17.17.4.1.1.1.m1.1c\">\\checkmark</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n</tr>\n<tr id=\"S4.T4.20.20.20\" class=\"ltx_tr\">\n<td id=\"S4.T4.20.20.20.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.20.20.20.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">FedProx</span></td>\n<td id=\"S4.T4.20.20.20.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.20.20.20.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">PGD</span></td>\n<td id=\"S4.T4.20.20.20.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.20.20.20.6.1\" class=\"ltx_text\" style=\"font-size:50%;\">Single</span></td>\n<td id=\"S4.T4.18.18.18.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.18.18.18.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(d)\" display=\"inline\"><semantics id=\"S4.T4.18.18.18.1.m1.1a\"><mrow id=\"S4.T4.18.18.18.1.m1.1.2\" xref=\"S4.T4.18.18.18.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.18.18.18.1.m1.1.2.2\" xref=\"S4.T4.18.18.18.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.18.18.18.1.m1.1.2.1\" xref=\"S4.T4.18.18.18.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.18.18.18.1.m1.1.2.3.2\" xref=\"S4.T4.18.18.18.1.m1.1.2.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.18.18.18.1.m1.1.2.3.2.1\" xref=\"S4.T4.18.18.18.1.m1.1.2.cmml\">(</mo><mi mathsize=\"50%\" id=\"S4.T4.18.18.18.1.m1.1.1\" xref=\"S4.T4.18.18.18.1.m1.1.1.cmml\">d</mi><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.18.18.18.1.m1.1.2.3.2.2\" xref=\"S4.T4.18.18.18.1.m1.1.2.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.18.18.18.1.m1.1b\"><apply id=\"S4.T4.18.18.18.1.m1.1.2.cmml\" xref=\"S4.T4.18.18.18.1.m1.1.2\"><times id=\"S4.T4.18.18.18.1.m1.1.2.1.cmml\" xref=\"S4.T4.18.18.18.1.m1.1.2.1\"></times><ci id=\"S4.T4.18.18.18.1.m1.1.2.2.cmml\" xref=\"S4.T4.18.18.18.1.m1.1.2.2\">𝒪</ci><ci id=\"S4.T4.18.18.18.1.m1.1.1.cmml\" xref=\"S4.T4.18.18.18.1.m1.1.1\">𝑑</ci></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.18.18.18.1.m1.1c\">\\mathcal{O}(d)</annotation></semantics></math></td>\n<td id=\"S4.T4.20.20.20.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.20.20.20.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.20.20.20.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.20.20.20.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.20.20.20.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local model,</span></td>\n</tr>\n<tr id=\"S4.T4.20.20.20.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.20.20.20.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.20.20.20.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global model</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.20.20.20.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.20.20.20.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.20.20.20.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.20.20.20.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.20.20.20.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Weight</span></td>\n</tr>\n<tr id=\"S4.T4.20.20.20.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.20.20.20.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.20.20.20.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">averaging</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.19.19.19.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.19.19.19.2.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}\\big{(}\\frac{1}{R}\\big{)}\" display=\"inline\"><semantics id=\"S4.T4.19.19.19.2.m1.1a\"><mrow id=\"S4.T4.19.19.19.2.m1.1.2\" xref=\"S4.T4.19.19.19.2.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.19.19.19.2.m1.1.2.2\" xref=\"S4.T4.19.19.19.2.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.19.19.19.2.m1.1.2.1\" xref=\"S4.T4.19.19.19.2.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.19.19.19.2.m1.1.2.3.2\" xref=\"S4.T4.19.19.19.2.m1.1.1.cmml\"><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.19.19.19.2.m1.1.2.3.2.1\" xref=\"S4.T4.19.19.19.2.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T4.19.19.19.2.m1.1.1\" xref=\"S4.T4.19.19.19.2.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T4.19.19.19.2.m1.1.1.2\" xref=\"S4.T4.19.19.19.2.m1.1.1.2.cmml\">1</mn><mi mathsize=\"50%\" id=\"S4.T4.19.19.19.2.m1.1.1.3\" xref=\"S4.T4.19.19.19.2.m1.1.1.3.cmml\">R</mi></mfrac><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.19.19.19.2.m1.1.2.3.2.2\" xref=\"S4.T4.19.19.19.2.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.19.19.19.2.m1.1b\"><apply id=\"S4.T4.19.19.19.2.m1.1.2.cmml\" xref=\"S4.T4.19.19.19.2.m1.1.2\"><times id=\"S4.T4.19.19.19.2.m1.1.2.1.cmml\" xref=\"S4.T4.19.19.19.2.m1.1.2.1\"></times><ci id=\"S4.T4.19.19.19.2.m1.1.2.2.cmml\" xref=\"S4.T4.19.19.19.2.m1.1.2.2\">𝒪</ci><apply id=\"S4.T4.19.19.19.2.m1.1.1.cmml\" xref=\"S4.T4.19.19.19.2.m1.1.2.3.2\"><divide id=\"S4.T4.19.19.19.2.m1.1.1.1.cmml\" xref=\"S4.T4.19.19.19.2.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T4.19.19.19.2.m1.1.1.2.cmml\" xref=\"S4.T4.19.19.19.2.m1.1.1.2\">1</cn><ci id=\"S4.T4.19.19.19.2.m1.1.1.3.cmml\" xref=\"S4.T4.19.19.19.2.m1.1.1.3\">𝑅</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.19.19.19.2.m1.1c\">\\mathcal{O}\\big{(}\\frac{1}{R}\\big{)}</annotation></semantics></math></td>\n<td id=\"S4.T4.20.20.20.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.20.20.20.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">limited</span></td>\n<td id=\"S4.T4.20.20.20.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.20.20.20.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">AS</span></td>\n<td id=\"S4.T4.20.20.20.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.20.20.20.3.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T4.20.20.20.3.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T4.20.20.20.3.m1.1.1\" xref=\"S4.T4.20.20.20.3.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.20.20.20.3.m1.1b\"><ci id=\"S4.T4.20.20.20.3.m1.1.1.cmml\" xref=\"S4.T4.20.20.20.3.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.20.20.20.3.m1.1c\">\\checkmark</annotation></semantics></math></td>\n</tr>\n<tr id=\"S4.T4.23.23.23\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">DIANA</span></td>\n<td id=\"S4.T4.23.23.23.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.23.23.23.5.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.23.23.23.5.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.5.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.5.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Calculate</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.5.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.5.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.5.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">quantized</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.5.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.5.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.5.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">gradient</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.5.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.5.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.5.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">difference</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.23.23.23.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.6.1\" class=\"ltx_text\" style=\"font-size:50%;\">Single</span></td>\n<td id=\"S4.T4.21.21.21.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.21.21.21.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(d)\" display=\"inline\"><semantics id=\"S4.T4.21.21.21.1.m1.1a\"><mrow id=\"S4.T4.21.21.21.1.m1.1.2\" xref=\"S4.T4.21.21.21.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.21.21.21.1.m1.1.2.2\" xref=\"S4.T4.21.21.21.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.21.21.21.1.m1.1.2.1\" xref=\"S4.T4.21.21.21.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.21.21.21.1.m1.1.2.3.2\" xref=\"S4.T4.21.21.21.1.m1.1.2.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.21.21.21.1.m1.1.2.3.2.1\" xref=\"S4.T4.21.21.21.1.m1.1.2.cmml\">(</mo><mi mathsize=\"50%\" id=\"S4.T4.21.21.21.1.m1.1.1\" xref=\"S4.T4.21.21.21.1.m1.1.1.cmml\">d</mi><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.21.21.21.1.m1.1.2.3.2.2\" xref=\"S4.T4.21.21.21.1.m1.1.2.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.21.21.21.1.m1.1b\"><apply id=\"S4.T4.21.21.21.1.m1.1.2.cmml\" xref=\"S4.T4.21.21.21.1.m1.1.2\"><times id=\"S4.T4.21.21.21.1.m1.1.2.1.cmml\" xref=\"S4.T4.21.21.21.1.m1.1.2.1\"></times><ci id=\"S4.T4.21.21.21.1.m1.1.2.2.cmml\" xref=\"S4.T4.21.21.21.1.m1.1.2.2\">𝒪</ci><ci id=\"S4.T4.21.21.21.1.m1.1.1.cmml\" xref=\"S4.T4.21.21.21.1.m1.1.1\">𝑑</ci></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.21.21.21.1.m1.1c\">\\mathcal{O}(d)</annotation></semantics></math></td>\n<td id=\"S4.T4.23.23.23.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.23.23.23.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.23.23.23.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Quantized</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">gradient</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.7.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.7.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.7.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">difference,</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.7.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.7.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.7.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global model</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.7.1.5\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.7.1.5.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.7.1.5.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.7.1.6\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.7.1.6.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.7.1.6.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">shift</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.23.23.23.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.23.23.23.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.23.23.23.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">PGD and</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.8.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.8.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.8.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">gradient</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.8.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.8.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.8.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">shift</span></td>\n</tr>\n<tr id=\"S4.T4.23.23.23.8.1.5\" class=\"ltx_tr\">\n<td id=\"S4.T4.23.23.23.8.1.5.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.8.1.5.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">aggregation</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.22.22.22.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.22.22.22.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.22.22.22.2.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.22.22.22.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<math id=\"S4.T4.22.22.22.2.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}{(\\frac{1}{R})}\" display=\"inline\"><semantics id=\"S4.T4.22.22.22.2.1.1.1.m1.1a\"><mrow id=\"S4.T4.22.22.22.2.1.1.1.m1.1.2\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.2\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.1\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.3.2\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.3.2.1\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T4.22.22.22.2.1.1.1.m1.1.1\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.2\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.2.cmml\">1</mn><mi mathsize=\"50%\" id=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.3\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.3.cmml\">R</mi></mfrac><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.3.2.2\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.22.22.22.2.1.1.1.m1.1b\"><apply id=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.cmml\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.2\"><times id=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.1.cmml\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.1\"></times><ci id=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.2.cmml\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.2\">𝒪</ci><apply id=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.3.2\"><divide id=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.1.cmml\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.2\">1</cn><ci id=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T4.22.22.22.2.1.1.1.m1.1.1.3\">𝑅</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.22.22.22.2.1.1.1.m1.1c\">\\mathcal{O}{(\\frac{1}{R})}</annotation></semantics></math><span id=\"S4.T4.22.22.22.2.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\"> and</span>\n</td>\n</tr>\n<tr id=\"S4.T4.22.22.22.2.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.22.22.22.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.22.22.22.2.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">linear</span></td>\n</tr>\n<tr id=\"S4.T4.22.22.22.2.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.22.22.22.2.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.22.22.22.2.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">convergence</span></td>\n</tr>\n<tr id=\"S4.T4.22.22.22.2.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T4.22.22.22.2.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.22.22.22.2.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">rate</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.23.23.23.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T4.23.23.23.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.23.23.23.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">SC</span></td>\n<td id=\"S4.T4.23.23.23.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.23.23.23.3.m1.1\" class=\"ltx_Math\" alttext=\"\\times\" display=\"inline\"><semantics id=\"S4.T4.23.23.23.3.m1.1a\"><mo mathsize=\"50%\" id=\"S4.T4.23.23.23.3.m1.1.1\" xref=\"S4.T4.23.23.23.3.m1.1.1.cmml\">×</mo><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.23.23.23.3.m1.1b\"><times id=\"S4.T4.23.23.23.3.m1.1.1.cmml\" xref=\"S4.T4.23.23.23.3.m1.1.1\"></times></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.23.23.23.3.m1.1c\">\\times</annotation></semantics></math></td>\n</tr>\n<tr id=\"S4.T4.27.27.27\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.5\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">MimeSVRG</span></td>\n<td id=\"S4.T4.27.27.27.6\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.27.6.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.27.6.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.6.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.6.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Variance</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.27.6.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.6.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.6.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">reduced</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.27.6.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.6.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.6.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">SGD</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.27.27.27.7\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.7.1\" class=\"ltx_text\" style=\"font-size:50%;\">Multiple</span></td>\n<td id=\"S4.T4.24.24.24.1\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.24.24.24.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(2Td)\" display=\"inline\"><semantics id=\"S4.T4.24.24.24.1.m1.1a\"><mrow id=\"S4.T4.24.24.24.1.m1.1.1\" xref=\"S4.T4.24.24.24.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.24.24.24.1.m1.1.1.3\" xref=\"S4.T4.24.24.24.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.24.24.24.1.m1.1.1.2\" xref=\"S4.T4.24.24.24.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T4.24.24.24.1.m1.1.1.1.1\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.24.24.24.1.m1.1.1.1.1.2\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.cmml\">(</mo><mrow id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.2\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.2.cmml\">2</mn><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.1\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.1.cmml\">​</mo><mi mathsize=\"50%\" id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.3\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.3.cmml\">T</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.1a\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.1.cmml\">​</mo><mi mathsize=\"50%\" id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.4\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.4.cmml\">d</mi></mrow><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T4.24.24.24.1.m1.1.1.1.1.3\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.24.24.24.1.m1.1b\"><apply id=\"S4.T4.24.24.24.1.m1.1.1.cmml\" xref=\"S4.T4.24.24.24.1.m1.1.1\"><times id=\"S4.T4.24.24.24.1.m1.1.1.2.cmml\" xref=\"S4.T4.24.24.24.1.m1.1.1.2\"></times><ci id=\"S4.T4.24.24.24.1.m1.1.1.3.cmml\" xref=\"S4.T4.24.24.24.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1\"><times id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.1\"></times><cn type=\"integer\" id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.2\">2</cn><ci id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.3\">𝑇</ci><ci id=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.4.cmml\" xref=\"S4.T4.24.24.24.1.m1.1.1.1.1.1.4\">𝑑</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.24.24.24.1.m1.1c\">\\mathcal{O}(2Td)</annotation></semantics></math></td>\n<td id=\"S4.T4.27.27.27.8\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.27.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.27.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local model</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.27.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient,</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.27.8.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.8.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.8.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global model</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.27.8.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.8.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.8.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and aggregated</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.27.8.1.5\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.8.1.5.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.8.1.5.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">gradient</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.27.27.27.9\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.27.27.27.9.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.27.27.27.9.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.9.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.9.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Weight</span></td>\n</tr>\n<tr id=\"S4.T4.27.27.27.9.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T4.27.27.27.9.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.9.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">averaging</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.25.25.25.2\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T4.25.25.25.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T4.25.25.25.2.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T4.25.25.25.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.25.25.25.2.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}\\big{(}\\frac{1}{R\\cdot T}\\big{)}\" display=\"inline\"><semantics id=\"S4.T4.25.25.25.2.1.1.1.m1.1a\"><mrow id=\"S4.T4.25.25.25.2.1.1.1.m1.1.2\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.2\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.1\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.3.2\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.cmml\"><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.3.2.1\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.2\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.2.cmml\">1</mn><mrow id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.cmml\"><mi mathsize=\"50%\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.2\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.2.cmml\">R</mi><mo lspace=\"0.222em\" mathsize=\"50%\" rspace=\"0.222em\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.1\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.1.cmml\">⋅</mo><mi mathsize=\"50%\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.3\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.3.cmml\">T</mi></mrow></mfrac><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.3.2.2\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1b\"><apply id=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.2\"><times id=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.1.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.1\"></times><ci id=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.2.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.2\">𝒪</ci><apply id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.3.2\"><divide id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.1.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.2\">1</cn><apply id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3\"><ci id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.1.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.1\">⋅</ci><ci id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.2.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.2\">𝑅</ci><ci id=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.3.cmml\" xref=\"S4.T4.25.25.25.2.1.1.1.m1.1.1.3.3\">𝑇</ci></apply></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.25.25.25.2.1.1.1.m1.1c\">\\mathcal{O}\\big{(}\\frac{1}{R\\cdot T}\\big{)}</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T4.26.26.26.3\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.26.26.26.3.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T4.26.26.26.3.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T4.26.26.26.3.m1.1.1\" xref=\"S4.T4.26.26.26.3.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.26.26.26.3.m1.1b\"><ci id=\"S4.T4.26.26.26.3.m1.1.1.cmml\" xref=\"S4.T4.26.26.26.3.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.26.26.26.3.m1.1c\">\\checkmark</annotation></semantics></math></td>\n<td id=\"S4.T4.27.27.27.10\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T4.27.27.27.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">AS</span></td>\n<td id=\"S4.T4.27.27.27.4\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T4.27.27.27.4.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T4.27.27.27.4.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T4.27.27.27.4.m1.1.1\" xref=\"S4.T4.27.27.27.4.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T4.27.27.27.4.m1.1b\"><ci id=\"S4.T4.27.27.27.4.m1.1.1.cmml\" xref=\"S4.T4.27.27.27.4.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T4.27.27.27.4.m1.1c\">\\checkmark</annotation></semantics></math></td>\n</tr>\n</table>\n\n",
        "footnotes": "",
        "references": [
            [
                "In this scenario, the first-order information is adopted for local search direction. Specifically, momentum and variance reduction techniques can be used for acceleration. According to the acceleration position, we divide them into local and global acceleration schemes respectively. We also provide the instantiation of these two scenarios in the supplementary material.",
                "Local acceleration.    ",
                " While the acceleration techniques such as the momentum and variance reduction have been widely utilized to accelerate SGD, e.g., Adam, AdaGrad and SVRG etc., they are also employed in the distributed SGD to speed up the convergence. Specifically, mimicking the adaptation of SGD to FedAvg, the momentum gradient descent method which is a variant of SGD has been extended to the local update step, then the global performs aggregating all the local models and the momentum terms, where the resultant algorithm is called MFL ",
                "(Liu\net al",
                ".",
                ", ",
                "2020a",
                ")",
                ". Similarly, FedAdam ",
                "(Reddi et al",
                ".",
                ", ",
                "2021",
                ")",
                " extend Adam ",
                "(Kingma and Ba, ",
                "2015",
                ")",
                " to FedOpt. However, these methods still suffer from the model divergence problem ",
                "(Wang et al",
                ".",
                ", ",
                "2019",
                "; Zhao\net al",
                ".",
                ", ",
                "2018",
                "; Li\net al",
                ".",
                ", ",
                "2020c",
                "; Yu\net al",
                ".",
                ", ",
                "2019",
                ")",
                ". This can be due to the reason of the multiple local update steps in FedOpt which will make the local model fast approach to the local optimum of the local loss function instead of the global one ",
                "(Karimireddy et al",
                ".",
                ", ",
                "2020b",
                ")",
                ". Moreover, since only a small portion of the clients participate in the update on each communication round, the aggregated model will be further biased from the optimal global one. Intuitively, it can be attributed to the global aggregation with only the partial information from the participated clients. These algorithms share the common patterns - local acceleration strategy, which can be merged together in the Algorithm ",
                "4",
                ".",
                "Global acceleration.    ",
                " For improving the performance, the control variate for variance reduction strategy has been adopted, i.e., VRL-SGD, which has shown faster speed even with non-IID data ",
                "(Liang\net al",
                ".",
                ", ",
                "2019",
                ")",
                ". However, VRL-SGD does not support the client sampling which is more practical in FL. Furthermore, with the control variate to include as more information from clients as possible, SCAFFOLD has shown the significant performance improvement for the data heterogeneity problem in FedOpt ",
                "(Karimireddy et al",
                ".",
                ", ",
                "2020b",
                ")",
                ". Its core notion is to estimate the full gradient for the local search direction.\nMost recently, a framework called Mime is proposed ",
                "(Karimireddy et al",
                ".",
                ", ",
                "2020a",
                ")",
                ", which adapts popular centralized algorithms (e.g., SGD, Adam etc.) to FedOpt.",
                "We summarize these algorithms into the general global acceleration strategy in Algorithm ",
                "5",
                " to provide the motivation for the development of novel algorithms. It can be seen these algorithms are different with the local acceleration scheme in that the acceleration adopts the global information. We further illustrate the global acceleration scheme in Fig. ",
                "6",
                ".",
                "Quantization    ",
                " Despite the numerous advantages of distributed computing via FedOpt, significant limitations exist in the communication process, since massive workers transmit the gradients or the models for aggregation in the server, resulting in communication overhead. Quantization technique is a straightforward idea for compressing the communication quantities. In ",
                "(Reisizadeh et al",
                ".",
                ", ",
                "2020",
                ")",
                ",\na quantized version of FedAvg, known as FedPaq, is proposed for reducing the message overload. Another strategy, called QSGD ",
                "(Alistarh et al",
                ".",
                ", ",
                "2017",
                ")",
                ", quantizes the gradient in each local worker with a specified random quantization operator and it costs only ",
                "(",
                "2",
                "+",
                "log",
                "⁡",
                "(",
                "2",
                "​",
                "N",
                "+",
                "1",
                ")",
                ")",
                "​",
                "N",
                "​",
                "d",
                "2",
                "2",
                "𝑁",
                "1",
                "𝑁",
                "𝑑",
                "(2+\\log(2N+1))Nd",
                " in each round communication. Jeremy et al. ",
                "(Bernstein et al",
                ".",
                ", ",
                "[n. d.]",
                ")",
                " proposes SIGNSGD and finds only transmitting the sign of the gradient on each worker can still get the\nSGD-level convergence rate, while it only costs ",
                "2",
                "​",
                "N",
                "​",
                "d",
                "2",
                "𝑁",
                "𝑑",
                "2Nd",
                " bits in each round communication. As for the acceleration strategy for QSGD and SIGNSGD, SVRG is applied in QSGD, and the momentum method is adopted to SIGNSGD, the resultant algorithms are QSVRG and SIGNUM respectively. However, as for the QSGD, its convergence is based\non unrealistic assumptions and can diverge in practice. To remedy this issue,\nNesterov’s momentum has been incorporated to the general distributed SGD with two-way compressions on both the workers and server ",
                "(Zheng\net al",
                ".",
                ", ",
                "2019",
                ")",
                ", which has demonstrated numerically reducing the communication by about ",
                "32",
                "×",
                "32\\times",
                " and can converge as quickly as full-precision distributed momentum SGD to reach the same testing accuracy.",
                "Sparsification    ",
                " While the quantization is effective in reducing the communication overhead, the sparsification technique is another choice for the communication compression, where only the most important and information-preserving gradient entries are sent when using gradient sparsification technique.",
                "Specifically, Dan et al. ",
                "(Alistarh et al",
                ".",
                ", ",
                "2018",
                ")",
                " and Stich et al. ",
                "(Stich\net al",
                ".",
                ", ",
                "2018",
                ")",
                " study sparsifying gradients by magnitude with local error correction and selecting top ",
                "K",
                "𝐾",
                "K",
                " components. Another algorithm only transmits the large\nentries to the server ",
                "(Frank\net al",
                ".",
                ", ",
                "2014",
                ")",
                ", which shows the significant reduction in the communication overhead ",
                "(Aji and Heafield, ",
                "2017",
                ")",
                ". While the sparsification can bring performance degradation, deep gradient compression ",
                "(Lin\net al",
                ".",
                ", ",
                "2017",
                ")",
                " combines it with other techniques including momentum correction, local gradient clipping, and momentum factor masking to achieve higher performance with considerable communication cost reduction. In fact, these strategies can deliver good results, but they have a few limitations. First, they currently have no guarantees of convergence; second, although the workers can perform the compression to high rate, when the server implements aggregation of the disjoint top ",
                "K",
                "𝐾",
                "K",
                ", it will again become dense. To alleviate the problem, Sketched-SGD has been proposed by introducing the sketching technique in distributed SGD, which is motivated by the success of sketching methods in sub-linear/streaming algorithms ",
                "(Ivkin et al",
                ".",
                ", ",
                "2019",
                ")",
                ". The main idea of Sketched-SGD is communicating sketches with top ",
                "K",
                "𝐾",
                "K",
                " sparsification on both the server and workers. For the communication overhead reduction, Sketched-SGD only communicates ",
                "O",
                "​",
                "(",
                "l",
                "​",
                "o",
                "​",
                "g",
                "​",
                "d",
                ")",
                "𝑂",
                "𝑙",
                "𝑜",
                "𝑔",
                "𝑑",
                "O(logd)",
                " information, while the general gradient compression methods transmits ",
                "O",
                "​",
                "(",
                "d",
                ")",
                "𝑂",
                "𝑑",
                "O(d)",
                ".",
                "Although sparsifying the transmitted gradients can improve the communication efficiency, it also increases the gradient variance, which may slow down the convergence speed. To mitigate the problem, Wangni et al. ",
                "(Wangni\net al",
                ".",
                ", ",
                "2018",
                ")",
                " proposes a gradient sparsification technique to find the optimal tradeoff between sparsity and the gradient variance. Specifically, the key idea is to randomly drop out each coordinate ",
                "g",
                "i",
                "j",
                "subscript",
                "superscript",
                "𝑔",
                "𝑗",
                "𝑖",
                "g^{j}_{i}",
                " of the stochastic gradient vector ",
                "g",
                "i",
                "subscript",
                "𝑔",
                "𝑖",
                "g_{i}",
                " by probability ",
                "1",
                "−",
                "p",
                "j",
                "1",
                "subscript",
                "𝑝",
                "𝑗",
                "1-p_{j}",
                " on the ",
                "i",
                "𝑖",
                "i",
                "th worker, and appropriately amplify the remaining coordinates to ensure that the sparsified gradient is unbiased. Then the variance of the quantized gradient ",
                "Q",
                "​",
                "(",
                "g",
                "i",
                ")",
                "𝑄",
                "subscript",
                "𝑔",
                "𝑖",
                "Q(g_{i})",
                " can be bounded by ",
                "𝔼",
                "​",
                "∑",
                "j",
                "=",
                "1",
                "d",
                "[",
                "Q",
                "​",
                "(",
                "g",
                "i",
                "j",
                ")",
                "2",
                "]",
                "=",
                "∑",
                "j",
                "=",
                "1",
                "d",
                "(",
                "g",
                "i",
                "j",
                ")",
                "2",
                "/",
                "p",
                "j",
                ".",
                "𝔼",
                "superscript",
                "subscript",
                "𝑗",
                "1",
                "𝑑",
                "delimited-[]",
                "𝑄",
                "superscript",
                "subscript",
                "superscript",
                "𝑔",
                "𝑗",
                "𝑖",
                "2",
                "superscript",
                "subscript",
                "𝑗",
                "1",
                "𝑑",
                "superscript",
                "subscript",
                "superscript",
                "𝑔",
                "𝑗",
                "𝑖",
                "2",
                "subscript",
                "𝑝",
                "𝑗",
                "\\mathbb{E}\\sum_{j=1}^{d}[Q(g^{j}_{i})^{2}]=\\sum_{j=1}^{d}\\nicefrac{{(g^{j}_{i})^{2}}}{{p_{j}}}.",
                "\nIn addition, the expected sparsity ",
                "𝔼",
                "​",
                "∥",
                "Q",
                "​",
                "(",
                "g",
                "i",
                ")",
                "∥",
                "0",
                "𝔼",
                "subscript",
                "delimited-∥∥",
                "𝑄",
                "subscript",
                "𝑔",
                "𝑖",
                "0",
                "\\mathbb{E}\\left\\lVert Q(g_{i})\\right\\rVert_{0}",
                " can be computed by ",
                "𝔼",
                "​",
                "∥",
                "Q",
                "​",
                "(",
                "g",
                "i",
                ")",
                "∥",
                "0",
                "=",
                "∑",
                "j",
                "=",
                "1",
                "d",
                "p",
                "j",
                "𝔼",
                "subscript",
                "delimited-∥∥",
                "𝑄",
                "subscript",
                "𝑔",
                "𝑖",
                "0",
                "superscript",
                "subscript",
                "𝑗",
                "1",
                "𝑑",
                "subscript",
                "𝑝",
                "𝑗",
                "\\mathbb{E}\\left\\lVert Q(g_{i})\\right\\rVert_{0}=\\sum_{j=1}^{d}p_{j}",
                ". Subsequently, the target is to obtain the gradient as sparsified as possible with the variance as small as possible, which can be formulated as the following problem: ",
                "min",
                "𝑝",
                "​",
                "∑",
                "j",
                "=",
                "1",
                "d",
                "p",
                "j",
                ",",
                " s.t. ",
                "​",
                "∑",
                "j",
                "=",
                "1",
                "d",
                "(",
                "g",
                "i",
                "j",
                ")",
                "2",
                "/",
                "p",
                "j",
                "≤",
                "ϵ",
                ".",
                "𝑝",
                "min",
                "superscript",
                "subscript",
                "𝑗",
                "1",
                "𝑑",
                "subscript",
                "𝑝",
                "𝑗",
                " s.t. ",
                "superscript",
                "subscript",
                "𝑗",
                "1",
                "𝑑",
                "superscript",
                "subscript",
                "superscript",
                "𝑔",
                "𝑗",
                "𝑖",
                "2",
                "subscript",
                "𝑝",
                "𝑗",
                "italic-ϵ",
                "\\underset{p}{\\text{min}}\\sum_{j=1}^{d}p_{j},\\text{ s.t. }\\sum_{j=1}^{d}\\nicefrac{{(g^{j}_{i})^{2}}}{{p_{j}}}\\leq\\epsilon.",
                "It should be emphasized that none of the above compression (i.e., quantization and sparsification) based methods can learn the gradients, preventing them from converging to the true optimum in batch mode, making them incompatible with non-smooth regularizers, and slowing their convergence. To mitigate the problem, DIANA is proposed by compressing the gradient difference and performing the proximal minimization for dealing with the non-smooth regularizers in the local ",
                "(Mishchenko et al",
                ".",
                ", ",
                "2019",
                ")",
                ". Another strategy ADIANA combines the acceleration/momentum and compression strategies ",
                "(Li\net al",
                ".",
                ", ",
                "2020d",
                ")",
                "."
            ]
        ]
    },
    "S4.T5": {
        "caption": "Table 5. Representative federated optimization methods based on second-order gradient.",
        "table": "<table id=\"S4.T5.7.7\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S4.T5.7.7.8\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Algorithm</span></td>\n<td id=\"S4.T5.7.7.8.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.8.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.8.2.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.2.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Local</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.8.2.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.2.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.8.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.8.3.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.8.3.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.3.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.3.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Local</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.8.3.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.3.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.3.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">steps</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.8.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.8.4.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.8.4.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.4.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.4.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Local</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.8.4.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.4.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.4.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">complexity</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.8.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.8.5.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.8.5.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.5.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.5.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Transmission</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.8.5.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.5.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.5.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">quantity</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.8.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.8.6.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.8.6.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.6.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.6.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Global</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.8.6.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.6.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.6.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.8.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.8.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.8.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.7.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Convergence</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.8.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.7.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">speed</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.8.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.8.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.8.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.8.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Dealing</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.8.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.8.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.8.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">with M.D.</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.8.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.9.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">SC/AS</span></td>\n<td id=\"S4.T5.7.7.8.10\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.8.10.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">PCP</span></td>\n</tr>\n<tr id=\"S4.T5.2.2.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">FedNL</span></td>\n<td id=\"S4.T5.2.2.2.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.2.2.2.4.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.2.2.2.4.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.4.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.4.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Calculate</span></td>\n</tr>\n<tr id=\"S4.T5.2.2.2.4.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.4.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.4.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">compressed</span></td>\n</tr>\n<tr id=\"S4.T5.2.2.2.4.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.4.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.4.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Hessian</span></td>\n</tr>\n<tr id=\"S4.T5.2.2.2.4.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.4.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.4.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.2.2.2.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Single</span></td>\n<td id=\"S4.T5.1.1.1.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T5.1.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(d^{2})\" display=\"inline\"><semantics id=\"S4.T5.1.1.1.1.m1.1a\"><mrow id=\"S4.T5.1.1.1.1.m1.1.1\" xref=\"S4.T5.1.1.1.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T5.1.1.1.1.m1.1.1.3\" xref=\"S4.T5.1.1.1.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T5.1.1.1.1.m1.1.1.2\" xref=\"S4.T5.1.1.1.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T5.1.1.1.1.m1.1.1.1.1\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T5.1.1.1.1.m1.1.1.1.1.2\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.cmml\">(</mo><msup id=\"S4.T5.1.1.1.1.m1.1.1.1.1.1\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.cmml\"><mi mathsize=\"50%\" id=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.2\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.2.cmml\">d</mi><mn mathsize=\"50%\" id=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.3\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.3.cmml\">2</mn></msup><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T5.1.1.1.1.m1.1.1.1.1.3\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T5.1.1.1.1.m1.1b\"><apply id=\"S4.T5.1.1.1.1.m1.1.1.cmml\" xref=\"S4.T5.1.1.1.1.m1.1.1\"><times id=\"S4.T5.1.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T5.1.1.1.1.m1.1.1.2\"></times><ci id=\"S4.T5.1.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T5.1.1.1.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1\"><csymbol cd=\"ambiguous\" id=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1\">superscript</csymbol><ci id=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.2\">𝑑</ci><cn type=\"integer\" id=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T5.1.1.1.1.m1.1.1.1.1.1.3\">2</cn></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T5.1.1.1.1.m1.1c\">\\mathcal{O}(d^{2})</annotation></semantics></math></td>\n<td id=\"S4.T5.2.2.2.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.2.2.2.6.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.2.2.2.6.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.6.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.6.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Compressed</span></td>\n</tr>\n<tr id=\"S4.T5.2.2.2.6.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.6.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.6.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Hessian and</span></td>\n</tr>\n<tr id=\"S4.T5.2.2.2.6.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.6.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.6.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">the gradient</span></td>\n</tr>\n</table>\n<span id=\"S4.T5.2.2.2.6.2\" class=\"ltx_text\" style=\"font-size:50%;\">.</span>\n</td>\n<td id=\"S4.T5.2.2.2.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.2.2.2.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.2.2.2.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global model</span></td>\n</tr>\n<tr id=\"S4.T5.2.2.2.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and Hessian</span></td>\n</tr>\n<tr id=\"S4.T5.2.2.2.7.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.7.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.7.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.2.2.2.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.2.2.2.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.2.2.2.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">sub-linear</span></td>\n</tr>\n<tr id=\"S4.T5.2.2.2.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.2.2.2.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">convergence.</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.2.2.2.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T5.2.2.2.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.2.2.2.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">AS</span></td>\n<td id=\"S4.T5.2.2.2.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T5.2.2.2.2.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T5.2.2.2.2.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T5.2.2.2.2.m1.1.1\" xref=\"S4.T5.2.2.2.2.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T5.2.2.2.2.m1.1b\"><ci id=\"S4.T5.2.2.2.2.m1.1.1.cmml\" xref=\"S4.T5.2.2.2.2.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T5.2.2.2.2.m1.1c\">\\checkmark</annotation></semantics></math></td>\n</tr>\n<tr id=\"S4.T5.5.5.5\" class=\"ltx_tr\">\n<td id=\"S4.T5.5.5.5.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">FedSSO</span></td>\n<td id=\"S4.T5.5.5.5.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.5.5.5.5.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.5.5.5.5.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.5.5.5.5.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.5.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">SGD</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.5.5.5.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.6.1\" class=\"ltx_text\" style=\"font-size:50%;\">multiple</span></td>\n<td id=\"S4.T5.3.3.3.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T5.3.3.3.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(Td)\" display=\"inline\"><semantics id=\"S4.T5.3.3.3.1.m1.1a\"><mrow id=\"S4.T5.3.3.3.1.m1.1.1\" xref=\"S4.T5.3.3.3.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T5.3.3.3.1.m1.1.1.3\" xref=\"S4.T5.3.3.3.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T5.3.3.3.1.m1.1.1.2\" xref=\"S4.T5.3.3.3.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T5.3.3.3.1.m1.1.1.1.1\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T5.3.3.3.1.m1.1.1.1.1.2\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.cmml\">(</mo><mrow id=\"S4.T5.3.3.3.1.m1.1.1.1.1.1\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.cmml\"><mi mathsize=\"50%\" id=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.2\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.2.cmml\">T</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.1\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.1.cmml\">​</mo><mi mathsize=\"50%\" id=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.3\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.3.cmml\">d</mi></mrow><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T5.3.3.3.1.m1.1.1.1.1.3\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T5.3.3.3.1.m1.1b\"><apply id=\"S4.T5.3.3.3.1.m1.1.1.cmml\" xref=\"S4.T5.3.3.3.1.m1.1.1\"><times id=\"S4.T5.3.3.3.1.m1.1.1.2.cmml\" xref=\"S4.T5.3.3.3.1.m1.1.1.2\"></times><ci id=\"S4.T5.3.3.3.1.m1.1.1.3.cmml\" xref=\"S4.T5.3.3.3.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1\"><times id=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.1\"></times><ci id=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.2\">𝑇</ci><ci id=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T5.3.3.3.1.m1.1.1.1.1.1.3\">𝑑</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T5.3.3.3.1.m1.1c\">\\mathcal{O}(Td)</annotation></semantics></math></td>\n<td id=\"S4.T5.5.5.5.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.5.5.5.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.5.5.5.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.5.5.5.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local and</span></td>\n</tr>\n<tr id=\"S4.T5.5.5.5.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.5.5.5.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">global models</span></td>\n</tr>\n</table>\n<span id=\"S4.T5.5.5.5.7.2\" class=\"ltx_text\" style=\"font-size:50%;\">.</span>\n</td>\n<td id=\"S4.T5.5.5.5.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.5.5.5.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.5.5.5.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.5.5.5.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">BFGS Hessian</span></td>\n</tr>\n<tr id=\"S4.T5.5.5.5.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.5.5.5.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and global</span></td>\n</tr>\n<tr id=\"S4.T5.5.5.5.8.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T5.5.5.5.8.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.8.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">model update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.4.4.4.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.4.4.4.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.4.4.4.2.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.4.4.4.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T5.4.4.4.2.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(1/R)\" display=\"inline\"><semantics id=\"S4.T5.4.4.4.2.1.1.1.m1.1a\"><mrow id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.3\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.2\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.2\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.cmml\">(</mo><mrow id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.2\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.2.cmml\">1</mn><mo maxsize=\"50%\" minsize=\"50%\" stretchy=\"true\" symmetric=\"true\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.1\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.1.cmml\">/</mo><mi mathsize=\"50%\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.3\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.3.cmml\">R</mi></mrow><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.3\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1b\"><apply id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.cmml\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1\"><times id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.2\"></times><ci id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1\"><divide id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.1\"></divide><cn type=\"integer\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.2\">1</cn><ci id=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T5.4.4.4.2.1.1.1.m1.1.1.1.1.1.3\">𝑅</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T5.4.4.4.2.1.1.1.m1.1c\">\\mathcal{O}(1/R)</annotation></semantics></math></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.5.5.5.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T5.5.5.5.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.5.5.5.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">AS</span></td>\n<td id=\"S4.T5.5.5.5.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T5.5.5.5.3.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T5.5.5.5.3.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T5.5.5.5.3.m1.1.1\" xref=\"S4.T5.5.5.5.3.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T5.5.5.5.3.m1.1b\"><ci id=\"S4.T5.5.5.5.3.m1.1.1.cmml\" xref=\"S4.T5.5.5.5.3.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T5.5.5.5.3.m1.1c\">\\checkmark</annotation></semantics></math></td>\n</tr>\n<tr id=\"S4.T5.7.7.7\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.3\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">FLECS-CGD</span></td>\n<td id=\"S4.T5.7.7.7.4\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.7.4.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.7.4.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.4.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.4.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Calculate</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.7.4.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.4.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.4.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">compressed</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.7.4.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.4.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.4.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Hessian</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.7.4.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.4.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.4.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.7.5\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Single</span></td>\n<td id=\"S4.T5.6.6.6.1\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T5.6.6.6.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(d^{2})\" display=\"inline\"><semantics id=\"S4.T5.6.6.6.1.m1.1a\"><mrow id=\"S4.T5.6.6.6.1.m1.1.1\" xref=\"S4.T5.6.6.6.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T5.6.6.6.1.m1.1.1.3\" xref=\"S4.T5.6.6.6.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T5.6.6.6.1.m1.1.1.2\" xref=\"S4.T5.6.6.6.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T5.6.6.6.1.m1.1.1.1.1\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T5.6.6.6.1.m1.1.1.1.1.2\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.cmml\">(</mo><msup id=\"S4.T5.6.6.6.1.m1.1.1.1.1.1\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.cmml\"><mi mathsize=\"50%\" id=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.2\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.2.cmml\">d</mi><mn mathsize=\"50%\" id=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.3\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.3.cmml\">2</mn></msup><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T5.6.6.6.1.m1.1.1.1.1.3\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T5.6.6.6.1.m1.1b\"><apply id=\"S4.T5.6.6.6.1.m1.1.1.cmml\" xref=\"S4.T5.6.6.6.1.m1.1.1\"><times id=\"S4.T5.6.6.6.1.m1.1.1.2.cmml\" xref=\"S4.T5.6.6.6.1.m1.1.1.2\"></times><ci id=\"S4.T5.6.6.6.1.m1.1.1.3.cmml\" xref=\"S4.T5.6.6.6.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1\"><csymbol cd=\"ambiguous\" id=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1\">superscript</csymbol><ci id=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.2\">𝑑</ci><cn type=\"integer\" id=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T5.6.6.6.1.m1.1.1.1.1.1.3\">2</cn></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T5.6.6.6.1.m1.1c\">\\mathcal{O}(d^{2})</annotation></semantics></math></td>\n<td id=\"S4.T5.7.7.7.6\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.7.6.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.7.6.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.6.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.6.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Compressed</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.7.6.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.6.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.6.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Hessian and</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.7.6.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.6.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.6.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">the gradient</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.7.6.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.6.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.6.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">difference</span></td>\n</tr>\n</table>\n<span id=\"S4.T5.7.7.7.6.2\" class=\"ltx_text\" style=\"font-size:50%;\">.</span>\n</td>\n<td id=\"S4.T5.7.7.7.7\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.7.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.7.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global model</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.7.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and Hessian</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.7.7.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.7.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.7.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.7.8\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T5.7.7.7.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T5.7.7.7.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">sub-linear</span></td>\n</tr>\n<tr id=\"S4.T5.7.7.7.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T5.7.7.7.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">convergence.</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T5.7.7.7.9\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T5.7.7.7.10\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T5.7.7.7.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">AS</span></td>\n<td id=\"S4.T5.7.7.7.2\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T5.7.7.7.2.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T5.7.7.7.2.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T5.7.7.7.2.m1.1.1\" xref=\"S4.T5.7.7.7.2.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T5.7.7.7.2.m1.1b\"><ci id=\"S4.T5.7.7.7.2.m1.1.1.cmml\" xref=\"S4.T5.7.7.7.2.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T5.7.7.7.2.m1.1c\">\\checkmark</annotation></semantics></math></td>\n</tr>\n</table>\n\n",
        "footnotes": "",
        "references": [
            [
                "Another class of FedOpt algorithm is based on the alternating direction method of multipliers (ADMM) ",
                "(Boyd\net al",
                ".",
                ", ",
                "2011",
                ")",
                ", which is simple and efficient. ADMM decouples the complicated problems with the coupling constraint(s) into smaller subproblems coordinated by a master problem. Moreover, it utilizes the augmented Lagrangian function ",
                "(Powell, ",
                "1978",
                "; Hestenes, ",
                "1969",
                ")",
                ", which penalizes the constraint equality with a quadratic term, making it advantageous in numerical stability. Therefore, ADMM is adept at solving the complicated problems with high degree of parallelization, and exhibits linear scaling as data is processed in parallel across devices, making it a natural fit in the large-scale distributive applications. In recent years, ADMM has attracted a considerable amount of attention in both practical and theoretical aspects ",
                "(Taylor et al",
                ".",
                ", ",
                "2016",
                "; Boyd\net al",
                ".",
                ", ",
                "2011",
                ")",
                ". With simple and straightforward modification, ADMM can be adapted to FedOpt.",
                "For algorithmic development, Goldstein et al. ",
                "(Goldstein et al",
                ".",
                ", ",
                "2014",
                ")",
                " has incorporated Nesterov’s acceleration strategy ",
                "(Nesterov, ",
                "1983",
                ")",
                " in ADMM for solving the separate subproblem. It has reached the convergence speed of ",
                "𝒪",
                "​",
                "(",
                "1",
                "/",
                "R",
                "2",
                ")",
                "𝒪",
                "1",
                "superscript",
                "𝑅",
                "2",
                "\\mathcal{O}(\\nicefrac{{1}}{{R^{2}}})",
                " in strongly convex problems. With simple modification, the accelerated ADMM can fit in FedOpt. Another strategy is based on Anderson acceleration ",
                "(Zhang\net al",
                ".",
                ", ",
                "2019",
                ")",
                ", it targets at speeding up the convergence of a fixed-point iteration ",
                "(Walker and Ni, ",
                "2011",
                ")",
                " via the quasi-Newton method by adopting previous iterates by approximating its inverse Jacobian ",
                "(Eyert, ",
                "1996",
                "; Fang and Saad, ",
                "2009",
                ")",
                ". It has shown its superior performance in the nonconvex problems of computer graphics tasks. Considering the topological network, DADMM introduces the undirected graph for modeling the network topology of agents, and the decentralized learning is performed over the agents ",
                "(Shi\net al",
                ".",
                ", ",
                "2014",
                ")",
                ". For further improving the computational efficiency in DADMM, Ling et al. ",
                "(Ling\net al",
                ".",
                ", ",
                "2015",
                ")",
                " has proposed a linearized version of DADMM (DLM). Both DADMM and DLM have been demonstrated the linear convergence rate under the assumption of strong convexity in the objective function. For supporting ADMM in FL, Zhou et al. ",
                "(Zhou and Li, ",
                "2021",
                ")",
                " proposes CEADMM approach, its key idea is to modify the classical ADMM by update the local model and Lagrangian multiplier multiple times before transmitting to the server."
            ]
        ]
    },
    "S4.T6": {
        "caption": "Table 6. Representative federated optimization methods based on ADMM. ",
        "table": "<table id=\"S4.T6.8.8\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S4.T6.8.8.9\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Algorithm</span></td>\n<td id=\"S4.T6.8.8.9.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.9.2.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.9.2.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.2.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.2.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Local</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.9.2.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.2.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.2.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.8.8.9.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.9.3.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.9.3.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.3.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.3.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Local</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.9.3.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.3.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.3.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">steps</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.8.8.9.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.9.4.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.9.4.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.4.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.4.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Local</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.9.4.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.4.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.4.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">complexity</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.8.8.9.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.9.5.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.9.5.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.5.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.5.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Transmission</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.9.5.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.5.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.5.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">quantity</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.8.8.9.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.9.6.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.9.6.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.6.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.6.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Global</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.9.6.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.6.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.6.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.8.8.9.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.9.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.9.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.7.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Convergence</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.9.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.7.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">speed</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.8.8.9.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.9.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.9.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.8.1.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Dealing</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.9.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.9.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.8.1.2.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">with M.D.</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.8.8.9.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.9.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">SC/AS</span></td>\n<td id=\"S4.T6.8.8.9.10\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.9.10.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">PCP</span></td>\n</tr>\n<tr id=\"S4.T6.2.2.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">CEADMM</span></td>\n<td id=\"S4.T6.2.2.2.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.2.2.2.4.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.2.2.2.4.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.4.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.4.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Primal</span></td>\n</tr>\n<tr id=\"S4.T6.2.2.2.4.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.4.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.4.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and dual</span></td>\n</tr>\n<tr id=\"S4.T6.2.2.2.4.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.4.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.4.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">updates</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.2.2.2.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Multiple</span></td>\n<td id=\"S4.T6.1.1.1.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T6.1.1.1.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(Td)\" display=\"inline\"><semantics id=\"S4.T6.1.1.1.1.m1.1a\"><mrow id=\"S4.T6.1.1.1.1.m1.1.1\" xref=\"S4.T6.1.1.1.1.m1.1.1.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T6.1.1.1.1.m1.1.1.3\" xref=\"S4.T6.1.1.1.1.m1.1.1.3.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T6.1.1.1.1.m1.1.1.2\" xref=\"S4.T6.1.1.1.1.m1.1.1.2.cmml\">​</mo><mrow id=\"S4.T6.1.1.1.1.m1.1.1.1.1\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T6.1.1.1.1.m1.1.1.1.1.2\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.cmml\">(</mo><mrow id=\"S4.T6.1.1.1.1.m1.1.1.1.1.1\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.cmml\"><mi mathsize=\"50%\" id=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.2\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.2.cmml\">T</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.1\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.1.cmml\">​</mo><mi mathsize=\"50%\" id=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.3\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.3.cmml\">d</mi></mrow><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T6.1.1.1.1.m1.1.1.1.1.3\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T6.1.1.1.1.m1.1b\"><apply id=\"S4.T6.1.1.1.1.m1.1.1.cmml\" xref=\"S4.T6.1.1.1.1.m1.1.1\"><times id=\"S4.T6.1.1.1.1.m1.1.1.2.cmml\" xref=\"S4.T6.1.1.1.1.m1.1.1.2\"></times><ci id=\"S4.T6.1.1.1.1.m1.1.1.3.cmml\" xref=\"S4.T6.1.1.1.1.m1.1.1.3\">𝒪</ci><apply id=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.cmml\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1\"><times id=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.1.cmml\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.1\"></times><ci id=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.2.cmml\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.2\">𝑇</ci><ci id=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.3.cmml\" xref=\"S4.T6.1.1.1.1.m1.1.1.1.1.1.3\">𝑑</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T6.1.1.1.1.m1.1c\">\\mathcal{O}(Td)</annotation></semantics></math></td>\n<td id=\"S4.T6.2.2.2.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.2.2.2.6.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.2.2.2.6.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.6.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.6.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local model</span></td>\n</tr>\n<tr id=\"S4.T6.2.2.2.6.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.6.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.6.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and Lagrangian</span></td>\n</tr>\n<tr id=\"S4.T6.2.2.2.6.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.6.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.6.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">multiplier,</span></td>\n</tr>\n<tr id=\"S4.T6.2.2.2.6.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.6.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.6.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">global model</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.2.2.2.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.2.2.2.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.2.2.2.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Primal</span></td>\n</tr>\n<tr id=\"S4.T6.2.2.2.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.2.2.2.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.2.2.2.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.8.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T6.2.2.2.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T6.2.2.2.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.2.2.2.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">AS</span></td>\n<td id=\"S4.T6.2.2.2.2\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T6.2.2.2.2.m1.1\" class=\"ltx_Math\" alttext=\"\\checkmark\" display=\"inline\"><semantics id=\"S4.T6.2.2.2.2.m1.1a\"><mi mathsize=\"50%\" mathvariant=\"normal\" id=\"S4.T6.2.2.2.2.m1.1.1\" xref=\"S4.T6.2.2.2.2.m1.1.1.cmml\">✓</mi><annotation-xml encoding=\"MathML-Content\" id=\"S4.T6.2.2.2.2.m1.1b\"><ci id=\"S4.T6.2.2.2.2.m1.1.1.cmml\" xref=\"S4.T6.2.2.2.2.m1.1.1\">✓</ci></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T6.2.2.2.2.m1.1c\">\\checkmark</annotation></semantics></math></td>\n</tr>\n<tr id=\"S4.T6.5.5.5\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Fast ADMM</span></td>\n<td id=\"S4.T6.5.5.5.5\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.5.5.5.5.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.5.5.5.5.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.5.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.5.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Primal</span></td>\n</tr>\n<tr id=\"S4.T6.5.5.5.5.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.5.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.5.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and dual</span></td>\n</tr>\n<tr id=\"S4.T6.5.5.5.5.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.5.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.5.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">updates with</span></td>\n</tr>\n<tr id=\"S4.T6.5.5.5.5.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.5.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.5.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">acceleration</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.5.5.5.6\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.6.1\" class=\"ltx_text\" style=\"font-size:50%;\">Single</span></td>\n<td id=\"S4.T6.3.3.3.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T6.3.3.3.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(d)\" display=\"inline\"><semantics id=\"S4.T6.3.3.3.1.m1.1a\"><mrow id=\"S4.T6.3.3.3.1.m1.1.2\" xref=\"S4.T6.3.3.3.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T6.3.3.3.1.m1.1.2.2\" xref=\"S4.T6.3.3.3.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T6.3.3.3.1.m1.1.2.1\" xref=\"S4.T6.3.3.3.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T6.3.3.3.1.m1.1.2.3.2\" xref=\"S4.T6.3.3.3.1.m1.1.2.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T6.3.3.3.1.m1.1.2.3.2.1\" xref=\"S4.T6.3.3.3.1.m1.1.2.cmml\">(</mo><mi mathsize=\"50%\" id=\"S4.T6.3.3.3.1.m1.1.1\" xref=\"S4.T6.3.3.3.1.m1.1.1.cmml\">d</mi><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T6.3.3.3.1.m1.1.2.3.2.2\" xref=\"S4.T6.3.3.3.1.m1.1.2.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T6.3.3.3.1.m1.1b\"><apply id=\"S4.T6.3.3.3.1.m1.1.2.cmml\" xref=\"S4.T6.3.3.3.1.m1.1.2\"><times id=\"S4.T6.3.3.3.1.m1.1.2.1.cmml\" xref=\"S4.T6.3.3.3.1.m1.1.2.1\"></times><ci id=\"S4.T6.3.3.3.1.m1.1.2.2.cmml\" xref=\"S4.T6.3.3.3.1.m1.1.2.2\">𝒪</ci><ci id=\"S4.T6.3.3.3.1.m1.1.1.cmml\" xref=\"S4.T6.3.3.3.1.m1.1.1\">𝑑</ci></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T6.3.3.3.1.m1.1c\">\\mathcal{O}(d)</annotation></semantics></math></td>\n<td id=\"S4.T6.5.5.5.7\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.5.5.5.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.5.5.5.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local model</span></td>\n</tr>\n<tr id=\"S4.T6.5.5.5.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient,</span></td>\n</tr>\n<tr id=\"S4.T6.5.5.5.7.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.7.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.7.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Lagrangian</span></td>\n</tr>\n<tr id=\"S4.T6.5.5.5.7.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.7.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.7.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">multiplier,</span></td>\n</tr>\n<tr id=\"S4.T6.5.5.5.7.1.5\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.7.1.5.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.7.1.5.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">global model</span></td>\n</tr>\n<tr id=\"S4.T6.5.5.5.7.1.6\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.7.1.6.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.7.1.6.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.5.5.5.8\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.5.5.5.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.5.5.5.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Primal</span></td>\n</tr>\n<tr id=\"S4.T6.5.5.5.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.5.5.5.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.4.4.4.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T6.4.4.4.2.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(\\frac{1}{R^{2}})\" display=\"inline\"><semantics id=\"S4.T6.4.4.4.2.m1.1a\"><mrow id=\"S4.T6.4.4.4.2.m1.1.2\" xref=\"S4.T6.4.4.4.2.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T6.4.4.4.2.m1.1.2.2\" xref=\"S4.T6.4.4.4.2.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T6.4.4.4.2.m1.1.2.1\" xref=\"S4.T6.4.4.4.2.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T6.4.4.4.2.m1.1.2.3.2\" xref=\"S4.T6.4.4.4.2.m1.1.1.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T6.4.4.4.2.m1.1.2.3.2.1\" xref=\"S4.T6.4.4.4.2.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T6.4.4.4.2.m1.1.1\" xref=\"S4.T6.4.4.4.2.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T6.4.4.4.2.m1.1.1.2\" xref=\"S4.T6.4.4.4.2.m1.1.1.2.cmml\">1</mn><msup id=\"S4.T6.4.4.4.2.m1.1.1.3\" xref=\"S4.T6.4.4.4.2.m1.1.1.3.cmml\"><mi mathsize=\"50%\" id=\"S4.T6.4.4.4.2.m1.1.1.3.2\" xref=\"S4.T6.4.4.4.2.m1.1.1.3.2.cmml\">R</mi><mn mathsize=\"50%\" id=\"S4.T6.4.4.4.2.m1.1.1.3.3\" xref=\"S4.T6.4.4.4.2.m1.1.1.3.3.cmml\">2</mn></msup></mfrac><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T6.4.4.4.2.m1.1.2.3.2.2\" xref=\"S4.T6.4.4.4.2.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T6.4.4.4.2.m1.1b\"><apply id=\"S4.T6.4.4.4.2.m1.1.2.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.2\"><times id=\"S4.T6.4.4.4.2.m1.1.2.1.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.2.1\"></times><ci id=\"S4.T6.4.4.4.2.m1.1.2.2.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.2.2\">𝒪</ci><apply id=\"S4.T6.4.4.4.2.m1.1.1.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.2.3.2\"><divide id=\"S4.T6.4.4.4.2.m1.1.1.1.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T6.4.4.4.2.m1.1.1.2.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.1.2\">1</cn><apply id=\"S4.T6.4.4.4.2.m1.1.1.3.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.1.3\"><csymbol cd=\"ambiguous\" id=\"S4.T6.4.4.4.2.m1.1.1.3.1.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.1.3\">superscript</csymbol><ci id=\"S4.T6.4.4.4.2.m1.1.1.3.2.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.1.3.2\">𝑅</ci><cn type=\"integer\" id=\"S4.T6.4.4.4.2.m1.1.1.3.3.cmml\" xref=\"S4.T6.4.4.4.2.m1.1.1.3.3\">2</cn></apply></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T6.4.4.4.2.m1.1c\">\\mathcal{O}(\\frac{1}{R^{2}})</annotation></semantics></math></td>\n<td id=\"S4.T6.5.5.5.9\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T6.5.5.5.10\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.5.5.5.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">SC</span></td>\n<td id=\"S4.T6.5.5.5.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T6.5.5.5.3.m1.1\" class=\"ltx_Math\" alttext=\"\\times\" display=\"inline\"><semantics id=\"S4.T6.5.5.5.3.m1.1a\"><mo mathsize=\"50%\" id=\"S4.T6.5.5.5.3.m1.1.1\" xref=\"S4.T6.5.5.5.3.m1.1.1.cmml\">×</mo><annotation-xml encoding=\"MathML-Content\" id=\"S4.T6.5.5.5.3.m1.1b\"><times id=\"S4.T6.5.5.5.3.m1.1.1.cmml\" xref=\"S4.T6.5.5.5.3.m1.1.1\"></times></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T6.5.5.5.3.m1.1c\">\\times</annotation></semantics></math></td>\n</tr>\n<tr id=\"S4.T6.8.8.8\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.4\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">AsyncADMM</span></td>\n<td id=\"S4.T6.8.8.8.5\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.8.5.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.8.5.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.5.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.5.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Primal</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.8.5.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.5.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.5.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and dual</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.8.5.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.5.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.5.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">updates with</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.8.5.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.5.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.5.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">acceleration</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.8.8.8.6\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.6.1\" class=\"ltx_text\" style=\"font-size:50%;\">Single</span></td>\n<td id=\"S4.T6.6.6.6.1\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T6.6.6.6.1.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}(d)\" display=\"inline\"><semantics id=\"S4.T6.6.6.6.1.m1.1a\"><mrow id=\"S4.T6.6.6.6.1.m1.1.2\" xref=\"S4.T6.6.6.6.1.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T6.6.6.6.1.m1.1.2.2\" xref=\"S4.T6.6.6.6.1.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T6.6.6.6.1.m1.1.2.1\" xref=\"S4.T6.6.6.6.1.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T6.6.6.6.1.m1.1.2.3.2\" xref=\"S4.T6.6.6.6.1.m1.1.2.cmml\"><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T6.6.6.6.1.m1.1.2.3.2.1\" xref=\"S4.T6.6.6.6.1.m1.1.2.cmml\">(</mo><mi mathsize=\"50%\" id=\"S4.T6.6.6.6.1.m1.1.1\" xref=\"S4.T6.6.6.6.1.m1.1.1.cmml\">d</mi><mo maxsize=\"50%\" minsize=\"50%\" id=\"S4.T6.6.6.6.1.m1.1.2.3.2.2\" xref=\"S4.T6.6.6.6.1.m1.1.2.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T6.6.6.6.1.m1.1b\"><apply id=\"S4.T6.6.6.6.1.m1.1.2.cmml\" xref=\"S4.T6.6.6.6.1.m1.1.2\"><times id=\"S4.T6.6.6.6.1.m1.1.2.1.cmml\" xref=\"S4.T6.6.6.6.1.m1.1.2.1\"></times><ci id=\"S4.T6.6.6.6.1.m1.1.2.2.cmml\" xref=\"S4.T6.6.6.6.1.m1.1.2.2\">𝒪</ci><ci id=\"S4.T6.6.6.6.1.m1.1.1.cmml\" xref=\"S4.T6.6.6.6.1.m1.1.1\">𝑑</ci></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T6.6.6.6.1.m1.1c\">\\mathcal{O}(d)</annotation></semantics></math></td>\n<td id=\"S4.T6.8.8.8.7\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.8.7.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.8.7.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.7.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.7.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Local model</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.8.7.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.7.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.7.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient,</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.8.7.1.3\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.7.1.3.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.7.1.3.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Global model</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.8.7.1.4\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.7.1.4.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.7.1.4.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">and gradient</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.8.8.8.8\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\">\n<table id=\"S4.T6.8.8.8.8.1\" class=\"ltx_tabular ltx_align_middle\">\n<tr id=\"S4.T6.8.8.8.8.1.1\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.8.1.1.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.8.1.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">Primal</span></td>\n</tr>\n<tr id=\"S4.T6.8.8.8.8.1.2\" class=\"ltx_tr\">\n<td id=\"S4.T6.8.8.8.8.1.2.1\" class=\"ltx_td ltx_nopad_r ltx_align_left\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.8.1.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">update</span></td>\n</tr>\n</table>\n</td>\n<td id=\"S4.T6.7.7.7.2\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T6.7.7.7.2.m1.1\" class=\"ltx_Math\" alttext=\"\\mathcal{O}\\big{(}\\frac{1}{R}\\big{)}\" display=\"inline\"><semantics id=\"S4.T6.7.7.7.2.m1.1a\"><mrow id=\"S4.T6.7.7.7.2.m1.1.2\" xref=\"S4.T6.7.7.7.2.m1.1.2.cmml\"><mi class=\"ltx_font_mathcaligraphic\" mathsize=\"50%\" id=\"S4.T6.7.7.7.2.m1.1.2.2\" xref=\"S4.T6.7.7.7.2.m1.1.2.2.cmml\">𝒪</mi><mo lspace=\"0em\" rspace=\"0em\" id=\"S4.T6.7.7.7.2.m1.1.2.1\" xref=\"S4.T6.7.7.7.2.m1.1.2.1.cmml\">​</mo><mrow id=\"S4.T6.7.7.7.2.m1.1.2.3.2\" xref=\"S4.T6.7.7.7.2.m1.1.1.cmml\"><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T6.7.7.7.2.m1.1.2.3.2.1\" xref=\"S4.T6.7.7.7.2.m1.1.1.cmml\">(</mo><mfrac id=\"S4.T6.7.7.7.2.m1.1.1\" xref=\"S4.T6.7.7.7.2.m1.1.1.cmml\"><mn mathsize=\"50%\" id=\"S4.T6.7.7.7.2.m1.1.1.2\" xref=\"S4.T6.7.7.7.2.m1.1.1.2.cmml\">1</mn><mi mathsize=\"50%\" id=\"S4.T6.7.7.7.2.m1.1.1.3\" xref=\"S4.T6.7.7.7.2.m1.1.1.3.cmml\">R</mi></mfrac><mo maxsize=\"120%\" minsize=\"120%\" id=\"S4.T6.7.7.7.2.m1.1.2.3.2.2\" xref=\"S4.T6.7.7.7.2.m1.1.1.cmml\">)</mo></mrow></mrow><annotation-xml encoding=\"MathML-Content\" id=\"S4.T6.7.7.7.2.m1.1b\"><apply id=\"S4.T6.7.7.7.2.m1.1.2.cmml\" xref=\"S4.T6.7.7.7.2.m1.1.2\"><times id=\"S4.T6.7.7.7.2.m1.1.2.1.cmml\" xref=\"S4.T6.7.7.7.2.m1.1.2.1\"></times><ci id=\"S4.T6.7.7.7.2.m1.1.2.2.cmml\" xref=\"S4.T6.7.7.7.2.m1.1.2.2\">𝒪</ci><apply id=\"S4.T6.7.7.7.2.m1.1.1.cmml\" xref=\"S4.T6.7.7.7.2.m1.1.2.3.2\"><divide id=\"S4.T6.7.7.7.2.m1.1.1.1.cmml\" xref=\"S4.T6.7.7.7.2.m1.1.2.3.2\"></divide><cn type=\"integer\" id=\"S4.T6.7.7.7.2.m1.1.1.2.cmml\" xref=\"S4.T6.7.7.7.2.m1.1.1.2\">1</cn><ci id=\"S4.T6.7.7.7.2.m1.1.1.3.cmml\" xref=\"S4.T6.7.7.7.2.m1.1.1.3\">𝑅</ci></apply></apply></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T6.7.7.7.2.m1.1c\">\\mathcal{O}\\big{(}\\frac{1}{R}\\big{)}</annotation></semantics></math></td>\n<td id=\"S4.T6.8.8.8.9\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.9.1\" class=\"ltx_text\" style=\"font-size:50%;\">N/A</span></td>\n<td id=\"S4.T6.8.8.8.10\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S4.T6.8.8.8.10.1\" class=\"ltx_text\" style=\"font-size:50%;\">AS</span></td>\n<td id=\"S4.T6.8.8.8.3\" class=\"ltx_td ltx_align_left ltx_border_b ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><math id=\"S4.T6.8.8.8.3.m1.1\" class=\"ltx_Math\" alttext=\"\\times\" display=\"inline\"><semantics id=\"S4.T6.8.8.8.3.m1.1a\"><mo mathsize=\"50%\" id=\"S4.T6.8.8.8.3.m1.1.1\" xref=\"S4.T6.8.8.8.3.m1.1.1.cmml\">×</mo><annotation-xml encoding=\"MathML-Content\" id=\"S4.T6.8.8.8.3.m1.1b\"><times id=\"S4.T6.8.8.8.3.m1.1.1.cmml\" xref=\"S4.T6.8.8.8.3.m1.1.1\"></times></annotation-xml><annotation encoding=\"application/x-tex\" id=\"S4.T6.8.8.8.3.m1.1c\">\\times</annotation></semantics></math></td>\n</tr>\n</table>\n\n",
        "footnotes": "",
        "references": [
            [
                "Another class of FedOpt algorithm is based on the alternating direction method of multipliers (ADMM) ",
                "(Boyd\net al",
                ".",
                ", ",
                "2011",
                ")",
                ", which is simple and efficient. ADMM decouples the complicated problems with the coupling constraint(s) into smaller subproblems coordinated by a master problem. Moreover, it utilizes the augmented Lagrangian function ",
                "(Powell, ",
                "1978",
                "; Hestenes, ",
                "1969",
                ")",
                ", which penalizes the constraint equality with a quadratic term, making it advantageous in numerical stability. Therefore, ADMM is adept at solving the complicated problems with high degree of parallelization, and exhibits linear scaling as data is processed in parallel across devices, making it a natural fit in the large-scale distributive applications. In recent years, ADMM has attracted a considerable amount of attention in both practical and theoretical aspects ",
                "(Taylor et al",
                ".",
                ", ",
                "2016",
                "; Boyd\net al",
                ".",
                ", ",
                "2011",
                ")",
                ". With simple and straightforward modification, ADMM can be adapted to FedOpt.",
                "For algorithmic development, Goldstein et al. ",
                "(Goldstein et al",
                ".",
                ", ",
                "2014",
                ")",
                " has incorporated Nesterov’s acceleration strategy ",
                "(Nesterov, ",
                "1983",
                ")",
                " in ADMM for solving the separate subproblem. It has reached the convergence speed of ",
                "𝒪",
                "​",
                "(",
                "1",
                "/",
                "R",
                "2",
                ")",
                "𝒪",
                "1",
                "superscript",
                "𝑅",
                "2",
                "\\mathcal{O}(\\nicefrac{{1}}{{R^{2}}})",
                " in strongly convex problems. With simple modification, the accelerated ADMM can fit in FedOpt. Another strategy is based on Anderson acceleration ",
                "(Zhang\net al",
                ".",
                ", ",
                "2019",
                ")",
                ", it targets at speeding up the convergence of a fixed-point iteration ",
                "(Walker and Ni, ",
                "2011",
                ")",
                " via the quasi-Newton method by adopting previous iterates by approximating its inverse Jacobian ",
                "(Eyert, ",
                "1996",
                "; Fang and Saad, ",
                "2009",
                ")",
                ". It has shown its superior performance in the nonconvex problems of computer graphics tasks. Considering the topological network, DADMM introduces the undirected graph for modeling the network topology of agents, and the decentralized learning is performed over the agents ",
                "(Shi\net al",
                ".",
                ", ",
                "2014",
                ")",
                ". For further improving the computational efficiency in DADMM, Ling et al. ",
                "(Ling\net al",
                ".",
                ", ",
                "2015",
                ")",
                " has proposed a linearized version of DADMM (DLM). Both DADMM and DLM have been demonstrated the linear convergence rate under the assumption of strong convexity in the objective function. For supporting ADMM in FL, Zhou et al. ",
                "(Zhou and Li, ",
                "2021",
                ")",
                " proposes CEADMM approach, its key idea is to modify the classical ADMM by update the local model and Lagrangian multiplier multiple times before transmitting to the server."
            ]
        ]
    },
    "S5.T7": {
        "caption": "Table 7. Privacy and security in FL.",
        "table": "<table id=\"S5.T7.2\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S5.T7.2.1\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.1.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Ref.</span></td>\n<td id=\"S5.T7.2.1.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.1.2.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Privacy/Security</span></td>\n<td id=\"S5.T7.2.1.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.1.3.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">FL Tasks</span></td>\n<td id=\"S5.T7.2.1.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.1.4.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Categories</span></td>\n<td id=\"S5.T7.2.1.5\" class=\"ltx_td ltx_align_left ltx_border_tt\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.1.5.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:50%;\">Idea</span></td>\n</tr>\n<tr id=\"S5.T7.2.2\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.2.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.2.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Geiping et al<span class=\"ltx_text\">.</span><span id=\"S5.T7.2.2.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib45\" title=\"\" class=\"ltx_ref\">2020</a><span id=\"S5.T7.2.2.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.2.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.2.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Privacy</span></td>\n<td id=\"S5.T7.2.2.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.2.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Information disclosure</span></td>\n<td id=\"S5.T7.2.2.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.2.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Attack Method</span></td>\n<td id=\"S5.T7.2.2.5\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.2.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Magnitude-invariant loss.</span></td>\n</tr>\n<tr id=\"S5.T7.2.3\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.3.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.3.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Sarpatwar et al<span class=\"ltx_text\">.</span><span id=\"S5.T7.2.3.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib125\" title=\"\" class=\"ltx_ref\">2019</a><span id=\"S5.T7.2.3.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.3.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.3.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Privacy</span></td>\n<td id=\"S5.T7.2.3.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.3.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Data Summarization</span></td>\n<td id=\"S5.T7.2.3.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.3.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Defence Method</span></td>\n<td id=\"S5.T7.2.3.5\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.3.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Random Hash</span></td>\n</tr>\n<tr id=\"S5.T7.2.4\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.4.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.4.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Jayaraman\net al<span class=\"ltx_text\">.</span><span id=\"S5.T7.2.4.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib62\" title=\"\" class=\"ltx_ref\">2018</a><span id=\"S5.T7.2.4.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.4.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.4.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Privacy</span></td>\n<td id=\"S5.T7.2.4.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.4.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Model optimization</span></td>\n<td id=\"S5.T7.2.4.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.4.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Defence Method</span></td>\n<td id=\"S5.T7.2.4.5\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.4.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">SMC, Add perturbation</span></td>\n</tr>\n<tr id=\"S5.T7.2.5\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.5.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.5.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Dubey and\nPentland<span id=\"S5.T7.2.5.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib32\" title=\"\" class=\"ltx_ref\">2020</a><span id=\"S5.T7.2.5.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.5.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.5.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Privacy</span></td>\n<td id=\"S5.T7.2.5.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.5.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Federated contextual bandit</span></td>\n<td id=\"S5.T7.2.5.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.5.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Defence Method</span></td>\n<td id=\"S5.T7.2.5.5\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.5.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Upper confidence bounds (UCB), differential private perturbations</span></td>\n</tr>\n<tr id=\"S5.T7.2.6\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.6.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.6.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Sun\net al<span class=\"ltx_text\">.</span><span id=\"S5.T7.2.6.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib135\" title=\"\" class=\"ltx_ref\">2021</a><span id=\"S5.T7.2.6.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.6.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.6.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Privacy</span></td>\n<td id=\"S5.T7.2.6.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.6.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Model optimization</span></td>\n<td id=\"S5.T7.2.6.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.6.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Defence Method</span></td>\n<td id=\"S5.T7.2.6.5\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.6.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Adversarial reconstruction, noise regularization, distance correlation minimization</span></td>\n</tr>\n<tr id=\"S5.T7.2.7\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.7.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.7.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Bhagoji et al<span class=\"ltx_text\">.</span><span id=\"S5.T7.2.7.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib15\" title=\"\" class=\"ltx_ref\">2019</a><span id=\"S5.T7.2.7.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.7.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.7.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Security</span></td>\n<td id=\"S5.T7.2.7.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.7.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Model optimization</span></td>\n<td id=\"S5.T7.2.7.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.7.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Attack Method</span></td>\n<td id=\"S5.T7.2.7.5\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.7.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Optimization based on indicators of stealth</span></td>\n</tr>\n<tr id=\"S5.T7.2.8\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.8.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.8.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Blanchard et al<span class=\"ltx_text\">.</span><span id=\"S5.T7.2.8.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib16\" title=\"\" class=\"ltx_ref\">2017</a><span id=\"S5.T7.2.8.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.8.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.8.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Security</span></td>\n<td id=\"S5.T7.2.8.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.8.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Model optimization</span></td>\n<td id=\"S5.T7.2.8.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.8.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Defence Method</span></td>\n<td id=\"S5.T7.2.8.5\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.8.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Distance-based aggregation rule</span></td>\n</tr>\n<tr id=\"S5.T7.2.9\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.9.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.9.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Yin\net al<span class=\"ltx_text\">.</span><span id=\"S5.T7.2.9.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib159\" title=\"\" class=\"ltx_ref\">2018</a><span id=\"S5.T7.2.9.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.9.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.9.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Security</span></td>\n<td id=\"S5.T7.2.9.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.9.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Model optimization</span></td>\n<td id=\"S5.T7.2.9.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.9.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Defence Method</span></td>\n<td id=\"S5.T7.2.9.5\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.9.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Media and trimmed mean operations of the gradient</span></td>\n</tr>\n<tr id=\"S5.T7.2.10\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.10.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.10.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Li\net al<span class=\"ltx_text\">.</span><span id=\"S5.T7.2.10.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib82\" title=\"\" class=\"ltx_ref\">2020a</a><span id=\"S5.T7.2.10.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.10.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.10.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Security</span></td>\n<td id=\"S5.T7.2.10.3\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.10.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Multi-task learning</span></td>\n<td id=\"S5.T7.2.10.4\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.10.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Defence Method</span></td>\n<td id=\"S5.T7.2.10.5\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.10.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Accumulated loss</span></td>\n</tr>\n<tr id=\"S5.T7.2.11\" class=\"ltx_tr\">\n<td id=\"S5.T7.2.11.1\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_bb ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S5.T7.2.11.1.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">(</span>Ghosh\net al<span class=\"ltx_text\">.</span><span id=\"S5.T7.2.11.1.2.2.1.1\" class=\"ltx_text\" style=\"font-size:50%;\">, </span><a href=\"#bib.bib48\" title=\"\" class=\"ltx_ref\">2020b</a><span id=\"S5.T7.2.11.1.3.3\" class=\"ltx_text\" style=\"font-size:50%;\">)</span></cite></td>\n<td id=\"S5.T7.2.11.2\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_bb ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.11.2.1\" class=\"ltx_text\" style=\"font-size:50%;\">Security</span></td>\n<td id=\"S5.T7.2.11.3\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_bb ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.11.3.1\" class=\"ltx_text\" style=\"font-size:50%;\">Second order optimization</span></td>\n<td id=\"S5.T7.2.11.4\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_bb ltx_border_b ltx_border_r ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.11.4.1\" class=\"ltx_text\" style=\"font-size:50%;\">Defence Method</span></td>\n<td id=\"S5.T7.2.11.5\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_bb ltx_border_b ltx_border_t\" style=\"padding-top:0.25pt;padding-bottom:0.25pt;\"><span id=\"S5.T7.2.11.5.1\" class=\"ltx_text\" style=\"font-size:50%;\">Newton’s method</span></td>\n</tr>\n</table>\n\n",
        "footnotes": "",
        "references": [
            [
                "Defence method.    ",
                "\nThe mainstream defence methods against privacy attacks are based on perturbation mechanisms, random hash mechanisms, homomorphic encryption (HE), and security multi-party computation (SMC), etc.",
                "Specifically, the perturbation mechanisms protect the privacy of participants by adding random noise to their data or released parameters.\nRandom hash mechanisms map the input data into random features while keep some properties of the input data unchanged.\nThese two kinds of mechanisms all fall into random mechanisms. In order to provide a criterion to measure the privacy protection level, these random mechanisms are usually required to satisfy the differential privacy, which is defined as follows.",
                "A randomized mechanism ",
                "ℳ",
                ":",
                "𝒟",
                "→",
                "𝒪",
                ":",
                "ℳ",
                "→",
                "𝒟",
                "𝒪",
                "\\mathcal{M}:\\mathcal{D}\\rightarrow\\mathcal{O}",
                " satisfies ",
                "(",
                "ϵ",
                ",",
                "δ",
                ")",
                "italic-ϵ",
                "𝛿",
                "(\\epsilon,\\delta)",
                "-differential privacy if and only if, for arbitrary adjacent datasets ",
                "D",
                "1",
                "subscript",
                "𝐷",
                "1",
                "D_{1}",
                " and ",
                "D",
                "2",
                "subscript",
                "𝐷",
                "2",
                "D_{2}",
                ", and subset ",
                "O",
                "∈",
                "𝒪",
                "𝑂",
                "𝒪",
                "O\\in\\mathcal{O}",
                ", we have ",
                "P",
                "​",
                "r",
                "​",
                "(",
                "ℳ",
                "​",
                "(",
                "D",
                "1",
                ")",
                "∈",
                "O",
                ")",
                "≤",
                "e",
                "ϵ",
                "​",
                "P",
                "​",
                "r",
                "​",
                "(",
                "ℳ",
                "​",
                "(",
                "D",
                "2",
                ")",
                "∈",
                "O",
                ")",
                "+",
                "δ",
                "𝑃",
                "𝑟",
                "ℳ",
                "subscript",
                "𝐷",
                "1",
                "𝑂",
                "superscript",
                "𝑒",
                "italic-ϵ",
                "𝑃",
                "𝑟",
                "ℳ",
                "subscript",
                "𝐷",
                "2",
                "𝑂",
                "𝛿",
                "Pr(\\mathcal{M}(D_{1})\\in O)\\leq e^{\\epsilon}Pr(\\mathcal{M}(D_{2})\\in O)+\\delta",
                ".",
                "As we can observe from the definition, ",
                "(",
                "ϵ",
                ",",
                "δ",
                ")",
                "italic-ϵ",
                "𝛿",
                "(\\epsilon,\\delta)",
                "-differential privacy requires a certain level of indistinguishability of the input based on the observed output of the randomized mechanism, i.e., the ratio of the likelihood of generating the same output by the two inputs is bound by ",
                "e",
                "ϵ",
                "superscript",
                "𝑒",
                "italic-ϵ",
                "e^{\\epsilon}",
                " with at most the probability of ",
                "δ",
                "𝛿",
                "\\delta",
                " to not satisfy this constraint. Thus, the parameters ",
                "(",
                "ϵ",
                ",",
                "δ",
                ")",
                "italic-ϵ",
                "𝛿",
                "(\\epsilon,\\delta)",
                " quantify the hardness of reconstructing the input based on the output of the randomized mechanism.",
                "On the other hand, homomorphic encryption is a technique that allows us to directly implement computing on the ciphertext and guarantee the correctness of the obtain results after decryption.\nOn the other hand, security multi-party computation is another technique that allows us to obtain the correct computation results without leaking individual private data.\nBased on these methods, we can also preserve user privacy in the computing process of FL.",
                "Sarpatwar et al. ",
                "(Sarpatwar et al",
                ".",
                ", ",
                "2019",
                ")",
                " protect the privacy of participants by learning their data summarization distributedly with differential privacy guarantee, which is solved based on two hash functions based on the Rahimi-Recht Fourier features ",
                "(Rubinstein et al",
                ".",
                ", ",
                "2012",
                ")",
                " and MWEM method ",
                "(Hardt\net al",
                ".",
                ", ",
                "2012",
                ")",
                ".\nJayaraman et al. ",
                "(Jayaraman\net al",
                ".",
                ", ",
                "2018",
                ")",
                " propose two perturbation mechanisms, i.e., the output perturbation method and the gradient perturbation method, of distributed learning to achieve differential privacy, where are all combined with the secure multi-party computation (SMC). Specifically, in the output perturbation method, local models of different participants are aggregated once, and the differential privacy noise is added to the aggregated model before it is revealed. As for the gradient perturbation method, local gradients of different participants are aggregated iteratively to collaboratively train a model, and similarly the differential privacy noise is added to the aggregated gradients before it is revealed.\nDubey et al. ",
                "(Dubey and\nPentland, ",
                "2020",
                ")",
                " investigate the FL problem of solving a contextual linear bandit based on cooperation of multiple participants, whose communication privacy should be protected, and they solve this problem based on upper confidence bounds (UCB) ",
                "(Abbasi-Yadkori et al",
                ".",
                ", ",
                "2011",
                "; Li\net al",
                ".",
                ", ",
                "2010",
                ")",
                " and differential private perturbations  ",
                "(Shariff and\nSheffet, ",
                "2018",
                ")",
                ".\nSun et al. ",
                "(Sun\net al",
                ".",
                ", ",
                "2021",
                ")",
                " focus on defending the privacy leakage in the vertical FL by proposing a framework containing three modules of adversarial reconstruction, noise\nregularization, and distance correlation minimization."
            ]
        ]
    },
    "S6.T8": {
        "caption": "Table 8.  List of FL applications.",
        "table": "<table id=\"S6.T8.2\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S6.T8.2.1\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.1.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.1.1.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:70%;\">Ref.</span></td>\n<td id=\"S6.T8.2.1.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_tt\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.1.2.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:70%;\">Applications</span></td>\n<td id=\"S6.T8.2.1.3\" class=\"ltx_td ltx_align_left ltx_border_tt\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.1.3.1\" class=\"ltx_text ltx_font_bold\" style=\"font-size:70%;\">Idea</span></td>\n</tr>\n<tr id=\"S6.T8.2.2\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.2.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">Comparison </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.2.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Hegedűs et al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.2.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib59\" title=\"\" class=\"ltx_ref\">2019</a><span id=\"S6.T8.2.2.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.2.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.2.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Recommendation</span></td>\n<td id=\"S6.T8.2.2.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.2.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Comparison between FL and gossip learning.</span></td>\n</tr>\n<tr id=\"S6.T8.2.3\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.3.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.3.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">CNFGNN </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.3.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Meng\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.3.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib106\" title=\"\" class=\"ltx_ref\">2021a</a><span id=\"S6.T8.2.3.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.3.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.3.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Traffic flow prediction</span></td>\n<td id=\"S6.T8.2.3.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.3.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Modeling spatial dynamics based on federated graph neural network</span></td>\n</tr>\n<tr id=\"S6.T8.2.4\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.4.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.4.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">FedGNN </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.4.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Wu\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.4.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib150\" title=\"\" class=\"ltx_ref\">2021</a><span id=\"S6.T8.2.4.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.4.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.4.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Recommendation</span></td>\n<td id=\"S6.T8.2.4.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.4.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Generating pseudo interacted items, FE-based neighboring users matching</span></td>\n</tr>\n<tr id=\"S6.T8.2.5\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.5.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.5.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">FedNewsRec </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.5.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Qi\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.5.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib119\" title=\"\" class=\"ltx_ref\">2020</a><span id=\"S6.T8.2.5.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.5.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.5.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Recommendation</span></td>\n<td id=\"S6.T8.2.5.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.5.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Gradient clipping, adding Laplace noise</span></td>\n</tr>\n<tr id=\"S6.T8.2.6\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.6.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.6.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">FedCT </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.6.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Liu\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.6.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib97\" title=\"\" class=\"ltx_ref\">2021</a><span id=\"S6.T8.2.6.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.6.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.6.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Recommendation</span></td>\n<td id=\"S6.T8.2.6.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.6.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Cross-domain transfer learning, intermediate transfer agents on user devices.</span></td>\n</tr>\n<tr id=\"S6.T8.2.7\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.7.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.7.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">FED-MNMF </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.7.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Flanagan et al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.7.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib41\" title=\"\" class=\"ltx_ref\">2020</a><span id=\"S6.T8.2.7.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.7.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.7.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Recommendation</span></td>\n<td id=\"S6.T8.2.7.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.7.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Collaborating between the FL server, item server, and clients</span></td>\n</tr>\n<tr id=\"S6.T8.2.8\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.8.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.8.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">FCF </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.8.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Ammad-Ud-Din et al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.8.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib11\" title=\"\" class=\"ltx_ref\">2019</a><span id=\"S6.T8.2.8.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.8.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.8.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Recommendation</span></td>\n<td id=\"S6.T8.2.8.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.8.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Federated collaborative filtering.</span></td>\n</tr>\n<tr id=\"S6.T8.2.9\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.9.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.9.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">FLOP </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.9.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Yang\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.9.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib157\" title=\"\" class=\"ltx_ref\">2021b</a><span id=\"S6.T8.2.9.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.9.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.9.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Automatic diagnosis</span></td>\n<td id=\"S6.T8.2.9.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.9.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Sharing a partial model between the server and clients.</span></td>\n</tr>\n<tr id=\"S6.T8.2.10\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.10.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.10.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">FedMatch </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.10.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Chen\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.10.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib23\" title=\"\" class=\"ltx_ref\">2021b</a><span id=\"S6.T8.2.10.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.10.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.10.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Question answer</span></td>\n<td id=\"S6.T8.2.10.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.10.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Partition the model into the shared backbone and the private patch.</span></td>\n</tr>\n<tr id=\"S6.T8.2.11\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.11.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.11.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">FedE </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.11.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Chen\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.11.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib26\" title=\"\" class=\"ltx_ref\">2020</a><span id=\"S6.T8.2.11.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.11.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.11.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Knowledge graph completion</span></td>\n<td id=\"S6.T8.2.11.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.11.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Optimization-based model fusion procedure at clients.</span></td>\n</tr>\n<tr id=\"S6.T8.2.12\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.12.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.12.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">FKGE </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.12.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Peng\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.12.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib115\" title=\"\" class=\"ltx_ref\">2021</a><span id=\"S6.T8.2.12.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.12.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.12.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Knowledge graph embedding</span></td>\n<td id=\"S6.T8.2.12.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.12.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">PATE-GAN based translation module between different knowledge graphs.</span></td>\n</tr>\n<tr id=\"S6.T8.2.13\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.13.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.13.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">Experiments </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.13.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Liu\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.13.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib95\" title=\"\" class=\"ltx_ref\">2020b</a><span id=\"S6.T8.2.13.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.13.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.13.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">COVID-19 detection</span></td>\n<td id=\"S6.T8.2.13.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.13.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Compare different models.</span></td>\n</tr>\n<tr id=\"S6.T8.2.14\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.14.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.14.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">SegCaps </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.14.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Kumar et al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.14.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib78\" title=\"\" class=\"ltx_ref\">2021</a><span id=\"S6.T8.2.14.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.14.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.14.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">COVID-19 detection</span></td>\n<td id=\"S6.T8.2.14.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.14.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Data normalization, capsule network, blockchain.</span></td>\n</tr>\n<tr id=\"S6.T8.2.15\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.15.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.15.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">cPDS </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.15.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Brisimi et al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.15.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib19\" title=\"\" class=\"ltx_ref\">2018</a><span id=\"S6.T8.2.15.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.15.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.15.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Hospitalization prediction</span></td>\n<td id=\"S6.T8.2.15.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.15.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">SVM, iterative cluster primal dual splitting algorithm.</span></td>\n</tr>\n<tr id=\"S6.T8.2.16\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.16.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.16.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">fPCA </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.16.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Silva et al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.16.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib131\" title=\"\" class=\"ltx_ref\">2019</a><span id=\"S6.T8.2.16.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.16.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.16.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Brain structure analysis</span></td>\n<td id=\"S6.T8.2.16.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.16.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">ADMM, data standardization, confounding factors correction, and multivariate analysis.</span></td>\n</tr>\n<tr id=\"S6.T8.2.17\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.17.1\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.17.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">CCMF </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.17.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Gao\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.17.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib44\" title=\"\" class=\"ltx_ref\">2019</a><span id=\"S6.T8.2.17.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.17.2\" class=\"ltx_td ltx_align_left ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.17.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Recommendation</span></td>\n<td id=\"S6.T8.2.17.3\" class=\"ltx_td ltx_align_left ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.17.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Laplace perturbation mechanism using both semantics and location information.</span></td>\n</tr>\n<tr id=\"S6.T8.2.18\" class=\"ltx_tr\">\n<td id=\"S6.T8.2.18.1\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_bb ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\">\n<span id=\"S6.T8.2.18.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">DPLCF </span><cite class=\"ltx_cite ltx_citemacro_citep\"><span id=\"S6.T8.2.18.1.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">(</span>Gao\net al<span class=\"ltx_text\">.</span><span id=\"S6.T8.2.18.1.3.2.1.1\" class=\"ltx_text\" style=\"font-size:70%;\">, </span><a href=\"#bib.bib43\" title=\"\" class=\"ltx_ref\">2020</a><span id=\"S6.T8.2.18.1.4.3\" class=\"ltx_text\" style=\"font-size:70%;\">)</span></cite>\n</td>\n<td id=\"S6.T8.2.18.2\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_bb ltx_border_r ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.18.2.1\" class=\"ltx_text\" style=\"font-size:70%;\">Recommendation</span></td>\n<td id=\"S6.T8.2.18.3\" class=\"ltx_td ltx_align_left ltx_border_bb ltx_border_bb ltx_border_t\" style=\"padding-top:0.35pt;padding-bottom:0.35pt;\"><span id=\"S6.T8.2.18.3.1\" class=\"ltx_text\" style=\"font-size:70%;\">Asymmetric flipping perturbation mechanism.</span></td>\n</tr>\n</table>\n\n",
        "footnotes": "",
        "references": [
            [
                "Human Health.    ",
                " As is known, the human health record data is highly private and sensitive, and thus FL can be naturally fit for the cooperation in medical machine learning tasks across multiple institutions ",
                "(Kim\net al",
                ".",
                ", ",
                "2022",
                ")",
                ". Liu et al. ",
                "(Liu\net al",
                ".",
                ", ",
                "2020b",
                ")",
                " compare the performance of federated algorithms with different models to detect COVID-19 based on chest X-ray images, of which the models include MobileNet, ResNet18, and COVID-Net. Brisimi et al. ",
                "(Brisimi et al",
                ".",
                ", ",
                "2018",
                ")",
                " focus on utilizing the sparse Support Vector Machine to predict hospitalization based on FL. Specifically, they propose an iterative cluster Primal Dual Splitting (cPDS) algorithm to sovle this problem. Yang et al. ",
                "(Yang\net al",
                ".",
                ", ",
                "2021b",
                ")",
                " propose a FL algorithm automatic diagnosis of COVID-19 and protect patient privacy simultaneous. Specifically, they propose an algorithm named Federated Learning on medical datasets using partial networks (FLOP), which shares only a partial model between the server and clients to protect user privacy.\nSilva et al. ",
                "(Silva et al",
                ".",
                ", ",
                "2019",
                ")",
                " focus on investigating brain structural relationships with diseases based on FL techniques. Specifically, they propose a framework for data standardization, confounding factors correction, and multivariate analysis based on ADMM and federated principal component analysis (fPCA).",
                "Smart Transportation.    ",
                " With the large-scale urbanization, it is urgently needed to intelligentize the\nvehicular networks (VANET) so as to mitigate the traffic congestion, and FL has become a promising technique due to its natural fit for the network topology ",
                "(Elbir et al",
                ".",
                ", ",
                "2022",
                "; Posner\net al",
                ".",
                ", ",
                "2021",
                ")",
                ". Liu et al. ",
                "(Liu\net al",
                ".",
                ", ",
                "2020c",
                ")",
                " mitigates the privacy and security issues of the existing data gathering fashion by combining FL with gated recurrent unit neural network (FedGRU) for traffic flow prediction. For further mining the spatio-temporal information for traffic flow prediction, Yuan et al. ",
                "(Yuan et al",
                ".",
                ", ",
                "2022",
                ")",
                " first proposes to transform the traffic trajectory into a graph representation, and then combines the FL paradigm, mitigating the privacy issue in centralized paradigm. Meng et al. ",
                "(Meng\net al",
                ".",
                ", ",
                "2021b",
                ")",
                " propose a cross-node FL combining with GNN approach, while it fully exploits the spatial and temporal dynamics of the server and devices, it allows the data generating on each node"
            ]
        ]
    }
}