{
    "PAPER'S NUMBER OF TABLES": 1,
    "S1.T1": {
        "caption": "TABLE I:  Comparative summary between proposed and state-of-the-art methods.",
        "table": "<img src=\"/html/2306.14012/assets/x1.png\" id=\"S1.T1.g1\" class=\"ltx_graphics ltx_centering ltx_img_landscape\" width=\"221\" height=\"92\" alt=\"[Uncaptioned image]\">\n\n",
        "footnotes": "",
        "references": [
            "This paper proposes a fully distributed privacy-preserving algorithm that handles nonsmooth and not necessarily strongly convex objective functions. In addition, the proposed algorithm converges to the exact solution with a rate of O​(1/t)𝑂1𝑡O(1/t). In contrast, existing (sub)gradient-based solutions or solutions handling nonsmooth objective functions in a decentralized manner [19] and fully distributed solutions handling nonsmooth regularizer function only [25], all have a convergence rate of O​(1/t)𝑂1𝑡O(1/\\sqrt{t}). Table I provides a comparative summary of the proposed and most relevant algorithms in the literature [19, 21, 25, 16, 17, 18, 22, 23, 24, 31] in terms of convergence rates, objective functions, implementation strategies (distributed vs. centralized), and privacy metrics.\nWe consider a network of agents that solves an optimization problem collaboratively. Each agent iteratively updates its local estimate using its local data and the estimates received from its neighbors. To ensure privacy, local estimates are perturbed by adding noise before sharing within a neighborhood. The variance of the noise added to the estimates is such that the total privacy leakage of the agents throughout all the iterations is bounded under the zCDP metric. The ADMM used to solve the optimization problem is distributed to comply with the networked setting. Further, its primal update uses an approximation of the augmented Lagrangian obtained by taking the first-order approximation of the objective function. This enables the proposed method to handle nonsmooth objective functions. We provide theoretical proof for the privacy guarantees, convergence to the exact optimal point, and linear convergence rate of the proposed CDP-ADMM algorithm. The analysis is complemented by the theoretical and numerical study of the privacy-accuracy trade-off. Finally, numerical simulations comparing CDP-ADMM to existing methods show that the proposed algorithm has a greater range of applications and better performances than existing methods."
        ]
    }
}