{
    "id_table_1": {
        "caption": "Table 1:  Comparison(%) of ranking results between the surrogate model and the target retrieval model(based on the target retrieval model)",
        "table": "S4.T1.1",
        "footnotes": [],
        "references": [
            "After imitating the retrieval model of  RAG black subscript RAG black \\text{RAG}_{\\text{black}} RAG start_POSTSUBSCRIPT black end_POSTSUBSCRIPT  to obtain the surrogate model, this paper first compares the ranking ability of the surrogate model  M i subscript M i M_{i} italic_M start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  and the target retrieval model  R  M R M RM italic_R italic_M , as well as the similarity of their ranking results, as shown in Table 1, to ensure that the surrogate model has learned the capabilities of the black-box retrieval model.",
            "This paper uses Mean Reciprocal Rank (MRR) and Normalized Discounted Cumulative Gain (NDCG) to reflect the ranking ability of the models themselves; higher values indicate stronger ranking ability in terms of relevance. Inter Ranking Similarity (Inter) and Rank Biased Overlap (RBO) are used to measure the similarity between the ranking results of the surrogate model and the target retrieval model; higher values indicate better performance of the black-box imitation. The weight for RBO@10 is set to 0.7. In Table 1,  indicates that the metric is not applicable to the model.",
            "As can be seen from Table 1, the surrogate model  M i subscript M i M_{i} italic_M start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  trained by black-box imitation is similar to the target retrieval model coCondenser in terms of relevance ranking performance and ranking results, validating the effectiveness of the black-box imitation."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Manipulation results of  R  A  G  black R A G black RAG\\textsubscript{black} italic_R italic_A italic_G  ranking and response opinion",
        "table": "S4.T2.8",
        "footnotes": [],
        "references": [
            "The results of the theme-specific manipulation experiments are shown in Table 2. The adversarial retrieval attack strategy PAT, applied to the adversarial texts generated by the surrogate model, significantly increased the proportion of candidate items holding expected opinion in the Top 3 of the RAG black  retrieval list, thereby guiding the LLM to change its opinion in the response. However, the manipulation effect of RAG black  generated opinions varies across different themes: for education, society, and health topics, the attack success rate and ranking variation of target items are significantly higher than those in government topics. This suggests that the LLM may have been specifically fine-tuned on government-related dataset, enabling it to mitigate the bias in the retrieval context to some extent. Among these topics, controversial opinions in society and health topics are more susceptible to manipulation. Since these two areas are closely related to peoples lives, opinion manipulation in society and health topics may pose a greater risk."
        ]
    },
    "global_footnotes": []
}