{
    "id_table_1": {
        "caption": "Table 1.  Ranking of the 5 most probable potential  root causes (out of 20 categories).",
        "table": "S4.T1.1",
        "footnotes": [],
        "references": [
            "The diagram shown in Figure  1  explicitly states that:",
            "The discrete causal Bayesian Network is suitable for exploiting the  categorized description of an observed problem (i.e., the effect)  and predicting the likelihood of the several possible known  causes. Thus, estimating the likely root causes amounts  to computing the conditional probability diagnosis function  P  ( C | O ) P conditional C O P(C|O) italic_P ( italic_C | italic_O ) .  Note that this estimand operates on the Observational rung of  the Hierarchy of Causality, see Section  2.2.1 .  Eventually, RCA yields a ordered list of potential root cause variables  along with their probabilities, which aligns with the way  complex systems fail  (Cook, R. I.,  2000 ) . The variables that comprise  the data are required to be representative enough to help the  developers and engineers pinpoint the source of the observed problems  through the root causes and their effects  (Weidl, G., Madsen, A. L., and Dahlquist, E.,  2008 ) .",
            "Table  1  shows the resulting distribution  of root causes. Note that the correct cause leads this  ranking, and the rest are given a smooth uniform value.",
            "One first idea could be to improve the granularity of the  (currently discrete categorical) linguistic representation in the  Causal Bayesian Network.  The approach presented in Section  2.1.1  first  embeds the unstructured text data into a large vector  space, then it reduces the dimensionality of this  real-valued numerical description, and finally it quantizes the resulting  low-dimensional representation to obtain a categorical  random variable. At each step, though, some information is  lost due to compression, and while this is especially  advantageous to decrease the complexity of the ensuing (discrete)  probabilistic model, maybe it also introduces some unnecessary  limitations. Therefore, to potentially improve this situation,  Hybrid Bayesian Networks may be helpful to represent  the Observation and Solution texts with their original  vectors (note that the Subsystem and  the Root Cause variables shall retain their categorical nature).  Hybrid Bayesian approaches, which are able to simultaneously  model both discrete and continuous variables  (Atienza, D., Larranaga, P., and Bielza, C.,  2022 ) ,  have already enjoyed success in multivariate  domains for predicting  delays in operations  (Lessan, J., Fu, L., and Wen, C.,  2019 ) , and also in the  reliability assessment of large infrastructure  networks  (Zwirglmaier, K., Chan, J., Papaioannou, I., Song, J., and Straub,  D.,  2024 ) ."
        ]
    },
    "id_table_2": {
        "caption": "Table 2.  Ranking of the 5 most probable potential  solutions (out of 302 categories).",
        "table": "S4.T2.1",
        "footnotes": [],
        "references": [
            "This workshop paper holds the hypothesis that root causes and solutions  can be learned directly from the textual expressions found in  field-specific RoX data, which are fully aligned with the Smart  Troubleshooting objective: given the description of a problem, the system  shall be able to accurately determine the related root cause and solution.  The paper is organized as follows: Section  2   reviews the modeling fundamentals of Causality and  Language, Section  3  describes the  proposed causal diagnosis method from the standpoint of standard  Predictive Maintenance, Section  4  illustrates  the implementation of the method on a specific illustrative  example, Section  5  discusses avenues of improvement  to increase the robustness of the approach, and  Section  6  concludes the work.",
            "The discrete causal Bayesian Network is suitable for exploiting the  categorized description of an observed problem (i.e., the effect)  and predicting the likelihood of the several possible known  causes. Thus, estimating the likely root causes amounts  to computing the conditional probability diagnosis function  P  ( C | O ) P conditional C O P(C|O) italic_P ( italic_C | italic_O ) .  Note that this estimand operates on the Observational rung of  the Hierarchy of Causality, see Section  2.2.1 .  Eventually, RCA yields a ordered list of potential root cause variables  along with their probabilities, which aligns with the way  complex systems fail  (Cook, R. I.,  2000 ) . The variables that comprise  the data are required to be representative enough to help the  developers and engineers pinpoint the source of the observed problems  through the root causes and their effects  (Weidl, G., Madsen, A. L., and Dahlquist, E.,  2008 ) .",
            "Note that this estimand operates on the Interventional rung of  the Hierarchy of Causality, see Section  2.2.2 .  Its computational burden can be somewhat alleviated if the single most  likely Cause is already determined by the former RCA procedure.",
            "Similarly, Table  2  shows the resulting distribution  of potential solutions. While the identification number of the Solution  category is not very informative by itself, note that  the cluster that it represents is likely to have many  descriptive instances in the dataset.",
            "One first idea could be to improve the granularity of the  (currently discrete categorical) linguistic representation in the  Causal Bayesian Network.  The approach presented in Section  2.1.1  first  embeds the unstructured text data into a large vector  space, then it reduces the dimensionality of this  real-valued numerical description, and finally it quantizes the resulting  low-dimensional representation to obtain a categorical  random variable. At each step, though, some information is  lost due to compression, and while this is especially  advantageous to decrease the complexity of the ensuing (discrete)  probabilistic model, maybe it also introduces some unnecessary  limitations. Therefore, to potentially improve this situation,  Hybrid Bayesian Networks may be helpful to represent  the Observation and Solution texts with their original  vectors (note that the Subsystem and  the Root Cause variables shall retain their categorical nature).  Hybrid Bayesian approaches, which are able to simultaneously  model both discrete and continuous variables  (Atienza, D., Larranaga, P., and Bielza, C.,  2022 ) ,  have already enjoyed success in multivariate  domains for predicting  delays in operations  (Lessan, J., Fu, L., and Wen, C.,  2019 ) , and also in the  reliability assessment of large infrastructure  networks  (Zwirglmaier, K., Chan, J., Papaioannou, I., Song, J., and Straub,  D.,  2024 ) .",
            "So far, the main focus of the analysis has been put on the observed  factual data at the population level. However, these data represent  only one of the many potential outcomes the system could have  experienced: had things been different, an alternative outcome  may have been observed. In this sense, a  counterfactual describes a potential  distribution at the  individual  level  driven by hypothetical speculations over data that may contradict  the facts. This level of analysis constitutes an additional third  rung in the Hierarchy of Causality described in Section  2.2 .  Conducting this estimation requires the following  three steps  (Pearl, J., Glymour, M., and Jewell, N. P.,  2016 ) :"
        ]
    },
    "global_footnotes": []
}