{
    "id_table_1": {
        "caption": "Table 1:  Comparison of claim verification accuracy for various retrieval methods: No Retrieval, Semantic Retrieval, KAPING, and our approach,  CommunityKG-RAG 100 25 subscript superscript CommunityKG-RAG 25 100 \\text{CommunityKG-RAG}^{25}_{100} CommunityKG-RAG start_POSTSUPERSCRIPT 25 end_POSTSUPERSCRIPT start_POSTSUBSCRIPT 100 end_POSTSUBSCRIPT , which selects the top 25 percent of relevant communities and uses 100 percent of their mapped sentences as context.",
        "table": "S6.T1.1",
        "footnotes": [],
        "references": [
            "To bridge the existing research gap, we introduce a pioneering framework:  CommunityKG-RAG (Community Knowledge Graph-Retrieval Augmented Generation) . This innovative approach synergizes Knowledge Graphs with Retrieval-Augmented Generation and Large Language Models to enhance fact-checking capabilities. By leveraging and preserving the intricate entity relationships and community structures within KGs, our framework provides a contextually enriched and semantically aware retrieval mechanism that significantly improves the accuracy and relevance of generated responses. Specifically, we construct a comprehensive KG from fact-checking articles, employ the Louvain algorithm for community detection, and assign embeddings derived from word embeddings to each node. This approach ensures that the identified communities are both structurally coherent within the KG and highly pertinent to the fact-checking task. By harnessing this integrated framework, we offer a robust, scalable, and efficient solution to contemporary fact-checking challenges.  An example of this integration and its impact on retrieval accuracy is illustrated in Figure  1 .",
            "where  | E m | subscript E m |E_{m}| | italic_E start_POSTSUBSCRIPT italic_m end_POSTSUBSCRIPT |  is the number of nodes in a community  m m m italic_m  and  e i subscript e i e_{i} italic_e start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  represents the word embedding of node  i i i italic_i  derived from BERT model  Li et al. ( 2023a )  as described in the section  4.1.3 .  This approach aggregates the collective semantic attributes of the community, encapsulating a comprehensive semantic representation.",
            "Overall, our proposed method,  CommunityKG-RAG 100 25 subscript superscript CommunityKG-RAG 25 100 \\text{CommunityKG-RAG}^{25}_{100} CommunityKG-RAG start_POSTSUPERSCRIPT 25 end_POSTSUPERSCRIPT start_POSTSUBSCRIPT 100 end_POSTSUBSCRIPT , not only achieves the best results but also surpasses all baselines, as detailed in Table  1 . The No Retrieval baseline recorded an accuracy of 39.79 percent. Employing the Semantic Retrieval strategy yielded an improvement, elevating accuracy to 43.84 percent. This increase underscores the advantages of integrating semantic context, thereby enhancing the proficiency of the language model in claim verification."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Performance comparison of no retrieval and CommunityKG-RAG with   = 25  25 \\delta=25 italic_ = 25  and   = 25  25 \\lambda=25 italic_ = 25  settings across different backbone models, LLaMa2 7B and LLaMa3 8B.",
        "table": "S6.T2.1",
        "footnotes": [],
        "references": [
            "In this section, we detail our novel framework CommunityKG-RAG for integrating KGs with RAG systems and LLMs to enhance fact-checking capabilities. We show an overview in Figure  2 .  Our approach leverages the structural advantages of KGs to provide a contextually enriched, semantically aware information retrieval mechanism, which is subsequently used to inform the generation process of LLMs.",
            "In this analysis, we compared the performance of two different backbone models: LLaMa2 7B and LLaMa3 8B. Table  2  illustrates the outcomes, showing that  CommunityKG-RAG  significantly enhances performance across both models. Specifically, when employing the  CommunityKG-RAG  framework, there is a notable improvement of 6.18 percentage points with LLaMa2 7B and an increase of 3.21 percentage points with LLaMa3 8B compared to the no retrieval baseline.  However, we observed that the LLaMa3 8B showed a lesser improvement and accuracy over the no retrieval baseline than the 7B model despite its larger size. This may be attributed to the 8B models capability to explore various facets of a given issue more comprehensively, which, while generally beneficial, might lead to a less precise matching in scenarios demanding exact binary evaluations, such as our fact-checking tasks. This characteristic could also contribute to the slightly lower improvement observed with the 8B model."
        ]
    },
    "id_table_3": {
        "caption": "Table 3:  Performance variations of the LLaMa2 7B model under the CommunityKG-RAG framework with consistent community threshold (top 25 percent) and variable community-to-sentence selection.",
        "table": "S6.T3.4",
        "footnotes": [],
        "references": [
            "where  | E m | subscript E m |E_{m}| | italic_E start_POSTSUBSCRIPT italic_m end_POSTSUBSCRIPT |  is the number of nodes in a community  m m m italic_m  and  e i subscript e i e_{i} italic_e start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  represents the word embedding of node  i i i italic_i  derived from BERT model  Li et al. ( 2023a )  as described in the section  4.1.3 .  This approach aggregates the collective semantic attributes of the community, encapsulating a comprehensive semantic representation.",
            "The results presented in Table  3  demonstrate variable model performance as community-to-sentence selection thresholds change. Initially, the performance slightly decreases to 27.83 percent when the inclusion rate of sentences is increased from 25 percent to 50 percent. This might indicate that the top 25 percent of sentences contain the most crucial information for verifying the claim, and including additional sentences up to 50 percent introduces noise or less relevant data that temporarily hinder the models accuracy. However, as the inclusion rate continues to increase to 75 percent and then to 100 percent, the performance improves, ultimately achieving the highest accuracy at a full 100 percent inclusion rate. This suggests that beyond the 50 percent threshold, the additional sentences contribute positively, possibly by providing necessary context that supports more accurate fact-checking."
        ]
    },
    "id_table_4": {
        "caption": "Table 4:  Performance metrics of the LLaMa2 7B model within the CommunityKG-RAG framework across varied thresholds of top community and community-to-sentence selection. The table details the models accuracy percentages at incremental selection thresholds of 25, 50, 75, and 100 percent for both community and community-to-sentence selection, illustrating how varying levels of context inclusion impact the models performance.",
        "table": "S6.T4.4",
        "footnotes": [],
        "references": [
            "where  | E m | subscript E m |E_{m}| | italic_E start_POSTSUBSCRIPT italic_m end_POSTSUBSCRIPT |  is the number of nodes in a community  m m m italic_m  and  e i subscript e i e_{i} italic_e start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  represents the word embedding of node  i i i italic_i  derived from BERT model  Li et al. ( 2023a )  as described in the section  4.1.3 .  This approach aggregates the collective semantic attributes of the community, encapsulating a comprehensive semantic representation.",
            "The results, as shown in Table  4 , reveal interesting trends. Initially, the increase of thresholds from 25 percent to 75 percent led to a slight decrease in performance, suggesting that adding more communities and sentences might introduce noise or less relevant information, thus compromising the models effectiveness. However, a significant improvement is observed when the thresholds are expanded to 100 percent. This enhancement at the highest threshold suggests that the model benefits from a more comprehensive view of the available data, possibly capturing essential contextual nuances that are otherwise missed at lower thresholds. This pattern aligns with observations from previous ablation studies concerning community-to-sentence selection."
        ]
    },
    "id_table_5": {
        "caption": "Table 5:  Community Statistics",
        "table": "A5.T5.1",
        "footnotes": [],
        "references": [
            "We provide the knowledge graph community statistics with various top    \\delta italic_  percent communities in Table  5 . These statistics demonstrate the multi-hop nature of our knowledge graphs through the metrics of average shortest path length and diameter. The average shortest path length, ranging from 4.03 to 4.28 across different community percentages, indicates that on average, multiple hops are required to traverse between nodes. The diameter values, ranging from 13 to 17, suggest the presence of long paths within the graphs, further supporting the existence of multi-hop pathways. These metrics confirm that our CommunityKG-RAG framework effectively leverages multi-hop connections, crucial for retrieving contextually rich and relevant information in fact-checking tasks."
        ]
    },
    "global_footnotes": []
}