{
    "id_table_1": {
        "caption": "Table 1 :  The mean ( stddev) false positive rate (FPR) and schema linking recall (SLR), across  12 12 12 12  runs, associated with five schema linking approaches.  The approaches are sorted in descending order of their ability to reduce false positives.  We report the mean values ( stddev) from  12 12 12 12  runs.",
        "table": "S3.SS2.p2.1",
        "footnotes": [],
        "references": [
            "LLM-based Text-to-SQL approaches typically follow a multi-stage generation pipeline, as shown in Fig.  1   (Hong et al.,  2024 ; Li et al.,  2024a ; Liu et al.,  2024 ; Zhang et al.,  2024 ) .  The pipeline begins with a retrieval stage to collect contextual knowledge  such as the definition of terms and database schema elements.  This is followed by a generation stage, where an LLM produces a candidate SQL query.  Finally, the correction stage regenerates the SQL as needed based on encountered errors.",
            "Table  1  reports the mean ( stddev) of the false positive rate (FPR) and the schema linking recall (SLR) across our four schema linking techniques and without schema filtering at all (full schema) from  12 12 12 12  different runs.  Table  1  shows that these approaches are robust across runs and that as FPR decreases,  i.e. , more irrelevant columns are filtered, more required columns can be filtered and SLR decreases.  SLR as obtained from schema linking represents an upper bound on possible EX, where  100 %  S  L  R percent 100 S L R 100\\%-SLR 100 % - italic_S italic_L italic_R  represents the ratio of queries that will fail in the generation stage due to missing required columns.",
            "We run the same simplified pipeline as our first experiment:  a retrieval stage containing one of the five schema linking approaches in Table  1  followed by a zero-shot generation stage.  We do so across the  12 12 12 12  selected models ( 3.2 ) and track the associated EX.  Fig.  5  shows five EX data points  given the FPR of the five different schema linking approaches.  We interpolate between two adjacent (FPR, EX) data points and show EX as a solid line.  We also add the idealized EX from Experiment 1 as a dashed line.  The difference between the two lines shows the EX difference due to changes in SLR."
        ]
    },
    "id_table_2": {
        "caption": "Table 2 :  Ablation of different methods reporting the execution accuracy (EX) for fine-tuned GPT-4o, Gemini 1.5 Pro, and Llama 3.1-405b. The table compares the full pipeline to variations without augmentation, selection, and correction techniques; with Table-to-Column Schema Linking (TCSL) and Single-Column Schema Linking (SCSL); and as base model performance. Reductions (   \\downarrow  ) or increases (   \\uparrow  ) in accuracy compared to the full pipeline are indicated.",
        "table": "S4.T1.6",
        "footnotes": [],
        "references": [
            "Generation prompts . Fig.  2  shows the structure of the prompt used for SQL generation as well as an example schema, input query, and query hint.",
            "We run the pipeline using the  12 12 12 12  selected models ( 3.2 ) for generation  while applying an equal false positive rate to each query in the evaluation set.  We run for  10 10 10 10  different rates that are equally log-spaced from  99 % percent 99 99\\% 99 %  and  0 % percent 0 0\\% 0 % .  We refer to the execution accuracy under perfect schema linking recall as the idealized execution accuracy (IEX).  We track the change in IEX as the false positive rate changes.  The results in Fig.  3   show the broad trend that IEX improves as the rate of false positives decreases;  specifically, the stage of SQL generation improves as less irrelevant columns are included as contextual information.  At one extreme with a maximum rate of false positives ( 99 % percent 99 99\\% 99 % ),  there is a   28 % similar-to absent percent 28 \\sim 28\\%  28 %  IEX difference between the worst and best performing models.  In the other extreme with no false positives ( 0 % percent 0 0\\% 0 % ), the IEX difference between the worst and best performing models gets reduced to   14 % similar-to absent percent 14 \\sim 14\\%  14 % .",
            "We run the same simplified pipeline as our first experiment:  a retrieval stage containing one of the five schema linking approaches in Table  1  followed by a zero-shot generation stage.  We do so across the  12 12 12 12  selected models ( 3.2 ) and track the associated EX.  Fig.  5  shows five EX data points  given the FPR of the five different schema linking approaches.  We interpolate between two adjacent (FPR, EX) data points and show EX as a solid line.  We also add the idealized EX from Experiment 1 as a dashed line.  The difference between the two lines shows the EX difference due to changes in SLR.",
            "We implemented a full pipeline using zero-shot generation.  The pipeline contained augmentation, correction and selection as described above and no schema linking,  i.e. , always providing the full schema.  We ran an ablation to understand the relative impact of each technique or stage using the three top performing models from Experiment 1:   Llama 3.1-405b ,  Gemini 1.5 Pro , and  ft:GPT-4o .  Table  2  shows the execution accuracy (EX) of the full pipeline and  6 6 6 6  other variations:  without augmentation, correction, or selection,  with schema linking (TCSL and SCSL from Experiment 2),  and without any of these techniques  i.e. , providing the full schema alone to a base model.  We find that all techniques improve accuracy to varying degrees except schema linking with a noticeable difference when evaluating the full pipeline."
        ]
    },
    "id_table_3": {
        "caption": "",
        "table": "S4.T2.17",
        "footnotes": [],
        "references": [
            "We overview the fine-tuning approach of  GPT-4o  momentarily under methodology ( 3.3 ).",
            "We run the pipeline using the  12 12 12 12  selected models ( 3.2 ) for generation  while applying an equal false positive rate to each query in the evaluation set.  We run for  10 10 10 10  different rates that are equally log-spaced from  99 % percent 99 99\\% 99 %  and  0 % percent 0 0\\% 0 % .  We refer to the execution accuracy under perfect schema linking recall as the idealized execution accuracy (IEX).  We track the change in IEX as the false positive rate changes.  The results in Fig.  3   show the broad trend that IEX improves as the rate of false positives decreases;  specifically, the stage of SQL generation improves as less irrelevant columns are included as contextual information.  At one extreme with a maximum rate of false positives ( 99 % percent 99 99\\% 99 % ),  there is a   28 % similar-to absent percent 28 \\sim 28\\%  28 %  IEX difference between the worst and best performing models.  In the other extreme with no false positives ( 0 % percent 0 0\\% 0 % ), the IEX difference between the worst and best performing models gets reduced to   14 % similar-to absent percent 14 \\sim 14\\%  14 % .",
            "We use a models maximum IEX in this experiment as a proxy for its SQL generation capability.  Models with higher generation capability, such as  Gemini 1.5 Pro , demonstrate greater resilience to false positives compared to lower-performing ones like  Llama 3.1-8b .  We characterize a models resilience to false positives by the relative change in its SQL generation capability as the false positive rate changes.  We define a metric for sensitivity to false positives as the proportion of change in IEX over the proportion of change in the false positive rate (FPR):  d  ( I  E  X ) / d  ( F  R  P ) d I E X d F R P d(IEX)/d(FRP) italic_d ( italic_I italic_E italic_X ) / italic_d ( italic_F italic_R italic_P ) .  As such, sensitivity to false positives is the slope derived from the models (IEX, FPR) data points.  Fig.  3  depicts a strong negative correlation between a models SQL generation capability (maximum IEX) and its sensitivity to false positives.",
            "We run the same simplified pipeline as our first experiment:  a retrieval stage containing one of the five schema linking approaches in Table  1  followed by a zero-shot generation stage.  We do so across the  12 12 12 12  selected models ( 3.2 ) and track the associated EX.  Fig.  5  shows five EX data points  given the FPR of the five different schema linking approaches.  We interpolate between two adjacent (FPR, EX) data points and show EX as a solid line.  We also add the idealized EX from Experiment 1 as a dashed line.  The difference between the two lines shows the EX difference due to changes in SLR."
        ]
    },
    "global_footnotes": []
}