{
    "id_table_1": {
        "caption": "Table 1 .  Faculty opinion on Task A and Task B by different course level. A represents a vote in the ability of the RAG and a X denotes a no-confidence on the task.",
        "table": "S4.T1.4",
        "footnotes": [],
        "references": [
            "In this section, we discuss our questionnaire, which was presented to faculty members following their usage of the RAG system. This study incorporated factors such as perceived ease of use, perceived usefulness, attitudes, and intention to use, following the TAM model  (Davis,  1989 ) . The questionnaire contained three types of questions. For tasks A and B, as introduced in Section  3.1 , the items were assessed using a 5-point Likert scale, with scores ranging from 1 to 5 as follows: strongly disagree = 1, disagree = 2, neutral = 3, agree = 4, and strongly agree = 5. Suggestions for improvements required for feasible use in daily teaching assistance, as teaching assistants, and general teaching aids were obtained through written answers to understand the limitations and potential of RAG LLMs. We also present two  Yes  and  No  answer questions seeking votes on the potential of RAG LLM as a teaching aid and teaching assistants in computer science higher education classes. No fixed period for usage of the RAG system was defined, and faculty members participating populated the questionnaire on their own timeline once they were satisfied with their investigation.",
            "In this section, we present the ratings and feedback obtained from the faculty members and are presented in four subsections of Task ratings (Section  4.1 ), RQ1 and RQ2 rating (Section  4.2 ), Faculty Feedback (Section  4.3 ), and lastly RQ3 Interpretation (Section  4.4 ).",
            "In this section, we analyze the interpretation of RQ3 based on faculty feedback and ratings of RQ1 and RQ2, as discussed in the previous sections. Faculty members 3 and 4, both teaching graduate-level classes, reported a lack of confidence in Task A, as shown in Table  1 . Their feedback indicates that improvements are needed through training on mixed data, with the primary limitation being reliance on text-format files. This limitation was further corroborated by Faculty 5, who highlighted its inadequacy in inferring knowledge from images. Additionally, Faculty 2 suggested the need for enhanced capabilities to solve simple problems based on equations. Collectively, these feedback points suggest that direct application of RAG is more suitable for theoretical classes that do not extensively use images and equations. While we do not quantify performance, our focus is on reporting faculty views and understanding the potential and limitations of RAG in a higher education setting."
        ]
    },
    "global_footnotes": []
}