{
    "id_table_1": {
        "caption": "Table 1:  Role Classification Based on Trustworthiness Value",
        "table": "Sx3.T1.7",
        "footnotes": [],
        "references": [
            "In multiplayer games with incomplete information, reasoning is crucial for assessing the trustworthiness of players who may conceal their intentions based on their actions, dialogue, and other observable information. Autonomous agents must analyze and evaluate the reliability of available information sources to determine player trust and cooperation  (Fig.  1 ) . Currently, key methods supporting such reasoning include symbolic reasoning  (Nye et al.  2021 ; Lu et al.  2021 )  and evidential theory  (Liu et al.  2021 ) , Bayesian reasoning  (Wojtowicz and DeDeo  2020 ; Sohn and Narain  2021 ; Wan and Du  2021 ) , and reinforcement learning (RL)  (Wan et al.  2021 ; Wang, Hao, and Cao  2020 ; Tiwari, Zhu, and Pandey  2021 ) .",
            "Role Classification   R i t  ( p j ) subscript superscript R t i subscript p j \\mathcal{R}^{t}_{i}(p_{j}) caligraphic_R start_POSTSUPERSCRIPT italic_t end_POSTSUPERSCRIPT start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ( italic_p start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT ) : The classification of  p j subscript p j p_{j} italic_p start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT s role as perceived by  p i subscript p i p_{i} italic_p start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT , determined by  T i t  ( p j ) subscript superscript T t i subscript p j T^{t}_{i}(p_{j}) italic_T start_POSTSUPERSCRIPT italic_t end_POSTSUPERSCRIPT start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ( italic_p start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT ) , which is as Table  1 , where   italic- \\epsilon italic_  is the tolerance threshold for neutral judgment. Player  p i subscript p i p_{i} italic_p start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  has an inherent trustworthiness of 1 toward themselves, i.e.,  T i t  ( p i ) = 1 subscript superscript T t i subscript p i 1 T^{t}_{i}(p_{i})=1 italic_T start_POSTSUPERSCRIPT italic_t end_POSTSUPERSCRIPT start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ( italic_p start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ) = 1 ."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Comparison of win Rates among algorithms in the werewolf game.",
        "table": "Sx4.T2.1",
        "footnotes": [],
        "references": [
            "The Table  2  shows the comparison of the winning rates of GRATR, baseline LLM and LLM enhanced with Native RAG and Rerank RAG in the same game."
        ]
    },
    "id_table_3": {
        "caption": "Table 3:  WS stands for the score earned by winning, CVS stands for the score earned by correctly voting for the enemy during the day, and WVS stands for the score earned by incorrectly voting for a teammate during the day.",
        "table": "Sx4.T3.1",
        "footnotes": [],
        "references": [
            "In Fig.  3 , the GRATR algorithm consistently outperforms the original algorithm across all roles in the Werewolf game. WEPS, WIPS, GPS, SPS and VPS represent the average performance scores of the werewolf, witch, guard, seer and villager identities, respectively. GRATR excels most in the guard role, scoring 7.240, which is 4.820 points higher than the original algorithm, highlighting its superior defensive strategy. In the witch role, GRATR scores 7.120, surpassing the original by 4.340 points, demonstrating stronger decision-making abilities. For the werewolf role, GRATR achieves a score of 5.487, 3.287 points above the original, indicating better deception and manipulation. The prophet role sees GRATR scoring 6.040, 3.560 points higher, reflecting improved identification and revelation skills. Overall, GRATR demonstrates superior strategic execution and adaptability across all roles.",
            "In Fig.  3 , GRATR shows clear advantages across all roles in the Werewolf game. For the werewolf role, GRATR achieves a score of 4.653, which is 2.606 points higher than the 2.047 score of the original algorithm with Native RAG, indicating superior performance in deception and strategy. In the Witch role, GRATR scores 7.080, outperforming the original by 3.100 points, reflecting enhanced decision-making and potion use. The guard role demonstrates GRATRs notable strength, with a score of 7.560, exceeding the original by 4.060 points, highlighting its superior defensive capabilities. The seer role also sees significant improvement, with GRATR scoring 6.180, 2.800 points higher than the originals 3.380, showcasing better identification and revelation skills. Finally, in the villager role, GRATR scores 4.860, surpassing the original by 0.860 points, indicating a more consistent and reliable performance. Overall, GRATRs enhanced scores across these roles suggest a more effective and adaptable strategy compared to the original algorithm with Native RAG.",
            "In Fig.  3 , the GRATR algorithm demonstrates a marked improvement over the original algorithm assisted by Rerank RAG across all roles within the Werewolf game. Specifically, GRATR achieves a 5.174 point higher performance in the Werewolf role (6.380 compared to 1.206), a 6.080 point increase in the Witch role (8.300 versus 2.220), and a 6.920 point enhancement in the Guard role (8.420 as opposed to 1.500). These substantial improvements across diverse roles underscore the superior strategic execution, enhanced defensive mechanisms, and overall effectiveness of the GRATR algorithm."
        ]
    },
    "id_table_4": {
        "caption": "",
        "table": "A2.tab1.1",
        "footnotes": [],
        "references": [
            "In Fig.  4 , WE means werewolf, WI means witch, GU means guard, SE means seer, VI means villager. The GRATR algorithm demonstrates a marked improvement in reasoning capabilities over the original algorithm across all roles within the Werewolf game. GRATR achieves an overall success ratio of 0.752, significantly surpassing the original algorithms 0.450. Notably, GRATR exhibits exceptional performance in the Werewolf role, with a success ratio of 0.846, and in the Seer role, with a success ratio of 0.770, indicating a superior ability to both conceal its identity and accurately infer the identities of other players. Even in the Witch role, where GRATRs success ratio is relatively lower at 0.609, it still substantially outperforms the original algorithm. These findings underscore the enhanced strategic inference capabilities of GRATR across diverse roles in the game.",
            "In Fig.  4 , compared to the original algorithm supported by Native RAG, the GRATR algorithm shows a significant improvement in reasoning success in all roles. Specifically, in the werewolf role, GRATR achieves a success rate of 0.868, which is significantly higher than the 0.284 achieved by the original algorithm. This indicates GRATRs superior ability to minimize false inferences, often referred to as phantoms, thereby allowing more accurate inferences to be made about other identities. For the villager role, GRATR achieved a success rate of 0.661, compared to 0.292 for the original algorithm. Despite the inherent limitations of the villager role and the lack of special abilities, GRATRs advanced reasoning capabilities allow it to draw more accurate conclusions from minimal information, demonstrating the algorithms effectiveness in making the most of limited data.",
            "In Fig.  4 , the GRATR algorithm shows a significant advantage over the original algorithm augmented with Rerank RAG in reasoning about other identities. GRATR achieves an overall success rate of 0.751, significantly higher than the 0.295 achieved by the original algorithm. This improved performance is evident across all roles: in the werewolf role, GRATRs success rate is 0.868, significantly higher than the original algorithms 0.297. In the witch role, GRATR records a success rate of 0.686, compared to the originals 0.321, indicating superior effectiveness in exploiting the witchs unique abilities. Similarly, GRATR has a success rate of 0.669 in the Guardian role and 0.771 in the Seer role, both of which are significantly higher than the original algorithms corresponding success rates of 0.262 and 0.280. In addition, GRATRs success rate of 0.661 in the villager role exceeds the originals 0.321, demonstrating its effectiveness in making accurate inferences from limited information. These results underscore GRATRs overall superiority in accurate role identification and strategic reasoning across different roles."
        ]
    },
    "id_table_5": {
        "caption": "",
        "table": "A2.tab2.1",
        "footnotes": [],
        "references": []
    },
    "id_table_6": {
        "caption": "",
        "table": "A2.tab3.1",
        "footnotes": [],
        "references": []
    },
    "global_footnotes": []
}