{
    "id_table_1": {
        "caption": "Table 1:  Available datasets along with the number of instances, data sources, and references.",
        "table": "Sx4.T1.1.1",
        "footnotes": [],
        "references": [
            "Fact-checking potentially false claims is an essential moderation task to reduce the spread of misinformation. Several organizations such as FactCheck, PolitiFact, NewsGuard, and Full Fact perform manual fact-checking to verify claims in different domains. However, this has been regarded as a laborious task that requires domain expertise  (Adair et al.  2017 ; Hanselowski  2020 )  and it has become less and less feasible due to the sheer volume of misinformation that can be generated by humans and AI models. Automated fact-checking has become an increasingly popular approach to verify the veracity of claims in a given text. 2 2 2 We acknowledge that claim verification models can also be applied to other modalities of data (e.g., images). In this survey, we address models applied to text only.  There are several steps involved in the fact-verification pipelines, but the three main components are claim detection, evidence retrieval, and veracity prediction.  Models used in these steps have followed the general methodological developments of the field and we have thus observed an increase in the use of LLMs for claim verification  (Zhang and Gao  2023 ; Wang and Shu  2023 ; Quelle and Bovet  2024 ) . Figure  1  shows an example claim veracity scenario and compares the architectural differences between NLP-based (traditional) and LLM-based claim verification systems. Compared to traditional systems which use NLP-based models, fact verification are less prone to error propagation, and provide explainable/interpretable generations/justification when verifying claims.",
            "The fundamental resource for training and evaluating claim verification systems is datasets containing annotated texts. As most research in this area deals with English data, we collect information about all publicly available English datasets used in the papers discussed in this survey and present them in Table  1 ."
        ]
    },
    "global_footnotes": [
        "We use the terms",
        "and",
        "interchangeably given the overlap between the two concepts.",
        "We acknowledge that claim verification models can also be applied to other modalities of data (e.g., images). In this survey, we address models applied to text only.",
        "ACM:",
        ". IEEE Xplore:",
        ". Scopus:",
        ". ACL:",
        ". Web of Science:",
        ". Springer:",
        ". ArXiv:",
        ". CEUR:",
        ".",
        "https://competitions.codalab.org/competitions/21611",
        "https://defactify.com/factify3.html",
        "https://fever.ai/task.html"
    ]
}