{
    "id_table_1": {
        "caption": "TABLE I:  Applications of GAI for Wi-Fi Networks.",
        "table": "S3.T1.3",
        "footnotes": [],
        "references": [
            "Conventionally, Wi-Fi technologies have primarily been responsible for data transmissions in wireless local area network (WLAN). Recently, the sensing capabilities of Wi-Fi radio signals have gained attention. To achieve this, two relevant protocols have been proposed: Wi-Fi sensing based on IEEE 802.11bf and indoor positioning based on IEEE 802.11az. Leveraging the sensing capabilities, Wi-Fi can improve work efficiency, reduce accidents, and greatly facilitate peoples daily lives by enabling activity recognition, object sensing, and localization  [ 6 ] . Furthermore, the ubiquitous coverage of Wi-Fi networks has paved the way for mobile edge computing (MEC). Incorporating MEC into Wi-Fi infrastructure can significantly relieve transmission congestion and overloading in cellular network caused by excessive task offloading  [ 7 ] . Fig.  1 (A) presents the features of the current Wi-Fi generations, and Fig.  1 (B) presents the main applications."
        ]
    },
    "global_footnotes": [
        "IEEE Standard for Information technology Local and metropolitan area networks Specific requirements Part 11: Wireless LAN Medium Access Control (MAC)and Physical Layer (PHY) Specifications Amendment 5: Enhancements for Higher Throughput, in IEEE Std 802.11n-2009 (Amendment to IEEE Std 802.11-2007 as amended by IEEE Std 802.11k-2008, IEEE Std 802.11r-2008, IEEE Std 802.11y-2008, and IEEE Std 802.11w-2009) , vol., no., pp.1-565, 29 Oct. 2009",
        "IEEE Standard for Information technology Telecommunications and information exchange between systemsLocal and metropolitan area networks Specific requirementsPart 11: Wireless LAN Medium Access Control (MAC) and Physical Layer (PHY) SpecificationsAmendment 4: Enhancements for Very High Throughput for Operation in Bands below 6 GHz., in IEEE Std 802.11ac-2013 (Amendment to IEEE Std 802.11-2012, as amended by IEEE Std 802.11ae-2012, IEEE Std 802.11aa-2012, and IEEE Std 802.11ad-2012) , vol., no., pp.1-425, 18 Dec. 2013",
        "IEEE Standard for Information TechnologyTelecommunications and Information Exchange between Systems Local and Metropolitan Area NetworksSpecific Requirements Part 11: Wireless LAN Medium Access Control (MAC) and Physical Layer (PHY) Specifications Amendment 1: Enhancements for High-Efficiency WLAN, in IEEE Std 802.11ax-2021 (Amendment to IEEE Std 802.11-2020) , vol., no., pp.1-767, 19 May 2021",
        "IEEE Draft Standard for Information technologyTelecommunications and information exchange between systems Local and metropolitan area networksSpecific requirements - Part 11: Wireless LAN Medium Access Control (MAC) and Physical Layer (PHY) Specifications Amendment: Enhancements for Extremely High Throughput (EHT), in IEEE P802.11be/D3.0, January 2023 , vol., no., pp.1-999, 1 March 2023."
    ]
}