{
    "id_table_1": {
        "caption": "TABLE I:  Performance comparison (mean  standard deviation measured as accuracy classification of six different classes) for different Two-Step TL configurations. The baseline is defined to establish a model reference. Two-Step TL* configurations (with a star) denote that the intermediate and target distributions are similar. While a Two-Step TL configuration (without a star) is used to denote an intermediate distribution (such as CCD-camera or synthetic) towards an endoscopic dataset. The best results for each view are denoted in bold. Accuracy I and II, correspond to the test on the 1st and 2nd step TL, respectively.",
        "table": "S5.T1.26",
        "footnotes": [],
        "references": [
            "Several recent works have proposed the use of Generative Adversarial Networks (GANs) or more recently, Diffusion Models to create new samples for copying with data imbalance and out-of-distribution issues in medical systems  [ 8 ] . In this contribution, we present the results of a preliminary study for the assessment of synthetically generated images of kidney stones from a pre-existing ex-vivo dataset (Fig.  1 ).",
            "Dataset B (Synthetic images with sinDDM).  The synthetic dataset obtained in Section  III-B , consists of 300 synthetic images simulating CCD camera images acquired ex-vivo from dataset A. The images were generated with the sinDDM method  [ 10 ] . These images are divided into two sets of 150 images for surface and section. Each view contains the six subtypes presented in dataset A. Some examples of the generated images are presented in Fig.  1 . The dimensions of the images in dataset B are 1056  \\times  800 pixels.",
            "Synthetic image generation:   For the generation of synthetic images based on CCD-camera images, a total of 12 models were trained (see Fig.  1 ). Six models (one for each subtype) for each view (SUR, and SEC) were trained using SinDDM with the same implementation details described in  [ 10 ] . Eight CCD-camera images with padding were used as training sets for each model. A total of 25 images were generated by the SinDDM model, which presents similar shape, color, and texture characteristics to the input set. Despite generating synthetic images with high detail preservation, the output dimensions are reduced (264  \\times  200 pixels), which is not useful for the classification tasks that will be addressed in Section  IV ."
        ]
    }
}