{
    "id_table_1": {
        "caption": "(a)   Results over Headlines and Tweet-news (text similarity task) with 1 example per score",
        "table": "S2.T1.st1.2",
        "footnotes": [],
        "references": []
    },
    "id_table_2": {
        "caption": "(b)   Results over CrossNER-Literature and CrossNER-Politics (NER task) with 5 examples.",
        "table": "S2.T1.st2.2",
        "footnotes": [],
        "references": [
            "In equation  2 , we normalize the performance of LLM  K K K italic_K  by subtracting the average performance of all approaches on the dataset generated by  K K K italic_K . Subsequently, in equation  3 , we compare the normalized performance of LLM  K K K italic_K  on its own dataset to its average normalized performance across datasets generated by other LLMs."
        ]
    },
    "id_table_3": {
        "caption": "(c)   Results over SNIPS and ATIS (intent classification task) with 1 example per intent",
        "table": "S2.T1.st3.2",
        "footnotes": [],
        "references": [
            "In equation  2 , we normalize the performance of LLM  K K K italic_K  by subtracting the average performance of all approaches on the dataset generated by  K K K italic_K . Subsequently, in equation  3 , we compare the normalized performance of LLM  K K K italic_K  on its own dataset to its average normalized performance across datasets generated by other LLMs."
        ]
    },
    "id_table_4": {
        "caption": "TABLE I :  Results on evaluating the efficacy of synthetic data as a substitute for real data for benchmarking. We report using Mean Square Performance Difference (MSPD), as described in Section  II-B , where lower values indicate better absolute performance. To capture relative performance, we use Spearman rank correlation coefficient (SRCC), where higher values indicate better performance. Apart from all LLMs, we also report Average which is the mean of performance metric of individual LLMs.",
        "table": "S2.T2.2",
        "footnotes": [
            ""
        ],
        "references": []
    }
}