{
    "id_table_1": {
        "caption": "TABLE I:  Comparison of the performance of the three losses SDM, TAL, and BSDM in the IRRA [ 6 ] , RDE [ 37 ] , and AMNS methods on the CUHK-PEDES dataset, where \"Best\" denotes the selection of the best checkpoints to be tested on the validation set, and the best results are shown in bold. The RDE method continues its performance comparison using two synthetic noise rates, i.e., 20% and 50% to simulate the performance under the real field where the image-text pairs are not well aligned.",
        "table": "S2.T1.15.15",
        "footnotes": [],
        "references": []
    },
    "id_table_2": {
        "caption": "TABLE II:  Performance comparison on three datasets. The best and second-best results are in bold and underline, respectively.",
        "table": "S2.T2.1.1",
        "footnotes": [],
        "references": [
            "Therefore, we propose Bidirectional Similarity Distribution Matching (BSDM), the core idea of which is shown in Fig.  2 . Building upon the forward KL divergence, BSDM incorporates the inverse KL divergence, so that the distribution  p p \\mathbf{p} bold_p  can also exert constraints on the distribution  q q \\mathbf{q} bold_q . This bidirectional constraint helps alleviate Noisy Correspondences (NC) by allowing the model some flexibility in fitting the data, rather than blindly striving for perfect alignment with all positive pairs."
        ]
    },
    "id_table_3": {
        "caption": "TABLE III:  Ablation study on each component of AMNS on CUHK-PEDES.",
        "table": "S3.T3.4.4",
        "footnotes": [],
        "references": [
            "Correspondingly, the loss from text to image  L t  2  i subscript L t 2 i \\mathcal{L}_{t2i} caligraphic_L start_POSTSUBSCRIPT italic_t 2 italic_i end_POSTSUBSCRIPT  can be exchanged for  f v superscript f v f^{v} italic_f start_POSTSUPERSCRIPT italic_v end_POSTSUPERSCRIPT  and  f t superscript f t f^{t} italic_f start_POSTSUPERSCRIPT italic_t end_POSTSUPERSCRIPT  in Eq. ( 3 ) ( 4 ), BSDM loss is calculated by:",
            "In Fig.  3 , the experimental results on AMNS show that the effect of attention-weighted selective mask based on attention is generally better than that of random mask, and the effect of attention-weighted selective mask reaches the optimal effect when the mask ratio = 0.5. Therefore, in the subsequent experiments, for the AWM strategy, we all set the mask ratio to 0.5 for the experiments."
        ]
    },
    "global_footnotes": []
}