{
    "id_table_1": {
        "caption": "Table 1:  Top 2 retrieval success rates over 3 corpora, 3 retrievers, 5 query sets, and 5 sets of targeted information. The interpretation of results in each cell adheres the following rule. We use the top-left cell as an example: it represents a success rate of  0.78 0.78 0.78 0.78  achieved using the Corpus: Textbook, Retriever: MedCPT, Query set: MMLU-Med, with PPI as the targeted information.",
        "table": "S3.T1.227.225.225",
        "footnotes": [],
        "references": [
            "Revealing the safety risks for retrieval systems: A case study for medical Q&A.   We demonstrate that dense retrieval systems are vulnerable to what we term as universal poisoning attacks in medical Q&A, across a total of 225 different use-case combinations of corpus, retriever, query, and targeted information.  As shown in Figure  1  below, in these attacks, adversaries can  append nearly every sort of information, such as personally identifiable information (PII) and adversarial treatment recommendation, to a set of attacker-specified queries. Once these poisoned documents are injected into a large-scale corpus, such as Wikipedia and PubMed, they can be accurately retrieved, often with high rankings, e.g., top  1 1 1 1 , using attacker-specified queries.  Depending on attackers goals, these documents will lead to safety risks such as (1) leakage of PII, (2) adversarial recommendations for treatments, and (3) jailbreaking the LLM during the inference stage once they are used as context.",
            "We report the success rates over a total of 225 combinations of query, corpus, retriever, and targeted information in Table  1  below. For each category of targeted information, we generated three different documents, calculated their success rates, and reported the mean value. The standard deviations are less than  0.07 0.07 0.07 0.07 . The interpretation of results in each cell adheres to the same following rule. We use the top-left cell as an example: it represents a success rate of  0.78 0.78 0.78 0.78  achieved using the Corpus: Textbook, Retriever: MedCPT, Query set: MMLU-Med, with PPI as the targeted information."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Top  2 2 2 2  retrieval success rates under query-paraphrasing defenses.  We observe consistently high success rates despite the fact that the queries are paraphrased.",
        "table": "S3.T2.47.45.45",
        "footnotes": [],
        "references": [
            "New defense against universal poisoning attacks.   We empirically observed that the commonly observed not-so-close retrieved documents tend to be perpendicular to their corresponding query. Meanwhile, since the poisoned documents will not significantly deviate from the query, as a result of the previous discussion, the poisoned document also tends to be perpendicular to clean documents. This property motivates us to consider using distance metrics that reflect the probability distribution of the data to detect poisoned documents. As shown in the right-most of Figure  2 , we observe a clear separation between clean and poisoned documents. However, such a distinction does not exist when using the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT  distance, which assumes data are isotropic, or when using the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT  norm.  We extensively assess our proposed defenses against both the proposed attacks and other existing poisoning attacks against RAG  [ 15 ] . We observed consistent, near-perfect detection rates across all attacks.",
            "How robust is the attack against paraphrasing?   There is one potential limitation regarding the above proposed attack through concatenation. For certain use cases in practice, the attacker may not know the exact queries. As a result, there could be no precise match between the queries used for retrieval and the queries used for creating poisoned documents. In the following, we demonstrate that the proposed attack is robust under such a mismatch. We maintain the same setup except that the queries are now rephrased by GPT-4  [ 2 ]  to reflect the scenarios. We summarize the results in Table  2  below. We observed that the proposed attack remains effective under query paraphrasing, achieving a top- 2 2 2 2  retrieval success rate of  0.8 0.8 0.8 0.8  over most cases. These findings highlight even more pronounced security risks for retrieval in medical Q&A, as the attacker now only needs to know queries up to rephrasing in order to launch targeted attacks.",
            "Due to the high-dimensional nature of the embeddings, calculating the Mahalanobis distance can be challenging. This is because the sample covariance matrix ensued can be numerically unstable in large data dimensions  [ 40 ,  41 ] , leading to an ill-conditioned matrix that is difficult to invert  [ 42 ] . To address this issue, we consider regularizing the sample covariance matrix through shrinkage techniques  [ 43 ,  44 ] .  In detail, we conduct shrinkage by shifting each eigenvalue by a certain amount, which in practice leads to the following,   s  ( X )  ( X   )      1  ( X   ) ,  s X superscript X  top superscript subscript   1 X  s(X)\\triangleq(X-\\mu)^{\\top}\\Sigma_{\\beta}^{-1}(X-\\mu), italic_s ( italic_X )  ( italic_X - italic_ ) start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT roman_ start_POSTSUBSCRIPT italic_ end_POSTSUBSCRIPT start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( italic_X - italic_ ) ,   where    \\mu italic_  is the mean of  { f  ( a i ) } i = 1 | A | superscript subscript f subscript a i i 1 A \\{f(a_{i})\\}_{i=1}^{|\\mathcal{A}|} { italic_f ( italic_a start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ) } start_POSTSUBSCRIPT italic_i = 1 end_POSTSUBSCRIPT start_POSTSUPERSCRIPT | caligraphic_A | end_POSTSUPERSCRIPT , with  a i  A subscript a i A a_{i}\\in\\mathcal{A} italic_a start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  caligraphic_A , ( A A A italic_A  is the anchor set defined earlier in this section) and      ( 1   )  S + d  1    Tr  ( S )  I d ,  subscript   1  S superscript d 1  Tr S subscript I d \\Sigma_{\\beta}\\triangleq(1-\\beta)S+d^{-1}\\beta{\\rm Tr}(S)I_{d}, roman_ start_POSTSUBSCRIPT italic_ end_POSTSUBSCRIPT  ( 1 - italic_ ) italic_S + italic_d start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT italic_ roman_Tr ( italic_S ) italic_I start_POSTSUBSCRIPT italic_d end_POSTSUBSCRIPT ,   with  S S S italic_S  being the sample covariance of  { f  ( a i ) } i = 1 | A | superscript subscript f subscript a i i 1 A \\{f(a_{i})\\}_{i=1}^{|\\mathcal{A}|} { italic_f ( italic_a start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ) } start_POSTSUBSCRIPT italic_i = 1 end_POSTSUBSCRIPT start_POSTSUPERSCRIPT | caligraphic_A | end_POSTSUPERSCRIPT ,  Tr  (  ) Tr  {\\rm Tr}(\\cdot) roman_Tr (  )  is the trace operator, and    ( 0 , 1 )  0 1 \\beta\\in(0,1) italic_  ( 0 , 1 )  is the shrinkage level. We select    \\beta italic_  by cross-validation, with an ablation study in Appendix  C.2 ."
        ]
    },
    "id_table_3": {
        "caption": "Table 3:  Verification for the orthogonal augmentation property. We collected a set of documents from the MedQA denoted as  Q = { q 1 , ... , q n } Q subscript q 1 ... subscript q n Q=\\{q_{1},\\ldots,q_{n}\\} italic_Q = { italic_q start_POSTSUBSCRIPT 1 end_POSTSUBSCRIPT , ... , italic_q start_POSTSUBSCRIPT italic_n end_POSTSUBSCRIPT } , and selected several other sets of documents  P i = { p i  1 , ... , p i  n } subscript P i subscript p i 1 ... subscript p i n P_{i}=\\{p_{i1},\\ldots,p_{in}\\} italic_P start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT = { italic_p start_POSTSUBSCRIPT italic_i 1 end_POSTSUBSCRIPT , ... , italic_p start_POSTSUBSCRIPT italic_i italic_n end_POSTSUBSCRIPT }  ( i = 1 , 2 , 3 i 1 2 3 i=1,2,3 italic_i = 1 , 2 , 3 ) with varying lengths and similarities to  Q Q Q italic_Q . We report a total of four similarity measurements, and for each measurement, we report both the mean and the variance.  We observed that as two documents  p p p italic_p  and  q q q italic_q  become more orthogonal, namely with a smaller  f  ( q ) T  f  ( p ) f superscript q T f p f(q)^{\\mathrm{\\scriptscriptstyle T}}f(p) italic_f ( italic_q ) start_POSTSUPERSCRIPT roman_T end_POSTSUPERSCRIPT italic_f ( italic_p ) , the change  f  ( [ q  p ] )  f  ( q ) f delimited-[] direct-sum q p f q f([q\\oplus p])-f(q) italic_f ( [ italic_q  italic_p ] ) - italic_f ( italic_q )  (both in angle, denoted by    (  ,  )    \\angle(\\cdot,\\cdot)  (  ,  ) , and inner product) tends to be more perpendicular to  f  ( q ) f q f(q) italic_f ( italic_q ) , thus corroborating the orthogonal augmentation property.",
        "table": "S4.T3.55.35",
        "footnotes": [],
        "references": [
            "We verified the  orthogonal augmentation  property for several state-of-the-art retrievers in Table  3 . In particular, we first collected a set of documents from the MedQA denoted as  Q = { q 1 , ... , q n } Q subscript q 1 ... subscript q n Q=\\{q_{1},\\ldots,q_{n}\\} italic_Q = { italic_q start_POSTSUBSCRIPT 1 end_POSTSUBSCRIPT , ... , italic_q start_POSTSUBSCRIPT italic_n end_POSTSUBSCRIPT } . Next, we selected several other sets of documents  P i = { p i  1 , ... , p i  n } subscript P i subscript p i 1 ... subscript p i n P_{i}=\\{p_{i1},\\ldots,p_{in}\\} italic_P start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT = { italic_p start_POSTSUBSCRIPT italic_i 1 end_POSTSUBSCRIPT , ... , italic_p start_POSTSUBSCRIPT italic_i italic_n end_POSTSUBSCRIPT }  with varying lengths and similarities to  Q Q Q italic_Q . We report a total of four similarity measurements and for each measurement, we report both the mean and the variance.  We observed that when the inner product between the embeddings of the two documents  f  ( q )   f  ( p ) f superscript q top f p f(q)^{\\top}f(p) italic_f ( italic_q ) start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT italic_f ( italic_p )  decreases, the angle between  f  ( [ q  p ] ) f delimited-[] direct-sum q p f([q\\oplus p]) italic_f ( [ italic_q  italic_p ] )  and  f  ( q ) f q f(q) italic_f ( italic_q )  tends to be around  90  superscript 90 90^{\\circ} 90 start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT , and the inner product also decreases, which corroborates the  orthogonal augmentation  property. Additionally, we observe that Contriever is sensitive to the length of the document; that is, the longer the document, the larger the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm of its embeddings, whereas such a phenomenon is not observed for MedCPT.",
            "We tested the proposed method for filtering out the poisoned documents over the previous setups. The threshold for filtering is set at the  95 95 95 95 th quantile of the  { s  ( f  ( a i ) ) } i = 1 | A | . superscript subscript s f subscript a i i 1 A \\{s(f(a_{i}))\\}_{i=1}^{|\\mathcal{A}|}. { italic_s ( italic_f ( italic_a start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ) ) } start_POSTSUBSCRIPT italic_i = 1 end_POSTSUBSCRIPT start_POSTSUPERSCRIPT | caligraphic_A | end_POSTSUPERSCRIPT .   We present some case studies in Figure  3  below. The  complete results  are included in Figure  4  and Figure  5  for PubMed (in the appendix), Figure  6  and Figure  7  for StatPearl (in the appendix), and Figure  9  and Figure  8  for Textbook (in the appendix). We observed that, in almost all cases, the proposed method achieves near-perfect detection. Additionally, we observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm defense is effective when using the Contriever. One potential reason may be that it is sensitive to the total length of the documents. Furthermore, we applied our proposed method to one of the state-of-the-art poisoning attacks  [ 15 ]  and obtained a filtering rate greater than 95%, indicating the wide applicability of our proposed defense."
        ]
    },
    "id_table_4": {
        "caption": "Table 4:  Evidence on the low similarity of the (clean) retrieved documents. For each query  q q q italic_q  sampled from the query set, we calculate its similarity, both in angle (denoted by    (  ,  )    \\angle(\\cdot,\\cdot)  (  ,  ) ) and inner product, with the  K = 5 K 5 K=5 italic_K = 5 -nearest neighbor retrieved documents from the corpus Textbook, denoted as  R R R italic_R , and then report the mean and standard deviation. We observed that both the inner product and the cosine similarity are low across all query sets, indicating the low quality of the retrieved documents.",
        "table": "S4.T4.44.36",
        "footnotes": [],
        "references": [
            "Regarding the  orthogonal augmentation  property,  we highlight that documents which have near-orthogonal embeddings can still be semantically relevant (see Section  4 ). This ensures that the universal poisoning attacks could succeed even if the attacker-specified targeted information is semantically related to the query.  In addition, in the previous case of medical Q&A, we empirically observed that retrieved documents are often not close, in terms of commonly used similarity measurements such as inner product, to their associated queries (see Table  4 ). This results in a consistently higher similarity between queries and poisoned documents compared to their clean counterparts, partially explaining the widespread effectiveness of our studied universal poisoning attacks.",
            "We present the similarity measurements between the query and the clean retrieved documents (from the corpus Textbook) in Table  4  for Contriever and MedCPT, respectively. For each query, we calculate its similarity, both the cosine similarity and the inner product, with the  K = 5 K 5 K=5 italic_K = 5 -nearest neighbor retrieved documents from the corpus Textbook, and report the mean and standard deviation. Additionally, we also report the value of the inner product between a query and itself for the purpose of comparison. We observed that both the inner product and the cosine similarity are low across all query sets. For instance, an average angle of around  70  superscript 70 70^{\\circ} 70 start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  between the query and retrieved documents is observed across all query sets for the Contriever, and the inner product between the query and retrieved documents is less than  25 % percent 25 25\\% 25 %  of that between the query and itself. These results indicate that the retrieved documents are  not  as close to their queries as one might expect.  In conclusion, these findings highlight a gap between the query and its clean retrieved documents. This disparity leaves room for exploitation by various adversarial attacks, including our proposed universal poisoning attacks, posing considerable safety risks.",
            "We tested the proposed method for filtering out the poisoned documents over the previous setups. The threshold for filtering is set at the  95 95 95 95 th quantile of the  { s  ( f  ( a i ) ) } i = 1 | A | . superscript subscript s f subscript a i i 1 A \\{s(f(a_{i}))\\}_{i=1}^{|\\mathcal{A}|}. { italic_s ( italic_f ( italic_a start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ) ) } start_POSTSUBSCRIPT italic_i = 1 end_POSTSUBSCRIPT start_POSTSUPERSCRIPT | caligraphic_A | end_POSTSUPERSCRIPT .   We present some case studies in Figure  3  below. The  complete results  are included in Figure  4  and Figure  5  for PubMed (in the appendix), Figure  6  and Figure  7  for StatPearl (in the appendix), and Figure  9  and Figure  8  for Textbook (in the appendix). We observed that, in almost all cases, the proposed method achieves near-perfect detection. Additionally, we observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm defense is effective when using the Contriever. One potential reason may be that it is sensitive to the total length of the documents. Furthermore, we applied our proposed method to one of the state-of-the-art poisoning attacks  [ 15 ]  and obtained a filtering rate greater than 95%, indicating the wide applicability of our proposed defense.",
            "Detection Results   We test the proposed detection method over the previously mentioned  225 225 225 225  attacks cases and present  results of them in Figure  4  and Figure  5  for PubMed, Figure  6  and Figure  7  for StatPearl, and Figure  9  and Figure  8  for Textbook. In each plot, we show the results of detecting poisoned documents created using three different kinds of targeted information. (The cases for the other two types of targeted information are similar.) We observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm fails to detect those poisoned documents, with a detection rate of less than 50% in all cases. However, our method achieves a consistently high detection rate of over 98%, indicating the widespread effectiveness of our proposed method."
        ]
    },
    "id_table_5": {
        "caption": "Table 5:  Statistics of corpora used in our experiments. No. Doc.: numbers of raw documents; No. Snippets: numbers of snippets; Avg. L: average length of snippets.",
        "table": "A1.T5.3",
        "footnotes": [],
        "references": [
            "We tested the proposed method for filtering out the poisoned documents over the previous setups. The threshold for filtering is set at the  95 95 95 95 th quantile of the  { s  ( f  ( a i ) ) } i = 1 | A | . superscript subscript s f subscript a i i 1 A \\{s(f(a_{i}))\\}_{i=1}^{|\\mathcal{A}|}. { italic_s ( italic_f ( italic_a start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ) ) } start_POSTSUBSCRIPT italic_i = 1 end_POSTSUBSCRIPT start_POSTSUPERSCRIPT | caligraphic_A | end_POSTSUPERSCRIPT .   We present some case studies in Figure  3  below. The  complete results  are included in Figure  4  and Figure  5  for PubMed (in the appendix), Figure  6  and Figure  7  for StatPearl (in the appendix), and Figure  9  and Figure  8  for Textbook (in the appendix). We observed that, in almost all cases, the proposed method achieves near-perfect detection. Additionally, we observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm defense is effective when using the Contriever. One potential reason may be that it is sensitive to the total length of the documents. Furthermore, we applied our proposed method to one of the state-of-the-art poisoning attacks  [ 15 ]  and obtained a filtering rate greater than 95%, indicating the wide applicability of our proposed defense.",
            "Following  [ 14 ] , we provide the statistics of used corpora in Table  5  below. We note that due to limited computational resources, we use a randomly sampled subset of PubMed with around 2 million documents. For the other two datasets, we use the complete versions.",
            "Detection Results   We test the proposed detection method over the previously mentioned  225 225 225 225  attacks cases and present  results of them in Figure  4  and Figure  5  for PubMed, Figure  6  and Figure  7  for StatPearl, and Figure  9  and Figure  8  for Textbook. In each plot, we show the results of detecting poisoned documents created using three different kinds of targeted information. (The cases for the other two types of targeted information are similar.) We observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm fails to detect those poisoned documents, with a detection rate of less than 50% in all cases. However, our method achieves a consistently high detection rate of over 98%, indicating the widespread effectiveness of our proposed method."
        ]
    },
    "id_table_6": {
        "caption": "Table 6:  Statistics of query datasets used in our experiments. No. O.: numbers of options; Avg. L: average token counts in each question.",
        "table": "A1.T6.3",
        "footnotes": [],
        "references": [
            "We tested the proposed method for filtering out the poisoned documents over the previous setups. The threshold for filtering is set at the  95 95 95 95 th quantile of the  { s  ( f  ( a i ) ) } i = 1 | A | . superscript subscript s f subscript a i i 1 A \\{s(f(a_{i}))\\}_{i=1}^{|\\mathcal{A}|}. { italic_s ( italic_f ( italic_a start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ) ) } start_POSTSUBSCRIPT italic_i = 1 end_POSTSUBSCRIPT start_POSTSUPERSCRIPT | caligraphic_A | end_POSTSUPERSCRIPT .   We present some case studies in Figure  3  below. The  complete results  are included in Figure  4  and Figure  5  for PubMed (in the appendix), Figure  6  and Figure  7  for StatPearl (in the appendix), and Figure  9  and Figure  8  for Textbook (in the appendix). We observed that, in almost all cases, the proposed method achieves near-perfect detection. Additionally, we observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm defense is effective when using the Contriever. One potential reason may be that it is sensitive to the total length of the documents. Furthermore, we applied our proposed method to one of the state-of-the-art poisoning attacks  [ 15 ]  and obtained a filtering rate greater than 95%, indicating the wide applicability of our proposed defense.",
            "Following  [ 14 ] , we provide the statistics of used query in Table  6  below. We also provide some examples of these quetions in the following.",
            "Detection Results   We test the proposed detection method over the previously mentioned  225 225 225 225  attacks cases and present  results of them in Figure  4  and Figure  5  for PubMed, Figure  6  and Figure  7  for StatPearl, and Figure  9  and Figure  8  for Textbook. In each plot, we show the results of detecting poisoned documents created using three different kinds of targeted information. (The cases for the other two types of targeted information are similar.) We observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm fails to detect those poisoned documents, with a detection rate of less than 50% in all cases. However, our method achieves a consistently high detection rate of over 98%, indicating the widespread effectiveness of our proposed method."
        ]
    },
    "id_table_7": {
        "caption": "Table 7:  Top  1 1 1 1  retrieval success rates over 3 corpora, 3 retrievers, 5 query sets, and 5 sets of targeted information. The interpretation of results in each cell adheres the following rule. We use the top-left cell as an example: it represents a success rate of  0.78 0.78 0.78 0.78  achieved using the Corpus: Textbook, Retriever: MedCPT, Query set: MMLU-Med, with PPI as the targeted information.",
        "table": "A3.T7.229.225.225",
        "footnotes": [],
        "references": [
            "Evaluation Metric  Consider a pair consisting of a normal query  q i subscript q i q_{i} italic_q start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  and target information  T T T italic_T . This pair is deemed successful if the corresponding poisoned document  p i = [ q i  T ] subscript p i delimited-[] direct-sum subscript q i T p_{i}=[q_{i}\\oplus T] italic_p start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT = [ italic_q start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  italic_T ]  is among the top  K K K italic_K  ( K  1 K 1 K\\geq 1 italic_K  1 ) document(s) retrieved by  q i subscript q i q_{i} italic_q start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT . For the results presented in the main text, we set  K = 2 K 2 K=2 italic_K = 2 , and ablation studies on different choices of  K K K italic_K  are provided in Table  7  in appendix.",
            "We tested the proposed method for filtering out the poisoned documents over the previous setups. The threshold for filtering is set at the  95 95 95 95 th quantile of the  { s  ( f  ( a i ) ) } i = 1 | A | . superscript subscript s f subscript a i i 1 A \\{s(f(a_{i}))\\}_{i=1}^{|\\mathcal{A}|}. { italic_s ( italic_f ( italic_a start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ) ) } start_POSTSUBSCRIPT italic_i = 1 end_POSTSUBSCRIPT start_POSTSUPERSCRIPT | caligraphic_A | end_POSTSUPERSCRIPT .   We present some case studies in Figure  3  below. The  complete results  are included in Figure  4  and Figure  5  for PubMed (in the appendix), Figure  6  and Figure  7  for StatPearl (in the appendix), and Figure  9  and Figure  8  for Textbook (in the appendix). We observed that, in almost all cases, the proposed method achieves near-perfect detection. Additionally, we observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm defense is effective when using the Contriever. One potential reason may be that it is sensitive to the total length of the documents. Furthermore, we applied our proposed method to one of the state-of-the-art poisoning attacks  [ 15 ]  and obtained a filtering rate greater than 95%, indicating the wide applicability of our proposed defense.",
            "Detection Results   We test the proposed detection method over the previously mentioned  225 225 225 225  attacks cases and present  results of them in Figure  4  and Figure  5  for PubMed, Figure  6  and Figure  7  for StatPearl, and Figure  9  and Figure  8  for Textbook. In each plot, we show the results of detecting poisoned documents created using three different kinds of targeted information. (The cases for the other two types of targeted information are similar.) We observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm fails to detect those poisoned documents, with a detection rate of less than 50% in all cases. However, our method achieves a consistently high detection rate of over 98%, indicating the widespread effectiveness of our proposed method.",
            "We report the top 1 attack retrieval success rates in Table  7 , with standard deviations less than  0.1 0.1 0.1 0.1 . Overall, the success rates only slightly decrease compared to the top  2 2 2 2  results presented in the paper, which is reasonable. These findings highlight that medical Q&A is extremely vulnerable to poisoning attacks and thus requires robust defense mechanisms."
        ]
    },
    "id_table_8": {
        "caption": "Table 8:  Detection performance on different choices of    \\beta italic_ .",
        "table": "A3.T8.44.42",
        "footnotes": [],
        "references": [
            "We tested the proposed method for filtering out the poisoned documents over the previous setups. The threshold for filtering is set at the  95 95 95 95 th quantile of the  { s  ( f  ( a i ) ) } i = 1 | A | . superscript subscript s f subscript a i i 1 A \\{s(f(a_{i}))\\}_{i=1}^{|\\mathcal{A}|}. { italic_s ( italic_f ( italic_a start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ) ) } start_POSTSUBSCRIPT italic_i = 1 end_POSTSUBSCRIPT start_POSTSUPERSCRIPT | caligraphic_A | end_POSTSUPERSCRIPT .   We present some case studies in Figure  3  below. The  complete results  are included in Figure  4  and Figure  5  for PubMed (in the appendix), Figure  6  and Figure  7  for StatPearl (in the appendix), and Figure  9  and Figure  8  for Textbook (in the appendix). We observed that, in almost all cases, the proposed method achieves near-perfect detection. Additionally, we observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm defense is effective when using the Contriever. One potential reason may be that it is sensitive to the total length of the documents. Furthermore, we applied our proposed method to one of the state-of-the-art poisoning attacks  [ 15 ]  and obtained a filtering rate greater than 95%, indicating the wide applicability of our proposed defense.",
            "Detection Results   We test the proposed detection method over the previously mentioned  225 225 225 225  attacks cases and present  results of them in Figure  4  and Figure  5  for PubMed, Figure  6  and Figure  7  for StatPearl, and Figure  9  and Figure  8  for Textbook. In each plot, we show the results of detecting poisoned documents created using three different kinds of targeted information. (The cases for the other two types of targeted information are similar.) We observed that the  l 2 subscript l 2 \\ell_{2} roman_l start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT -norm fails to detect those poisoned documents, with a detection rate of less than 50% in all cases. However, our method achieves a consistently high detection rate of over 98%, indicating the widespread effectiveness of our proposed method.",
            "In this section, we provide an ablation study on the choices of    \\beta italic_  used in calculating the proposed distances. We summarize the results in Table  8  below, with standard errors within 0.08. We observed that as    \\beta italic_  increases, the detection rate begins to decrease. This is reasonable since the covariance tends to shrink towards an identity matrix and hence loses the ability to capture the datas distribution. In practice, we suggest the defender employ cross-validation-based techniques to select the optimal    \\beta italic_  for detection."
        ]
    },
    "global_footnotes": []
}