{
    "id_table_1": {
        "caption": "Table 1 :  Accuracy (%) with respect to various LLMs, where #Q and #CA denote the numbers of questions and correct answers, respectively.",
        "table": "S3.T1.5",
        "footnotes": [],
        "references": [
            "This study utilizes a framework integrating Blooms Taxonomy and Retrieval-Augmented Generation (RAG) technology to comprehensively evaluate how well LLMs understand and apply Hakka cultural knowledge (see Fig.  1 ).",
            "This study conducted a thorough performance analysis of the selected LLMs, focusing on their understanding and application of Hakka cultural knowledge, especially when integrated with RAG. A quantitative approach was employed, using automated scoring against standard answers for the multiple-choice questions to assess model accuracy. This method allowed for a precise evaluation of how well each LLM comprehended and responded to the Hakka cultural knowledge questions. The analysis results, presented as comparative performance metrics across the cognitive domains defined by Blooms Taxonomy, are available in Table  1 . This comparative analysis provides insights into the strengths and weaknesses of each LLM and the impact of RAG technology on their performance in understanding and applying Hakka cultural knowledge.",
            "Table  1  offers a comparative overview of GPT-4o, Claude 3.5 Sonnet, LLaMA 3.1, and Gemini 1.5 Pros performance across the six cognitive domains. The results reveal distinct strengths and weaknesses in handling Hakka cultural knowledge. LLaMA 3.1 with RAG consistently outperforms other models across all domains, particularly excelling in tasks demanding higher-order cognitive skills. For instance, in the Remembering domain, it achieved 91.08% accuracy, significantly surpassing others. Similarly, it led in Understanding with 94.57% accuracy, indicating a strong grasp of cultural concepts. This trend continues in Applying, where LLaMA 3.1 with RAG achieved 91.08% accuracy, showcasing its proficiency in practical application of knowledge. In more complex domains like Analyzing, Evaluating, and Creating, LLaMA 3.1 with RAG maintained its lead, demonstrating the effectiveness of RAG in enhancing accuracy and effectiveness for tasks requiring higher-order cognitive skills."
        ]
    },
    "global_footnotes": []
}