{
    "id_table_1": {
        "caption": "Table 1:  Stratification of Common Datasets Providing Facts",
        "table": "S2.T1.1",
        "footnotes": [],
        "references": [
            "Yet, research efforts and existing relevant surveys  [ 6 ,  7 ,  8 ,  9 ,  10 ,  11 ,  12 ,  13 ]  frequently focus on only one of these levels or a particular topic of technologies. This has motivated us to compile this comprehensive survey, which aims to clearly define these different levels of queries, identify the unique challenges associated with each(Figure  1 ) , and list related works and efforts addressing them. This survey is intended to help readers construct a birds-eye view of data augmented LLM applications and also serve as a handbook on how to approach the development of such applications systematically.",
            "In summary, the classification of queries into levels reflects a gradient of complexity and the type of understanding required from the LLM. As shown in Figure  1  and exampled by Figure  2 , the first two levels,  Explicit Facts  and  Implicit Facts , focus on the retrieval of factual information, whether directly stated or requiring basic inferencing. These levels challenge the LLMs ability to extract and synthesize data into coherent facts.  Conversely, the latter two levels,  Interpretable Rationales  and  Hidden Rationales , shift the focus towards the LLMs capacity to learn and apply the rationales behind the data. These levels demand a deeper cognitive engagement, where the LLM must align with expert thinking or extract wisdom from unstructured historical data, respectively. The classification of common factual querying datasets according to this standard is depicted in Table   1 ."
        ]
    },
    "global_footnotes": [
        "In some most recent advancements, the segment size may be as large as a whole document or even larger",
        "The power set (or powerset) of a set",
        "is the set of all subsets of",
        ", including the empty set and",
        "itself."
    ]
}