{
    "id_table_1": {
        "caption": "Table 1.  The statistics of datasets used in our method.",
        "table": "S4.T1.1.1",
        "footnotes": [],
        "references": [
            "To address the above issues, we propose a doctor-patient-family interactive depression assessment system empowered by LLMs, InterMind, as shown in Figure  1 .  This system utilizes the proposed AI Psychological Chatbot and AI Psychologist to bridge interactions among doctors, patients, and families.  First, the AI Psychological Chatbot engages with patients in daily conversations, allowing them to describe their experiences and feelings while providing a degree of psychological support during the interaction. The system also enables the AI Psychological Chatbot to concurrently converse with the patients family members, who can describe the patients recent condition, such as mood swings or insomnia. By combining dialogues from patients and families, the system helps doctors gain a clearer and more comprehensive understanding of the patients actual state, reducing the risk of inaccuracies or intentional omissions in the patients self-reporting.  Subsequently, the AI Psychologist is designed to analyze the collected multi-turn dialogues and generate a standardized assistive diagnostic report, which includes the degree of depression, observed symptoms, and relevant diagnostic criteria, rather than simply providing a classification/regression result. Thus, the report offers insights to support the doctor in the diagnostic process and improve diagnostic efficiency.  Additionally, the AI Psychologist provides personalized treatment strategy and care advice for both the patient and their family, aiding in better caregiving and treatment. It can also periodically assess the patients depression status based on these reports, ensuring continuous monitoring and support.  Whats more, our system allows doctors to intervene in the LLM-generated content and enables patients and families to provide feedback on treatment effects, ensuring the accuracy of the assessment and helping doctors adjust treatment strategies timely.",
            "As shown in Figure  2 (a-c), we designed a collapsible menu in the upper left corner of the webpage. Upon logging in, the patient is firstly directed to a chat interface (Figure  2 (a)) where they can begin interacting with the AI psychological chatbot within the InterMind system. During the conversation, the patient describes his/her recent experiences and feelings, while the AI chatbot provides psychological support. After the chat concludes, the dialogue content is forwarded to the systems AI psychologist to generate an assistive diagnostic report. Once the doctor reviews and revises the report, the patient can view the diagnostic results (Figure  2 (b)) by selecting the corresponding option in the menu. Additionally, the AI psychologist suggests a treatment strategy tailored to the patient, which, after being revised by the doctor, appears below the diagnostic report (Figure  2 (c)). Finally, by selecting the last option in the menu, the patient can view the trends in their mental state over time, along with analysis provided by the AI psychologist (see section  3.1.4 ).",
            "In this work, we utilize three datasets to evaluate our method: MMDA dataset  (Jiang et al . ,  2022 ) , DR dataset  (Pirina and Coltekin,  2018 ) , and DepSeverity dataset  (Naseem et al . ,  2022 ) . The statistics of datasets used in our method are shown in Table  1 .",
            "As for subjective evaluation, we will introduce the subjective evaluation settings and metrics specifically in Sections  4.5.1  and  4.6 .",
            "The average scores from volunteers are shown in Figure  10 , where it can be seen that our approach demonstrates a noticeable advantage in consistency. This is because GPT-4 tends to respond with more formal and extensive content, which is less suitable for casual conversation scenarios compared to our model. In terms of ability, both our method and GPT-4 perform similarly, with scores exceeding 4, indicating that both models can provide psychological support in counseling, encouraging users to share their feelings. For engagement, our model achieves higher scores, suggesting that it fosters a stronger willingness in users to engage in conversation. Finally, our method outperforms GPT-4 in terms of the overall evaluation.",
            "Here we present the usage of the InterMind system interface in different language versions (English and Chinese). Figure  11 ,  12  and  13  show a comparison of different language versions of the user interfaces for patient, family, and doctor, respectively. Figure  14  shows a comparison of different language versions of the cyclical analysis interface.  Figure  15  and  16  show the entire generated assistive diagnostic report."
        ]
    },
    "id_table_2": {
        "caption": "Table 2.  Depression Binary Classification Results",
        "table": "S4.T2.1.1",
        "footnotes": [],
        "references": [
            "We designed three distinct user interfaces for doctors, patients, and families to facilitate their interaction with the InterMind system. The interfaces for patients and families (Figure  2 ) are on mobile platforms, allowing them to access the system conveniently at home or other places at any time. In contrast, the interface for doctors (Figure  3 ) is web-based, considering that their daily work primarily takes place in hospitals where desktop computers are more suitable for viewing the comprehensive information provided by the InterMind system. In the following subsection, we will introduce each interface in detail.",
            "As shown in Figure  2 (a-c), we designed a collapsible menu in the upper left corner of the webpage. Upon logging in, the patient is firstly directed to a chat interface (Figure  2 (a)) where they can begin interacting with the AI psychological chatbot within the InterMind system. During the conversation, the patient describes his/her recent experiences and feelings, while the AI chatbot provides psychological support. After the chat concludes, the dialogue content is forwarded to the systems AI psychologist to generate an assistive diagnostic report. Once the doctor reviews and revises the report, the patient can view the diagnostic results (Figure  2 (b)) by selecting the corresponding option in the menu. Additionally, the AI psychologist suggests a treatment strategy tailored to the patient, which, after being revised by the doctor, appears below the diagnostic report (Figure  2 (c)). Finally, by selecting the last option in the menu, the patient can view the trends in their mental state over time, along with analysis provided by the AI psychologist (see section  3.1.4 ).",
            "As shown in Figure  2 (d-f), the design of the family interface is consistent with that of the patient interface. Family can engage in a conversation with the AI psychological chatbot to describe the patients recent objective conditions and symptoms (Figure  2 (d)). After the conversation concludes, the content is also forwarded to the AI psychologist. Additionally, the family can view the patients diagnostic results in the report section (Figure  2 (e)) and find care advice (Figure  2 (f)) generated by the AI psychologist specifically for family, aimed at improving caregiving and supporting treatment. Notably, to protect user privacy, dialogues of family and patient are not shared with each other. Lastly, the family interface also includes periodic monitoring and analysis, where trends in the patients mental state over time and corresponding analysis by the AI psychologist are displayed.",
            "Similar to the cross-entropy loss  l 1 subscript l 1 \\ell_{1} roman_l start_POSTSUBSCRIPT 1 end_POSTSUBSCRIPT  in subsection  3.2 , the assistive diagnosis report generation task can be written as:",
            "As shown in Table  2 , we compare the binary classification results of assistive diagnostic reports generated by the proposed AI Psychologist with those of five representative models showing strong ability in Chinese. We implemented the binary classification task on these five models in the three datasets. We instructed ChatGLM3-6B  (GLM et al . ,  2024 ) , Llama2-Chinese-7B  2 2 2 https://github.com/LlamaFamily/Llama-Chinese (Touvron et al . ,  2023 ) , and Baichuan2-7B  (Yang et al . ,  2023 )  to provide only the classification result, determining whether the user in the dialogue is depressed. GPT-4 can generate assistive diagnostic reports consistent with our report generation task through a format-controlling function. ChineseMentalBert  3 3 3 https://github.com/zwzzzQAQ/Chinese-MentalBERT (Ji et al . ,  2022 )  is a supervised model known for its strong performance in Chinese mental health tasks, so we fine-tuned and tested it on our dataset to obtain results.",
            "From Table  2 , we can see that the depression binary classification performance of our model is improved significantly compared to Baichuan2-7b across three datasets (F1 0.772 vs. 0.694 on the MMDA dataset, F1 0.890 vs. 0.827 on the DR dataset, and F1 0.590 vs. 0.571 on the DepSeverity dataset), resulting in 11.24%, 7.62%, and 3.33% improvements, respectively. This validates that our fine-tuning task can effectively improve the F1-score of the backbone model in depression binary classification within our generated report.  Compared to ChatGLM3-6B and Llama2-Chinese-7B, our method stands out with significantly better performance. GPT-4 does not perform well in the depression binary classification task. The reason is that GPT-4 tends to be conservative in diagnosing depression, avoiding predicting a subject as depressed without strong evidence. This results in relatively high PRE but low REC, ultimately leading to lower F1 scores.  Supervised models like ChineseMentalBert perform notably well in depression binary classification, achieving the second-best results in many cases. However, supervised models are limited by the need to model specific tasks, and their predictions often lack interpretability.  Our method, by generating assistive diagnostic reports, not only achieves the best binary classification results but also provides additional information such as symptoms and diagnostic criteria (see examples of generated assistive diagnostic reports in Appendix  A )  , offering doctors more than just a conclusion for their final diagnosis.",
            "However, we also find that in the binary classification of depression, the comparison results between our method and GPT-4 are the opposite of those in Table  2 . The phenomenon can be attributed to the coincident tendency of psychiatrists and GPT-4, that is, they are prone to considering subjects as non-depressed, whose ground truth in the datasets is mild. Specifically, for psychiatrists, binary classification is a conclusive judgment about the subject. When a dialogue is a mild depression, especially when the patients score on the questionnaire is on the borderline of depression, psychiatrists are usually hesitant to label this subject as depressed. GPT-4 is consistent with this hesitancy, leading to higher scores in binary classification evaluated by psychiatrists, which also affects the scores in category classification, such as determining whether a patient has a specific depression subtype or is normal.  On the contrary, our methods binary classification results maintain a higher consistency with the datasets ground truth, that is, considering HAMD scores of 7 or higher as depression.  This conclusion is also supported by the fact that our method provides a comparable or better estimation of the severity degree.",
            "Here we present the usage of the InterMind system interface in different language versions (English and Chinese). Figure  11 ,  12  and  13  show a comparison of different language versions of the user interfaces for patient, family, and doctor, respectively. Figure  14  shows a comparison of different language versions of the cyclical analysis interface.  Figure  15  and  16  show the entire generated assistive diagnostic report."
        ]
    },
    "id_table_3": {
        "caption": "Table 3.  Depression Severity Degree Estimation Results on MMDA dataset",
        "table": "S4.T3.1.1",
        "footnotes": [],
        "references": [
            "We designed three distinct user interfaces for doctors, patients, and families to facilitate their interaction with the InterMind system. The interfaces for patients and families (Figure  2 ) are on mobile platforms, allowing them to access the system conveniently at home or other places at any time. In contrast, the interface for doctors (Figure  3 ) is web-based, considering that their daily work primarily takes place in hospitals where desktop computers are more suitable for viewing the comprehensive information provided by the InterMind system. In the following subsection, we will introduce each interface in detail.",
            "As shown in Figure  2 (a-c), we designed a collapsible menu in the upper left corner of the webpage. Upon logging in, the patient is firstly directed to a chat interface (Figure  2 (a)) where they can begin interacting with the AI psychological chatbot within the InterMind system. During the conversation, the patient describes his/her recent experiences and feelings, while the AI chatbot provides psychological support. After the chat concludes, the dialogue content is forwarded to the systems AI psychologist to generate an assistive diagnostic report. Once the doctor reviews and revises the report, the patient can view the diagnostic results (Figure  2 (b)) by selecting the corresponding option in the menu. Additionally, the AI psychologist suggests a treatment strategy tailored to the patient, which, after being revised by the doctor, appears below the diagnostic report (Figure  2 (c)). Finally, by selecting the last option in the menu, the patient can view the trends in their mental state over time, along with analysis provided by the AI psychologist (see section  3.1.4 ).",
            "As shown in Figure  3 , at the top of the doctor interface, we designed a patient management menu that displays all patients who want to consult the doctor. Each patients summary includes their most recent login time and the latest depression status predicted by the AI psychologist. Upon selecting a patient, the doctor interface displays a timeline on the left side, showing different interaction periods for the selected patient. When a specific time point is chosen, the interface presents the patients and familys dialogue history with the AI psychological chatbot, the assistive diagnostic report generated by the AI psychologist, the treatment strategy for the patient, and the care advice for the family. By comparing the dialogue content of the patient and family, and referencing the report and advice, the doctor can make a few revisions before releasing the information to the patient and family, thus improving diagnostic efficiency. Additionally, the doctor can access periodic monitoring and analysis via a button in the lower left corner.",
            "Similar to the cross-entropy loss  l 1 subscript l 1 \\ell_{1} roman_l start_POSTSUBSCRIPT 1 end_POSTSUBSCRIPT  in subsection  3.2 , the assistive diagnosis report generation task can be written as:",
            "For estimation of depression severity degree in our generated reports, we instructed Chatglm3-6b, Llama2-Chinese-7b, and Baichuan2-7b to determine whether the user in the conversation belongs to the categories of normal, mild, moderate, or severe. For ChineseMentalBert, we fine-tuned it in a four-class classification setting and tested it on our datasets. Since the DR dataset does not contain fine-grained labels for different degrees of depression, we report the results of these models on the MMDA dataset and the DepSeverity dataset, as shown in Table  3  and Table  4 .",
            "Compared to binary classification, the task of depression severity degree estimation (which can be seen as a four-class classification) poses a greater challenge to the model. As shown in Table  3 , on the MMDA dataset, our instruction fine-tuning significantly enhances the models ability to estimate depression severity degree in the generated assistive diagnostic reports compared to the backbone model Baichuan2-7b, with noticeable improvements in F1 scores across different degrees (normal: 0.667 vs. 0.538, mild: 0.571 vs. 0.071, moderate: 0.727 vs. 0.250, severe: 0.667 vs. 0.000). The accuracy improves from 0.347 to 0.633, and the weighted F1 score improves from 0.247 to 0.619, demonstrating the usefulness of our method in depression severity degree estimation. Notably, in the MMDA dataset where the number of moderate or severe subjects is relatively small, models like ChatGLM3-6B, LLaMA2-Chinese-7B, and Baichuan2-7B (all 6B or 7B models) exhibit poor performance for moderate or severe subjects, or even fail. For example, their F1 scores for severe subjects are 0. This phenomenon also occurs with the supervised model ChineseMentalBert, which tends to identify subjects as normal or mild, while showing weak detection capabilities for moderate or severe subjects (with F1 scores of 0 for both moderate and severe categories). GPT-4 demonstrates superiority over other LLMs in the more challenging task of depression severity degree estimation, as it can detect moderate and severe subjects to some extent. However, the F1 scores are not high (moderate: 0.167, severe: 0.250). Our method demonstrates strong detection capabilities across different severity degrees and achieves the best results in detecting moderate and severe subjects, leading to the highest overall accuracy (ACC: 0.633) and weighted-F1 score (weighted-F1: 0.619).",
            "On the DepSeverity dataset (Table  4 ), which has a larger number of samples, our method also significantly improves the performance of Baichuan2-7B through instruction fine-tuning, as reflected in the F1 scores across different severity degrees (normal: 0.549 vs. 0.765, moderate: 0.053 vs. 0.196, severe: 0.038 vs. 0.212). The overall performance is improved by 52.2% in ACC and 40.3% in weighted F1. We can also see that ChatGLM3-6B, LLaMA2-Chinese-7B, and Baichuan2-7B perform poorly in detecting moderate or severe subjects, with low F1 scores. GPT-4 still has some ability to detect moderate or severe subjects, but its F1 scores are not high (moderate: 0.192, severe: 0.167), which is consistent with the observations in Table  3 . Since there are more moderate and severe subjects in the DepSeverity dataset, the advantage of supervised models in specific tasks appears. ChineseMentalBert achieves the best results in identifying both moderate and severe subjects, with an overall ACC of 0.627 and a Weighted-F1 score of 0.564. Our method achieves the best results among LLMs in Table  4 , with F1 scores across all four severity degrees outperforming GPT-4.",
            "The experiments in the previous section  4.3  and  4.4  evaluate the accuracy of the binary classification and depression severity estimation in the generated report, but they do not fully reflect the overall report quality. Therefore, this subsection further validates report quality, particularly the interpretable contents in reports, through subjective evaluations by psychiatrists and quantitative experiments.",
            "Here we present the usage of the InterMind system interface in different language versions (English and Chinese). Figure  11 ,  12  and  13  show a comparison of different language versions of the user interfaces for patient, family, and doctor, respectively. Figure  14  shows a comparison of different language versions of the cyclical analysis interface.  Figure  15  and  16  show the entire generated assistive diagnostic report."
        ]
    },
    "id_table_4": {
        "caption": "Table 4.  Depression Severity Degree Estimation Results on DepSeverity dataset",
        "table": "S4.T4.1.1",
        "footnotes": [],
        "references": [
            "As shown in Figure  2 (a-c), we designed a collapsible menu in the upper left corner of the webpage. Upon logging in, the patient is firstly directed to a chat interface (Figure  2 (a)) where they can begin interacting with the AI psychological chatbot within the InterMind system. During the conversation, the patient describes his/her recent experiences and feelings, while the AI chatbot provides psychological support. After the chat concludes, the dialogue content is forwarded to the systems AI psychologist to generate an assistive diagnostic report. Once the doctor reviews and revises the report, the patient can view the diagnostic results (Figure  2 (b)) by selecting the corresponding option in the menu. Additionally, the AI psychologist suggests a treatment strategy tailored to the patient, which, after being revised by the doctor, appears below the diagnostic report (Figure  2 (c)). Finally, by selecting the last option in the menu, the patient can view the trends in their mental state over time, along with analysis provided by the AI psychologist (see section  3.1.4 ).",
            "As shown in Figure  4 , the doctor, patient, and family all have access to the cyclical analysis interface. This interface provides statistical information from the past month, such as the patients login frequency and the number of dialogue turns with the AI psychological chatbot. Additionally, the interface displays distribution in the patients depression degree severity over time based on the results of each diagnostic report. Specifically, a bar chart is used to represent these changes: a score of 0 is assigned for no interaction with InterMind, 25 for normal, 50 for mild, 75 for moderate, and 100 for severe depression. An average depression score is then calculated as a reference. Finally, the LLM analyzes the patients condition over the past month based on the diagnostic reports.",
            "As for subjective evaluation, we will introduce the subjective evaluation settings and metrics specifically in Sections  4.5.1  and  4.6 .",
            "For estimation of depression severity degree in our generated reports, we instructed Chatglm3-6b, Llama2-Chinese-7b, and Baichuan2-7b to determine whether the user in the conversation belongs to the categories of normal, mild, moderate, or severe. For ChineseMentalBert, we fine-tuned it in a four-class classification setting and tested it on our datasets. Since the DR dataset does not contain fine-grained labels for different degrees of depression, we report the results of these models on the MMDA dataset and the DepSeverity dataset, as shown in Table  3  and Table  4 .",
            "On the DepSeverity dataset (Table  4 ), which has a larger number of samples, our method also significantly improves the performance of Baichuan2-7B through instruction fine-tuning, as reflected in the F1 scores across different severity degrees (normal: 0.549 vs. 0.765, moderate: 0.053 vs. 0.196, severe: 0.038 vs. 0.212). The overall performance is improved by 52.2% in ACC and 40.3% in weighted F1. We can also see that ChatGLM3-6B, LLaMA2-Chinese-7B, and Baichuan2-7B perform poorly in detecting moderate or severe subjects, with low F1 scores. GPT-4 still has some ability to detect moderate or severe subjects, but its F1 scores are not high (moderate: 0.192, severe: 0.167), which is consistent with the observations in Table  3 . Since there are more moderate and severe subjects in the DepSeverity dataset, the advantage of supervised models in specific tasks appears. ChineseMentalBert achieves the best results in identifying both moderate and severe subjects, with an overall ACC of 0.627 and a Weighted-F1 score of 0.564. Our method achieves the best results among LLMs in Table  4 , with F1 scores across all four severity degrees outperforming GPT-4.",
            "The experiments in the previous section  4.3  and  4.4  evaluate the accuracy of the binary classification and depression severity estimation in the generated report, but they do not fully reflect the overall report quality. Therefore, this subsection further validates report quality, particularly the interpretable contents in reports, through subjective evaluations by psychiatrists and quantitative experiments.",
            "Here we present the usage of the InterMind system interface in different language versions (English and Chinese). Figure  11 ,  12  and  13  show a comparison of different language versions of the user interfaces for patient, family, and doctor, respectively. Figure  14  shows a comparison of different language versions of the cyclical analysis interface.  Figure  15  and  16  show the entire generated assistive diagnostic report."
        ]
    },
    "id_table_5": {
        "caption": "Table 5.  Psychiatrist Evaluation Results",
        "table": "S4.T5.1",
        "footnotes": [],
        "references": [
            "In contrast to publicly available interview datasets, depression-related social media datasets are more abundant and offer rich experiences and emotions. Therefore, as shown in Figure  5 , we propose a data augmentation approach based on dialogue rewriting with social media data. We develop psychological counseling dialogue prompt engineering, which utilizes designed prompts that guide GPT-4  (Achiam et al . ,  2023 )  to rewrite social media posts into dialogues appropriate for psychological counseling scenarios.",
            "As for subjective evaluation, we will introduce the subjective evaluation settings and metrics specifically in Sections  4.5.1  and  4.6 .",
            "Based on the above rules, the psychiatrists evaluated a total of 129 subjects, including the MMDAs test set and 80 subjects randomly sampled from the test sets of DR and DepSeverity. The average scores are reported in Table  5 , including binary depression classification, severity degree, symptom-standard agreement, and subtype category. We can see that our method receives higher average scores from psychiatrists across all three datasets compared to GPT-4. Specifically, when it comes to analyzing symptoms related to the dialogue content and providing relevant diagnostic criteria and agreement references, the average score (Symptom_Standard) evaluated by psychiatrists exceeds those of GPT-4. This indicates that psychiatrists agree more with the relevant symptoms and diagnostic criteria presented in our generated reports, evaluating that our method provides psychiatrists with richer and more accurate assistive diagnostic content. Furthermore, our method tends to be more endorsed by psychiatrists in estimating the severity degree of depression, indicating that our approach also performs well in fine-grained tasks.",
            "To further validate the higher quality of the interpretable content in the reports generated by our method (Symptom_Standard in Table  5 ) compared to GPT-4, we conducted a quantitative experimental evaluation used in  (Yang et al . ,  2024b ) .  Specifically, we trained a referee model using the supervised model ChineseMentalBert, where the referee model maps the symptom and standard section of the reports to their corresponding labels.  As shown in Table  6 , we validate the referee models ability to assess the quality of interpretable content in the report using 5-fold cross-validation. It can be observed that for each fold, the referee model achieves an F1 score of over 0.9 in identifying depression based on the symptom and standard part of the reports, with an overall F1 score of 0.936, indicating a strong capability in evaluating report quality. Therefore, we use this referee model to evaluate the interpretable content generated by GPT-4 and our method, in terms of the accuracy of the binary classification results derived from the interpretable contents.",
            "Here we present the usage of the InterMind system interface in different language versions (English and Chinese). Figure  11 ,  12  and  13  show a comparison of different language versions of the user interfaces for patient, family, and doctor, respectively. Figure  14  shows a comparison of different language versions of the cyclical analysis interface.  Figure  15  and  16  show the entire generated assistive diagnostic report."
        ]
    },
    "id_table_6": {
        "caption": "Table 6.  The 5-fold cross-validation results of our trained supervised referee model",
        "table": "S4.T6.1.1",
        "footnotes": [],
        "references": [
            "Specifically, inspired by  (Qiu et al . ,  2023 )  which proposes the prompt that employs ChatGPT to extend public single-turn dialogues into multiturn ones, we refine the prompt to make it more standardized, and incorporate more fine-grained psychological counseling scenario settings.  The proposed prompt guides GPT-4 to gradually analyze experiences and emotions in social media posts according to the rules set in the prompt, and then rewrite the post as a conversation between the user and the AI psychological counselor.  As shown in Figure  6 , our psychological counseling dialogue generation prompt consists of three parts:",
            "As for subjective evaluation, we will introduce the subjective evaluation settings and metrics specifically in Sections  4.5.1  and  4.6 .",
            "To further validate the higher quality of the interpretable content in the reports generated by our method (Symptom_Standard in Table  5 ) compared to GPT-4, we conducted a quantitative experimental evaluation used in  (Yang et al . ,  2024b ) .  Specifically, we trained a referee model using the supervised model ChineseMentalBert, where the referee model maps the symptom and standard section of the reports to their corresponding labels.  As shown in Table  6 , we validate the referee models ability to assess the quality of interpretable content in the report using 5-fold cross-validation. It can be observed that for each fold, the referee model achieves an F1 score of over 0.9 in identifying depression based on the symptom and standard part of the reports, with an overall F1 score of 0.936, indicating a strong capability in evaluating report quality. Therefore, we use this referee model to evaluate the interpretable content generated by GPT-4 and our method, in terms of the accuracy of the binary classification results derived from the interpretable contents.",
            "Here we present the usage of the InterMind system interface in different language versions (English and Chinese). Figure  11 ,  12  and  13  show a comparison of different language versions of the user interfaces for patient, family, and doctor, respectively. Figure  14  shows a comparison of different language versions of the cyclical analysis interface.  Figure  15  and  16  show the entire generated assistive diagnostic report."
        ]
    },
    "id_table_7": {
        "caption": "Table 7.  Ablation Study of Retrieval-augmented Generation (RAG) and Chain-of-thoughts (CoT)",
        "table": "S4.T7.1.1.1",
        "footnotes": [],
        "references": [
            "The key task of our AI Psychologist is to provide assistive diagnostic results, based on the experiences and feelings expressed in dialogues between patients and doctors. However, existing methods often utilize large language models (LLMs) to generate depression classification results and some analytical content from social media posts  (Xu et al . ,  2024 ; Yang et al . ,  2024b ) . These methods lack a standardized, structured representation, making it difficult to form a comprehensive diagnostic report.  Additionally, they often rely on the inherent knowledge of the LLMs model, which can lead to hallucinations in the analysis. Although  (Yang et al . ,  2024b )  introduces an expert manual explanation set, it does not consider a specialized diagnostic standard. As we know, the gold standard for depression diagnosis is the DSM-V manual  (Widiger and Clark,  2000 ) , which provides diagnostic criteria for different types of depression. It serves as a crucial knowledge base for generating diagnostic reports. However, LLMs usually have a maximum text length limitation. The full diagnostic manual is too long to be directly provided to LLMs. In the following, we address these challenges by introducing retrieval-augmented generation (RAG) and chain-of-thoughts (CoT), as shown in Figure  7 .",
            "Specifically, as shown in Figure  7 , the depression diagnostic section of DSM-V is divided into different documents according to the depression subtypes. Let  S = { s 1 , s 2 , ... , s N } S subscript s 1 subscript s 2 ... subscript s N S=\\{s_{1},s_{2},...,s_{N}\\} italic_S = { italic_s start_POSTSUBSCRIPT 1 end_POSTSUBSCRIPT , italic_s start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT , ... , italic_s start_POSTSUBSCRIPT italic_N end_POSTSUBSCRIPT }  represents the subtype documents set, where each document  s n subscript s n s_{n} italic_s start_POSTSUBSCRIPT italic_n end_POSTSUBSCRIPT  corresponds to the symptom descriptions of a specific depression subtype.  For a given user input  u i subscript u i u_{i} italic_u start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT , and a document  s n subscript s n s_{n} italic_s start_POSTSUBSCRIPT italic_n end_POSTSUBSCRIPT , we encode them into high-dimensional feature vectors using an embedding network  f  (  ) f f(*) italic_f (  ) :",
            "To validate the effectiveness of retrieval-augmented generation (RAG) and chain-of-thoughts (CoT) in our use of GPT-4 to generate an assistive diagnostic report for instruction fine-tuning, we conduct an ablation study, which presents the binary classification results of GPT-4 on three datasets in different combinations with RAG or CoT, as shown in the Table  7 ."
        ]
    },
    "global_footnotes": []
}