{
    "id_table_1": {
        "caption": "Table 1:  Comparison of model scoring",
        "table": "S4.T1.1",
        "footnotes": [],
        "references": [
            "Recently, the advancement of large model technology has marked a significant milestone in the field of artificial intelligence, showcasing impressive performance across various industry sectorss  [ 1 ] . These models, trained on vast datasets, have developed a remarkable ability to understand and generate human-like language, which has led to their rapid adoption in sectors such as healthcare and education.  Despite their widespread utility, the adaptation of language models for specialized domains, particularly in agriculture and more specifically in the crop domain, remains insufficiently developed  [ 2 ] . This limitation significantly impacts the application of such models in agricultural practices, including the utilization of advanced genetic tools and the retrieval of specialized crop-related knowledge, which are critical for precision farming and enhanced crop management. To address this problem, this paper proposes an intelligent question answering system for agriculture based on the Retrieval Augmented Generation (RAG) framework and agent architecture (ShizishanGPT).  The system uses a large language model to answer questions related to the cultivation of crops (especially maize) and helps users to solve problems by providing accurate answers through access to relevant crop tools. For individuals who lack expertise in crops, the system empowers smart agriculture by integrating specific functional requirements such as crop cultivation, enabling them to excel in knowledge-based tasks within their area of expertise  [ 3 ] .  For instance, in scenarios where a user needs to predict promoter enrichment  values (a key indicator of gene expression potential in specific DNA segments of the promoter region) ShizishanGPT leverages its  specialized modules to invoke external models that perform detailed calculations and return precise predictions. This capability contrasts sharply with general-purpose models like ChatGPT-4  [ 4 ] , which, lacking domain-specific training and integration capabilities, often fail to provide accurate or relevant responses in the agricultural context.  Figure  1  shows the contrasting responses from \"ChatGPT\" and \"ShizishanGPT\" to a question about predicting promoter enrichment values for a maize DNA sequence. highlighting ShizishanGPTs strength in solving specific problems in the agricultural domain and providing accurate and credible agricultural knowledge.",
            "Table  1  presents a comparison of model scoring across different metrics, highlighting ShizishanGPTs superior performance with a BLEU score of 0.88, a ROUGE score of 0.79, and a GLEU score of 0.85, culminating in a composite score of 0.923. This outpaces other models such as ChatGPT-4, Claude, WenXinYiYan, and ZhiPuAI, which demonstrate varying degrees of effectiveness with ChatGPT-4 performing relatively well with a composite score of 0.876.ShizishanGPT can acquire knowledge that the model itself does not have from the literature vector library and knowledge graph, and deal with skills that other models do not have from external tools. This result shows that the ShizishanGPT has higher accuracy and reliability in intelligent question-answering in the agricultural field."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Results on Agricultural QA Tasks",
        "table": "S4.T2.1",
        "footnotes": [],
        "references": [
            "We propose an intelligent QA system for agricultural knowledge based on the RAG framework and agent architecture, which adopts an integrated architecture that combines advanced artificial intelligence techniques and data management technologies, aiming to provide efficient and accurate QA services. The system comprises multiple modules optimized for a specific function to ensure comprehensive and accurate question answering, shown in Figure  2 . Specifically, the system utilizes a large pre-trained language model to handle generic queries and a search engine module to access the latest agricultural data and research in real time. In addition, the system is embedded with a search vector database of specialized literature to support accurate answers to in-depth domain questions. Using the AgriKG knowledge graph, the system can provide detailed answers to complex questions about crop types, suitable growing conditions, etc. The system also integrates several small prediction models, such as maize phenotype prediction (Resnet model architecture) and rice gene promoter enrichment value prediction, to provide accurate agricultural decision support. The synergistic work of these modules, managed through a unified user interface, ensures the simplicity and efficiency of the systems operation, enabling users to get instant and accurate answers to their natural language queries, thus greatly improving the intelligence of agricultural production and management.",
            "Table  2  shows the results of the experiment,  Our results indicate that ShizishanGPT outperformed other models with a composite score of 9.65, excelling particularly in accuracy (9.8) and professionalism (9.5). On the other hand, ZhiPuAI scored the lowest overall, with a total of 8.94, suggesting areas for improvement, especially in accuracy (8.7). Models like GPT4 and Claude showed competitive results with overall scores of 9.29 and 9.26, respectively, demonstrating strong language fluency capabilities. These findings highlight the significant potential of employing specialized language models in enhancing the precision and effectiveness of responses in agricultural domains."
        ]
    },
    "id_table_3": {
        "caption": "Table 3:  Results of the ablation study",
        "table": "S4.T3.1",
        "footnotes": [],
        "references": [
            "We evaluated the performance of the ShizishanGPT in the agricultural question answering task and compared it with several other models. The results of the comparison are shown in Figure  3 . We set the standard answer score in the data set to 1.0, and it can be seen that ShizishanGPT significantly outperforms the other models in the BLUE and GLUE metrics. The performance on ROUGE metrics is similar to other models. This indicates that it outperforms ChatGPT and other models in terms of similarity and semantic consistency.",
            "We conducted an ablation experiment to demonstrate each components impact on our system. We disabled individual aspects of the system, such as RAG and external predictive models, and evaluated the systems performance again. We used the same QA dataset, metrics, and analysis procedure as in the previous experiment. Table  3  shows the results of our experiment for the different configurations."
        ]
    },
    "global_footnotes": []
}