{
    "id_table_1": {
        "caption": "Table 1:  Comparison of KT benchmark dataset, referencing the XES3G5M research  Liu et al. ( 2024b ) . In several key aspects, existing KT datasets differ significantly from ES-KT-24. ES-KT-24 stands out for its multimodal approach, incorporating text, video, and game log data with educational game context. This dataset also broadens the scope of subjects beyond the typical Math and English, including Indonesian and Malay languages, to promote equity in educational research. Note that the number of questions corresponds directly to the number of games.",
        "table": "S1.T1.1",
        "footnotes": [
            ""
        ],
        "references": [
            "This paper introduces ES-KT-24  1 1 1 The dataset will be made publicly available following final review. , a novel KT dataset based on educational game data. This dataset is uniquely rich in multimodal features, capturing various aspects of game-based learning environments. As shown in Figure  1 , we provide  Game Playing Videos , where one video was recorded for each available game by researchers, along with the processed  Question Texts  derived from these videos. Additionally, ES-KT-24 also contains  Game Log  such as the game category ( KC Text ), log registration time ( Reg Date ), gameplay status ( Content Status ), gameplay duration ( Duration Time ), gameplay mode ( Play Mode ), and the curriculum code ( Lesson Code ). By providing this resource, we aim to support KT research and broader studies in Learning Analytics (LA)  Lang et al. ( 2022 ) . Researchers can utilize this dataset to investigate game-related learning phenomena, analyze multimodal learning processes, and develop more sophisticated models that account for the diverse modalities present in educational settings. The ES-KT-24 dataset thus represents a significant step towards more comprehensive and realistic modeling of student learning in digital environments.",
            "While most of these datasets shown in Table  1  primarily contain ID features of questions and knowledge components along with timestamps, recent datasets like DBE-KT22  Abdelrahman et al. ( 2022 )  and XES3G5M  Liu et al. ( 2024b )  stand out by including the actual text content of the questions. XES3G5M, in particular, provides rich auxiliary information, including textual content of questions, knowledge component relationships, question types, and answer analyses that may enhance the modeling process of students learning outcomes.",
            "Given our educational game, which primarily targets children aged 4 to 6, specific processing considerations were required for the dataset. In this game, users interact through hands-on activities or voice recognition, guided by visual aids and audio explanations. A vital characteristic of the game is that there are no explicit correct or incorrect answers. In other words, to proceed to the next stage of a game, players must input correct answers. This gameplay design limits the data on incorrect attempts, as only correct responses are logged. Consequently, the game logs do not capture correct or incorrect answer data, necessitating a new approach to defining correctness for the KT model. We implemented a rule-based system to infer correctness based on  Content Status  and  Duration Time  in Figure  1  to address this.",
            "For all game sessions, the session was marked as  Incorrect  if the game was interrupted, which means  Abort  in Figure  5  (e.g., a player exited mid-game). It is important to note that the logs are recorded when a game is completed. Each game consists of multiple stages, and the content status is marked as  Finish  only when all existing stages are completed. If a player only completes part of the stages, the status is recorded as  Abort . The number of stages in a game can vary from as few as two to more than ten. The number of stages in each game corresponds to the number of dots displayed at the top of the video. For example, as seen in the captured images of three games in Figure  1 s Game Playing Video, the stage counts are 3, 3, and 10, respectively, from left to right.",
            "The finalized dataset (see Figure  2   right  and Table  1 ) provides a comprehensive overview of player interactions and learning outcomes. Below is a breakdown of key statistics:"
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Performance of KT models on ES-KT-24. SimpleKT shows the best performance, followed by LKT-RoBERTa.",
        "table": "S4.T2.1",
        "footnotes": [],
        "references": [
            "Our data collection process (Figure  2   left ) involved actual gameplay sessions of educational software comprising game-based content developed by an Edtech company. In this context, a session represents a single playthrough of the game. The dataset consists of logs collected between January 2024 and April 2024. These sessions were screen-recorded to capture the visual aspects of the gameplay. Alongside the video recordings, we collected game information, including player actions, in-game events, correct/incorrect responses, and time duration data. This multimodal approach allowed us to capture both the interactive elements of the game and their corresponding learning outcomes.",
            "The finalized dataset (see Figure  2   right  and Table  1 ) provides a comprehensive overview of player interactions and learning outcomes. Below is a breakdown of key statistics:"
        ]
    }
}