{
    "id_table_1": {
        "caption": "TABLE I :  Dataset Characteristics",
        "table": "S4.T1.4.1",
        "footnotes": [],
        "references": [
            "As shown in fig  1 , the general methodology of AGCL includes feature extraction, K-means clustering for grouping data samples, and assessment of the obtained clusters to identify class representation. The cluster evaluation is based on the separation criterion, with a threshold guiding the decision to further subdivide for improved class separation. These steps pave the way for the subsequent steps in the algorithm involved in data synthesis. The analysis of each part of the methodology is presented in the subsequent sections of the paper.",
            "In summary, AGCL tackles the challenges of small medical datasets by combining feature extraction, iterative K-means clustering, and synthetic data generation. The augmented dataset, comprising both original and synthetic data points, is utilized to train machine learning models, enhancing their performance in classification tasks. Ultimately, the algorithm is presented generically in Algorithm  1 ."
        ]
    },
    "id_table_2": {
        "caption": "TABLE II :  Associated AUs to each facial expression",
        "table": "S4.T2.4",
        "footnotes": [],
        "references": [
            "Our dataset consists of videos from 55 individuals captured using an Android tablet camera. Prior to the task, participants viewed a brief video of a person performing the task. They were then asked to make a facial expression and hold it for a few seconds. The facial expressions include anger, happiness, disgust, fear, and surprise. Examples of these facial expressions are illustrated in Figure  2 . Not all participants completed all five facial expressions; therefore, the distribution of videos for each emotion is presented in Table  I . Since each video represents a transition from a neutral face to an extreme emotion, the peak frame of each video is selected for analysis."
        ]
    },
    "id_table_3": {
        "caption": "TABLE III :  Comparison between features of real and synthetic data based on t-test, Levene-test and ks-test",
        "table": "S5.T3.4.1",
        "footnotes": [],
        "references": []
    },
    "id_table_4": {
        "caption": "TABLE IV :  Comparison between accuracy of AGCL, GN,  k NNMTD and Baseline on 5 different emotions.",
        "table": "S5.T4.80.80",
        "footnotes": [],
        "references": []
    }
}