{
    "id_table_1": {
        "caption": "TABLE I:  Notations and associated description used for modeling.",
        "table": "S3.T1.42.42",
        "footnotes": [],
        "references": [
            "We consider a two-tier hierarchical system consisting of an aggregator at the higher level (supplier) and devices at the lower level (consumer) as shown in Figure  1 . An aggregator interfaces with the grid and manages the demand from a set of devices as a cluster based on its maximum capacity. Devices can turn on/arrive at any time and request their demand to the associated clusters aggregator. The power supply is realized through an electrical transmission line while the communication is either through a wired or wireless channel.",
            "The system architecture comprises  J J J italic_J  aggregators and  K K K italic_K  devices connected to each other as shown in Figure  1 . All the devices in the system are in the set  D = { d 1 , d 2 , ... , d k , ...  d K } D subscript d 1 subscript d 2 ... subscript d k ... subscript d K \\mathcal{D}=\\{d_{1},d_{2},\\ldots,d_{k},\\ldots d_{K}\\} caligraphic_D = { italic_d start_POSTSUBSCRIPT 1 end_POSTSUBSCRIPT , italic_d start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT , ... , italic_d start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT , ... italic_d start_POSTSUBSCRIPT italic_K end_POSTSUBSCRIPT }  and all aggregators are represented in the set  A = { a 1 , a 2 , ... , a j , ...  a L } A subscript a 1 subscript a 2 ... subscript a j ... subscript a L \\mathcal{A}=\\{a_{1},a_{2},\\ldots,a_{j},\\ldots a_{L}\\} caligraphic_A = { italic_a start_POSTSUBSCRIPT 1 end_POSTSUBSCRIPT , italic_a start_POSTSUBSCRIPT 2 end_POSTSUBSCRIPT , ... , italic_a start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT , ... italic_a start_POSTSUBSCRIPT italic_L end_POSTSUBSCRIPT } . Every device in  d k  D subscript d k D d_{k}\\in\\mathcal{D} italic_d start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT  caligraphic_D  receives power from one of the aggregators  a j  A subscript a j A a_{j}\\in\\mathcal{A} italic_a start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT  caligraphic_A  by communicating information such as demand, deadline, available power at the aggregator, etc.  { d k , j } subscript d k j \\{d_{k,j}\\} { italic_d start_POSTSUBSCRIPT italic_k , italic_j end_POSTSUBSCRIPT }  denotes the set of all devices (including new/mobile device arrivals) in the cluster associated to  a j subscript a j a_{j} italic_a start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT .",
            "Devices submit their requests to their respective clusters aggregator in the form of Equation  1  and aggregators schedule these requests to minimize the utility loss. Each aggregator uses a  priority  function to establish the order in which the devices can receive power in the next time slot. Additionally, the power mode for each device is also decided for the time slot and the schedule gets disseminated to all devices within the same cluster indicating the order in which the devices receive power. Using this information, each device computes its corresponding utility loss.",
            "The distributed low-complexity algorithm that is executed at every time slot is shown in Algorithm  1 . At a system level (lines 1-6), the aggregators (re-)initialize the devices in its cluster-based on device arrival requests and the associated priority list. They also initialize the  status_list  variable to an empty set that is later populated with aggregator utilizations (load). Each aggregator computes the priority for each of the devices within its cluster-based on Equation  10  and sorts them in descending order. After computing the remaining time and power to meet the device demand, the parameters are passed to the priority function shown in Equation  10 . Devices in the list are assigned power with the lowest of their feasible power modes since few modes may not be feasible based on the progress. Subsequently, any available power at the aggregator is used to upgrade to the higher power mode for devices in the same order of priority. Lastly, the status_list is updated by communicating the utilization among the aggregators and shared with the devices for mobility. Aggregator steps are illustrated from lines 7-17 of Algorithm  1 . At the device level (lines 18-24), mobile devices that did not receive power use the information from the status_list to compute the loss due to movement. If the loss can be minimized at a neighboring aggregator, it sends a request to join the neighboring cluster. The above steps are common to all devices independent of their mobility capabilities shown in steps 1-11 in Algorithm  1 ."
        ]
    },
    "id_table_2": {
        "caption": "TABLE II:  Parameters used in our experimental setup for evaluating the proposed algorithm.",
        "table": "S6.EGx1",
        "footnotes": [],
        "references": [
            "Based on parameters from Table  II , 50 samples of each aggregator class combination with different device utilizations are generated and simulated. The simulation results are shown in Figure  2 . Axes of the violin plot represent the utility loss plotted as a function of the number of devices utilizing the aggregator capacity as listed in Table  II . Each violin in the plot represents the difference of utility loss difference between device mobility enabled and disabled,  i.e.,   u k  ( t )  ( mobility )  u k  ( t )  ( non  mobility ) subscript u k t mobility subscript u k t non mobility u_{k}(t)\\mathrm{(mobility)}-u_{k}(t)\\mathrm{(non-mobility)} italic_u start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT ( italic_t ) ( roman_mobility ) - italic_u start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT ( italic_t ) ( roman_non - roman_mobility ) . The former allows devices to move across different clusters while the latter restricts all devices to their original cluster. The length of the violin indicates the variance while the average value is indicated by the white dot at the center; the sharp peaks represent the outliers.",
            "As seen from Figure  2 , with limited devices, the demand reduces from each of the devices, giving a higher probability of allocating the residual power to a new device. This can be seen by the reduction in utility loss for mobility enabled in the plot for a higher number of devices. The scheduling can be realized practically as electric buses are more difficult to schedule than a low-power EV or electric scooter."
        ]
    },
    "id_table_3": {
        "caption": "TABLE III:  Number of samples generated for the solver.",
        "table": "S5.T2.14.14.14.14",
        "footnotes": [],
        "references": [
            "where,  c a j  a j ^  ( t ) subscript c  subscript a j subscript a ^ j t c_{a_{j}\\leftrightarrow a_{\\hat{j}}}(t) italic_c start_POSTSUBSCRIPT italic_a start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT  italic_a start_POSTSUBSCRIPT over^ start_ARG italic_j end_ARG end_POSTSUBSCRIPT end_POSTSUBSCRIPT ( italic_t )  is the cost per time slot derived from Equation  3  and   m  k  [ a j , a j ^ , t ] subscript  m k subscript a j subscript a ^ j t \\gamma_{mk}[a_{j},a_{\\hat{j}},t] italic_ start_POSTSUBSCRIPT italic_m italic_k end_POSTSUBSCRIPT [ italic_a start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT , italic_a start_POSTSUBSCRIPT over^ start_ARG italic_j end_ARG end_POSTSUBSCRIPT , italic_t ]  represents the binary variable that indicates if a device is chosen to move (= 1) or not (= 0) between clusters with aggregators  a j subscript a j a_{j} italic_a start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT  and  a j ^ subscript a ^ j a_{\\hat{j}} italic_a start_POSTSUBSCRIPT over^ start_ARG italic_j end_ARG end_POSTSUBSCRIPT  at time  t t t italic_t . It is important to note that if a mobile device with an initial charge moves to another cluster before consuming power, it results in negative utility that is capped at   I k subscript I k -I_{k} - italic_I start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT .",
            "From Figure  3 , we see that even in the best case, the utility loss from the solver is worse off by  10 33 superscript 10 33 10^{33} 10 start_POSTSUPERSCRIPT 33 end_POSTSUPERSCRIPT  or more than the heuristic solution. It can also be seen that the increase in number of devices also increases the losses from the solver. Table  III  lists the number of samples that could produce at least one feasible schedule for the different number of devices along with the proportion of mobile devices among them. With a lower number of devices and a lower proportion of mobile devices among them, the model is able to produce at least one solution due to lower complexity. As the proportion of mobile devices increase, the number of solver variables and the resulting losses are exacerbated yielding lesser samples that can produce a feasible schedule."
        ]
    },
    "id_table_4": {
        "caption": "TABLE IV:  Utility loss for EV dataset with different strategies.",
        "table": "S5.T3.fig1.1.1",
        "footnotes": [],
        "references": [
            "where  f  ( t ) f t f(t) italic_f ( italic_t )  is given by  ( P k  ( t c )  E k )  [ exp  (  k  ( t c  T k ) ) ]  subscript P k subscript t c subscript E k delimited-[] subscript  k subscript t c subscript T k (\\mathcal{P}_{k}(t_{c})-E_{k})\\cdot[\\exp(\\kappa_{k}(t_{c}-T_{k}))] ( caligraphic_P start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT ( italic_t start_POSTSUBSCRIPT italic_c end_POSTSUBSCRIPT ) - italic_E start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT )  [ roman_exp ( italic_ start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT ( italic_t start_POSTSUBSCRIPT italic_c end_POSTSUBSCRIPT - italic_T start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT ) ) ] .  P k  ( t ) subscript P k t \\mathcal{P}_{k}(t) caligraphic_P start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT ( italic_t )  is the accumulated utility up to the current time slot  t c subscript t c t_{c} italic_t start_POSTSUBSCRIPT italic_c end_POSTSUBSCRIPT  as defined in Equation  4 . The expression in Equation  6  is the loss factor per time slot after the deadline is missed.   k subscript  k \\kappa_{k} italic_ start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT  provides a measure of criticality in devices to signify how imperative it is to serve a device  d k subscript d k d_{k} italic_d start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT  to minimize the significant losses in utility. A higher value for   k subscript  k \\kappa_{k} italic_ start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT  translates to a higher rate of loss for exceeding the deadline."
        ]
    },
    "id_table_5": {
        "caption": "",
        "table": "S5.T4.fig1.1.1",
        "footnotes": [],
        "references": [
            "The utility loss function in Equation  5  consists of three terms: loss due to mobility, loss for missing the deadline and penalty for moving stationary devices across clusters.",
            "The first term in Equation  5  incorporates the penalty for missing the deadline. It is given as",
            "The third term in Equation  5  prevents the stationary devices to move from its parent cluster by imposing a very high penalty on those devices. If a device  d k subscript d k d_{k} italic_d start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT  belongs to a cluster  a j subscript a j a_{j} italic_a start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT  and it moves to a different cluster  a j ^ subscript a ^ j a_{\\hat{j}} italic_a start_POSTSUBSCRIPT over^ start_ARG italic_j end_ARG end_POSTSUBSCRIPT , then the penalty is given by",
            "Given all devices  d k  D subscript d k D d_{k}\\in\\mathcal{D} italic_d start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT  caligraphic_D  and the utility function in Equation  5 , the objective is to minimize the cumulative utility loss across all devices over all the time slots in the system. It is important to note that the objective is to allow a device with high criticality to consume power at the earliest to reduce the penalty in utility rather than maximizing the devices to meet their deadlines. Hence, there could be a higher number of deadline violations while minimizing the utility loss.",
            "Since the progress  P k  ( t ) subscript P k t \\mathcal{P}_{k}(t) caligraphic_P start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT ( italic_t )  remains the same independent of the mobility or the time of receiving power, we can translate the maximization of utility into a minimization of utility loss. Assuming that the stationary devices do not move, the utility loss term is given by the combination of terms one and two in  5 , i.e.,  u k  ( t ) = 2   k m  ( t ) +  k d  ( t ) subscript u k t  2 superscript subscript  k m t superscript subscript  k d t u_{k}(t)=2\\cdot\\beta_{k}^{m}(t)+\\beta_{k}^{d}(t) italic_u start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT ( italic_t ) = 2  italic_ start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_m end_POSTSUPERSCRIPT ( italic_t ) + italic_ start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_d end_POSTSUPERSCRIPT ( italic_t ) . The decision variables are the choice of each device  d k subscript d k d_{k} italic_d start_POSTSUBSCRIPT italic_k end_POSTSUBSCRIPT  to receive power (  p  k subscript  p k \\gamma_{pk} italic_ start_POSTSUBSCRIPT italic_p italic_k end_POSTSUBSCRIPT ) and the choice to move to another cluster (  m  k subscript  m k \\gamma_{mk} italic_ start_POSTSUBSCRIPT italic_m italic_k end_POSTSUBSCRIPT )."
        ]
    }
}