{
    "S3.F4.2": {
        "caption": [
            "Figure 4",
            "Magnetometer calibration ellipses fitted from explicit calibration sequence (left) and partial calibration (right)."
        ],
        "table": "<table id=\"S3.F4.2\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S3.F4.2.2\" class=\"ltx_tr\">\n<td id=\"S3.F4.1.1.1\" class=\"ltx_td ltx_align_center\"><span id=\"S3.F4.1.1.1.1\" class=\"ltx_text ltx_framed ltx_framed_rectangle\" style=\"border-color: #000000;\"><img src=\"/html/2409.09904/assets/x1.png\" id=\"S3.F4.1.1.1.1.g1\" class=\"ltx_graphics ltx_img_landscape\" width=\"200\" height=\"132\" alt=\"Refer to caption\"></span></td>\n<td id=\"S3.F4.2.2.2\" class=\"ltx_td ltx_align_center\"><span id=\"S3.F4.2.2.2.1\" class=\"ltx_text ltx_framed ltx_framed_rectangle\" style=\"border-color: #000000;\"><img src=\"/html/2409.09904/assets/x2.png\" id=\"S3.F4.2.2.2.1.g1\" class=\"ltx_graphics ltx_img_landscape\" width=\"202\" height=\"132\" alt=\"Refer to caption\"></span></td>\n</tr>\n</table>\n",
        "footnotes": [],
        "references": [
            "These corrected measurements are used to calculate magnetometer residuals in the sliding-window optimization as explained in  Section  III-D. In an indoor environment, these hard and soft iron effects continue to change as we move through the different areas. The underwater cave environment is ideally suited for magnetometer fusion as the likelihood of magnetic disturbance is minimal. As such, we performed the calibration at the beginning and assumed that the local magnetic field did not change significantly. During deployment, we performed calibration at the beginning and at the end of the dive, both calibrations resulted in similar values, validating the above assumption.  On older datasets, we did not record an explicit magnetometer calibration sequence. In such a case, these are not enough magnetometer measurements in all directions; thus full mapping from ellipse to sphere is degenerate. Thus, we only calibrate the hard iron effect. Figure 4 presents the ellipsoids fitted during complete calibration for the new sensor and for partial calibration of the old sensor."
        ]
    }
}{
    "S4.F5.3": {
        "caption": [
            "Figure 5",
            "Trajectories from two deployments at the Devil’s Eye cave system, FL, USA. The first two images show the trajectories, COLMAP (red) treated as ground truth, OKVIS VIO [okvis] (blue), and OKVIS with magnetometer (green) the proposed method. The first trajectory was carried out with the old sensor suite [RahmanOceans2018] and was a short (∼similar-to\\sim220m) trajectory, the second was done with the new system and went further (∼similar-to\\sim500m) trajectory. The final figure presents a section of the man-made map with the ground truth trajectory superimposed (the blue background indicates the Santa Fe River over the cave). These trajectories are aligned at the origin (0,0) only to show endpoint error."
        ],
        "table": "<table id=\"S4.F5.3\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S4.F5.3.3\" class=\"ltx_tr\">\n<td id=\"S4.F5.1.1.1\" class=\"ltx_td ltx_align_left\"><img src=\"/html/2409.09904/assets/figures/cave_short.png\" id=\"S4.F5.1.1.1.g1\" class=\"ltx_graphics ltx_img_square\" width=\"158\" height=\"154\" alt=\"Refer to caption\"></td>\n<td id=\"S4.F5.2.2.2\" class=\"ltx_td ltx_align_left\"><img src=\"/html/2409.09904/assets/figures/cave_long.png\" id=\"S4.F5.2.2.2.g1\" class=\"ltx_graphics ltx_img_square\" width=\"158\" height=\"154\" alt=\"Refer to caption\"></td>\n<td id=\"S4.F5.3.3.3\" class=\"ltx_td ltx_align_left\"><img src=\"/html/2409.09904/assets/figures/devils_systemPart_Annot.png\" id=\"S4.F5.3.3.3.g1\" class=\"ltx_graphics ltx_img_square\" width=\"155\" height=\"154\" alt=\"Refer to caption\"></td>\n</tr>\n</table>\n",
        "footnotes": [],
        "references": [
            "Two different deployments from the Devil’s Eye cave system are presented in Fig. 5. The first deployment, a short foray of 100 meters penetration inside the cave, can be seen in the left image, and the drift in the trajectory (blue) without magnetometer data fusion is clear. The visual inertial magnetometer fusion (green) follows much more closely the ground truth trajectory from COLMAP. More dramatic improvements are presented in the middle figure with trajectory of more than 500 meters. Compared to the globally optimized (COLMAP) trajectory there was reduction of positional error from 2.8% to 0.6%. The right image presents a partial map of the cave system with the COLMAP trajectory superimposed. The map is not up to scale, thus some passages are not scaled uniformly. Nonetheless, the trajectory follows the main passages of the cave system.\nFigure 7 presents the trajectory resulting from the deployment of the old sensor suite at the Cenote Dos Ojos. During the 50-minute deployment, the sensor covered approximately 680 meters inside a highly decorated cave. The large volume of data made the production of a COLMAP-based ground truth trajectory infeasible due to computation and memory constraints. As such, this trajectory is used only as a qualitative comparison. As can be seen, the VIO diverged almost 100 meters. The trajectory obtained from magnetometer fusion follows the path out much more closely to the path taken on the way in. It is worth noting that the sensor’s trajectory does not follow exactly the same path; however, the confined structure of the cave passage constrains the inbound and the outbound trajectories fairly close."
        ]
    }
}{
    "S4.T1.5": {
        "caption": [
            "TABLE I",
            "Three times run mean absolute trajectory error (ATE) for VIO with and without magnetometer compared with COLMAP baseline after sim(3) alignment in terms of degree/meters.",
            "sim(3)"
        ],
        "table": "<table id=\"S4.T1.5\" class=\"ltx_tabular ltx_centering ltx_align_middle\">\n<tr id=\"S4.T1.5.1\" class=\"ltx_tr\">\n<td id=\"S4.T1.5.1.1\" class=\"ltx_td ltx_align_left\">dataset</td>\n<td id=\"S4.T1.5.1.2\" class=\"ltx_td ltx_align_center\">length</td>\n<td id=\"S4.T1.5.1.3\" class=\"ltx_td ltx_align_center\">VIO</td>\n<td id=\"S4.T1.5.1.4\" class=\"ltx_td ltx_align_center\">VIO+MAG</td>\n</tr>\n<tr id=\"S4.T1.5.2\" class=\"ltx_tr\">\n<td id=\"S4.T1.5.2.1\" class=\"ltx_td ltx_align_left ltx_border_tt\">cave1_short</td>\n<td id=\"S4.T1.5.2.2\" class=\"ltx_td ltx_align_center ltx_border_tt\">220m</td>\n<td id=\"S4.T1.5.2.3\" class=\"ltx_td ltx_align_center ltx_border_tt\">6.31°/6.45m</td>\n<td id=\"S4.T1.5.2.4\" class=\"ltx_td ltx_align_center ltx_border_tt\">4.48°/4.98m</td>\n</tr>\n<tr id=\"S4.T1.5.3\" class=\"ltx_tr\">\n<td id=\"S4.T1.5.3.1\" class=\"ltx_td ltx_align_left ltx_border_bb\">cave1_long</td>\n<td id=\"S4.T1.5.3.2\" class=\"ltx_td ltx_align_center ltx_border_bb\">506m</td>\n<td id=\"S4.T1.5.3.3\" class=\"ltx_td ltx_align_center ltx_border_bb\">14.65°/14.57m</td>\n<td id=\"S4.T1.5.3.4\" class=\"ltx_td ltx_align_center ltx_border_bb\">5.83°/3.37m</td>\n</tr>\n</table>\n",
        "footnotes": [],
        "references": [
            "We compare the performance of our magnetometer formulation with the VIO formulation from OKVIS [okvis] in terms of absolute trajectory error (ATE)  [absolute_traj_error]. We include the results of the VIO-only case without fusing magnetometer measurements and compare them with the proposed method after sim(3) alignment. Each method is run three times and the absolute trajectory error in terms of degree/meters is reported in Table I. As seen in the table, there is a significant reduction in both translation and rotation RMSE. In particular in the cave1_long dataset, both the rotation and translation error decreased significantly from ∼similar-to\\sim15°to ∼similar-to\\sim6°and from ∼similar-to\\sim14m to ∼similar-to\\sim3m."
        ]
    }
}