{
    "id_table_1": {
        "caption": "TABLE I:  Overall statistics of our dataset.",
        "table": "S2.T1.1.1.1",
        "footnotes": [],
        "references": [
            "Preservation of medical info.  In  Table   II , we compare the CXR pathology classification performance of EHRXDiff and  EHRXDiff w  _  n  u  l  l subscript EHRXDiff w _ n u l l \\text{EHRXDiff}_{w\\_null} EHRXDiff start_POSTSUBSCRIPT italic_w _ italic_n italic_u italic_l italic_l end_POSTSUBSCRIPT  models with four baseline models defined in  Section   III-A , using weighted macro AUROC on the Chest ImaGenome test set. We analyze the results in three categories: the  all  category reflects the overall performance on the entire test set, while the  same  and  diff  categories refer to the test subsets where the labels for  I p  r  e  v subscript I p r e v I_{prev} italic_I start_POSTSUBSCRIPT italic_p italic_r italic_e italic_v end_POSTSUBSCRIPT  and  I t  r  g subscript I t r g I_{trg} italic_I start_POSTSUBSCRIPT italic_t italic_r italic_g end_POSTSUBSCRIPT  are identical or different, respectively. Both of our models share the same architecture ( Fig.   1 ), but  EHRXDiff w  _  n  u  l  l subscript EHRXDiff w _ n u l l \\text{EHRXDiff}_{w\\_null} EHRXDiff start_POSTSUBSCRIPT italic_w _ italic_n italic_u italic_l italic_l end_POSTSUBSCRIPT  additionally uses the augmentation technique described in  Section   II-D ."
        ]
    },
    "id_table_2": {
        "caption": "TABLE II:  Quantitative results for medical information preservation on the test set. (mean  std)",
        "table": "S2.T2.7.7.7",
        "footnotes": [],
        "references": [
            "Image Fidelity and Qualitative Results.  In  Table   III , the EHRXDiff and  EHRXDiff w  _  n  u  l  l subscript EHRXDiff w _ n u l l \\text{EHRXDiff}_{w\\_null} EHRXDiff start_POSTSUBSCRIPT italic_w _ italic_n italic_u italic_l italic_l end_POSTSUBSCRIPT  models achieve low FID scores, compared to SOTA text-conditional CXR generation models  [ 7 ]  with scores ranging from 3 to 9. This demonstrates their ability to generate realistic, high-quality CXR images, as also shown in  Fig.   2 .  EHRXDiff w  _  n  u  l  l subscript EHRXDiff w _ n u l l \\text{EHRXDiff}_{w\\_null} EHRXDiff start_POSTSUBSCRIPT italic_w _ italic_n italic_u italic_l italic_l end_POSTSUBSCRIPT  effectively captures temporal changes, such as resolving the white appearance in the left lung in both  I t  r  g subscript I t r g I_{trg} italic_I start_POSTSUBSCRIPT italic_t italic_r italic_g end_POSTSUBSCRIPT  and  I p  r  e  d subscript I p r e d I_{pred} italic_I start_POSTSUBSCRIPT italic_p italic_r italic_e italic_d end_POSTSUBSCRIPT  in rows 1-2, while preserving the overall status in row 3. However, there are limitations in maintaining finer details. For example, our model detects only one device, missing the other in row 3."
        ]
    },
    "id_table_3": {
        "caption": "TABLE III:  Quantitative results for image quality and demographic preservation on the test set. (mean  std)",
        "table": "S2.T3.10.10.10",
        "footnotes": [],
        "references": []
    },
    "id_table_4": {
        "caption": "TABLE IV:  Quantitative result of different conditioning input for our model on the test set. (mean  std)",
        "table": "S2.T4.25.25.25",
        "footnotes": [],
        "references": []
    }
}