{
    "id_table_1": {
        "caption": "Table 1:  Benchmark results (accuracy) on the 400 validated questions (TrustMus) and per category: People (Ppl); Instruments and Technology (I&T); Genres, Forms, and Theory (Thr); Culture and History (C&H). Whether the models are quantized (Quant), their rank, and LiveBench  average score (LB) excluding math ranking is also given.",
        "table": "S1.F1.1.pic1.1.1.1.1.1.1.1.1",
        "footnotes": [],
        "references": [
            "Table  1  presents the benchmark results for various models evaluated on TrustMus. 4 4 4 Since we believe that open models are critical for transparency, reproducibility, and the advancement of knowledge, we use them in our research. We included ChatGPT in our comparison only because it is currently the most used LLM.   The models tested include the best open source performing models in  LiveBench  LB  White et al. ( 2024 )  excluding coding and math categories, i. e., a benchmark for LLMs without contamination and reduced biases containing non-musicology knowledge. Due to its leading performance, results of OpenAIs GPT models are also given for comparison.  Models with less than 8B parameters were deployed in a computer with two RTX 2080ti GPUs with 16-bit precision, the largest models in a Colab A100 GPU with 4-bit quantization, and the  GPT models through their official API.",
            "The model  gpt-4o-2024-05-13  clearly outperforms others with an accuracy of 58.75% (cf. TrustMus score in Table  1 ), excelling in the categories  Ppl, Thr, and C&H. This is not surprising as it is the leading model in LB as well, with a score of 58.38%.  However, comparing the LB and TrustMus rankings reveals important differences about how the models perform in terms of general and in domain-specific knowledge.  For instance, unlike in LB, the model  mixtral-8x22b-instruct-v0.1  performs well in our benchmark, ranking second with a score of 40.5%.  It is important to note the similar performance between  qwen  with 72B and 7B, the latter being the best performing of the small LLMs in TrustMus while showing the worst performance in LB.  We also aim to acknowledge that comparing  meta-llama3   models with others is not entirely fair, as the benchmark was automatically generated by selecting questions from their specific blind spots, as detailed in Section 3."
        ]
    },
    "id_table_2": {
        "caption": "",
        "table": "S1.F1.1.pic1.2.2.2.1.1.1.1.1",
        "footnotes": [],
        "references": [
            "Figure  2  illustrates how often students and teachers interact with LLMs in general and about music topics.  Teachers frequently or not at all, while most students use it weekly or monthly.  However, both groups tend to not use LLMs for music-related topics.  Participants judgement of LLMs trustworthiness is depicted in Figure  3  and the trend of ratings is similar across both groups.  Additionally, confidence in LLMs is slightly higher for Music History than for Music Theory, indicating a nuanced perception of their reliability in different musicology subfields."
        ]
    },
    "id_table_3": {
        "caption": "",
        "table": "S1.F1.1.pic1.3.3.3.1.1.1.1.1",
        "footnotes": [],
        "references": [
            "Figure  2  illustrates how often students and teachers interact with LLMs in general and about music topics.  Teachers frequently or not at all, while most students use it weekly or monthly.  However, both groups tend to not use LLMs for music-related topics.  Participants judgement of LLMs trustworthiness is depicted in Figure  3  and the trend of ratings is similar across both groups.  Additionally, confidence in LLMs is slightly higher for Music History than for Music Theory, indicating a nuanced perception of their reliability in different musicology subfields."
        ]
    },
    "id_table_4": {
        "caption": "",
        "table": "S4.T1.1",
        "footnotes": [],
        "references": [
            "Most of the participants  (78%)  agreed that LLMs might revolutionize the field of musicology (cf. Figure  4 , left).  While the anticipated potential consequences of LLMs for the field are varied,  professional transformation seems to be  the most prominent (20 votes), as illustrated in the histogram (cf. Figure  4 , right).  In conclusion, despite limited current usage and trust, experts anticipate a significant future impact of LLMs on musicology, motivating current research on the topic."
        ]
    },
    "global_footnotes": [
        "For simplicity, with teachers we refer to all the participants who did not identified themselves as student.",
        "The Grove Dictionary is a copyrighted work. Using its content for generating questions is under fair use for research purposes. The EU Directive on Copyright in the Digital Single Market allows text and data mining for research purposes.",
        "@:",
        "Since we believe that open models are critical for transparency, reproducibility, and the advancement of knowledge, we use them in our research. We included ChatGPT in our comparison only because it is currently the most used LLM."
    ]
}