{
    "id_table_1": {
        "caption": "Table 1 :  Set of equations used for the mechanical behavior - with   ~ ~  \\utilde{\\sigma} under~ start_ARG italic_ end_ARG  being the stress tensor,   ~ d subscript ~  d \\utilde{\\sigma}_{d} under~ start_ARG italic_ end_ARG start_POSTSUBSCRIPT italic_d end_POSTSUBSCRIPT  being the deviatoric stress tensor,  C C \\mathcal{C} caligraphic_C  the stiffness tensor,   ~ ~  \\utilde{\\varepsilon} under~ start_ARG italic_ end_ARG  the total strain,   ~ e superscript ~  e \\utilde{\\varepsilon}^{e} under~ start_ARG italic_ end_ARG start_POSTSUPERSCRIPT italic_e end_POSTSUPERSCRIPT  and   ~ p superscript ~  p \\utilde{\\varepsilon}^{p} under~ start_ARG italic_ end_ARG start_POSTSUPERSCRIPT italic_p end_POSTSUPERSCRIPT  the elastic and plastic strain tensors respectively,  J J \\mathcal{J} caligraphic_J  the von Mises yield function,  p p p italic_p  the cumulative plastic strain, and   ~ d p superscript subscript ~  d p \\utilde{\\varepsilon}_{d}^{p} under~ start_ARG italic_ end_ARG start_POSTSUBSCRIPT italic_d end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_p end_POSTSUPERSCRIPT  the deviatoric plastic strain  [ 39 ]",
        "table": "S2.F1.sf1.pic1.2.1.1",
        "footnotes": [
            ""
        ],
        "references": [
            "The geometry of the specimens used is shown in Fig.  1  (a) and the results are recalled in a applied stress amplitude (  a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT ) - lifetime ( N R subscript N R N_{R} italic_N start_POSTSUBSCRIPT italic_R end_POSTSUBSCRIPT ) plot in Fig.  1  (b). The tomographies of the specimens used for fatigue experiments are not available. As the specimens were cut from a bigger slab, the pores in these specimens are volumetric pores created due to the manufacturing process. For all experiments, a maximum limit on the number of loading cycles was set at  2  10 6 2 superscript 10 6 2\\times 10^{6} 2  10 start_POSTSUPERSCRIPT 6 end_POSTSUPERSCRIPT  cycles. The specimens which did not break (termed run-outs) were counted and reported at the  N R = 2  10 6 subscript N R 2 superscript 10 6 N_{R}=2\\times 10^{6} italic_N start_POSTSUBSCRIPT italic_R end_POSTSUBSCRIPT = 2  10 start_POSTSUPERSCRIPT 6 end_POSTSUPERSCRIPT  mark with an arrow to the right to indicate potential failure for a larger number of cycles (Figure  1 (b)).",
            "The synthetically generated porous specimens have the same geometry as the specimens used for fatigue testing (Fig.  1 (a)), but with the pores inspired by the computed tomography (Fig.  2 ). These synthetically generated porous specimens thus resemble the traction specimens used for fatigue testing. The resulting meshes have linear elements with a piece-wise constant approximation of the stresses.",
            "The multi-scale probabilistic fatigue model developed requires the computation of the local criterion (      superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ) for all the finite elements comprising the porous specimens due to applied stress amplitude on the specimen (  a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT ) for computation of the specimens fatigue lifetime probability distribution. As the presence of pores in the specimen causes high stress concentration factors leading to local yielding, we consider a Chaboche-type plastic material behavior, consisting of non-linear isotropic and kinematic hardening. The equations are recalled in table  1 .",
            "To illustrate the computational complexity involved, we note that the computing the Weibull scale parameter of the structure,   s superscript  s \\lambda^{s} italic_ start_POSTSUPERSCRIPT italic_s end_POSTSUPERSCRIPT , requires summing the Weibull scale parameters,    \\lambda italic_ , of all elements in the FE mesh (equation ( 11 )). This result is then used to compute  f N R s subscript f superscript subscript N R s f_{N_{\\textrm{R}}^{\\textrm{s}}} italic_f start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT s end_POSTSUPERSCRIPT end_POSTSUBSCRIPT . The scale parameters of the elements in turn require the computation of the inverse function  g  1  (     2 ) superscript g 1  superscript  2 g^{-1}\\left(\\frac{\\Delta\\varepsilon^{*}}{2}\\right) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT end_ARG start_ARG 2 end_ARG )  for each element (equation ( 7 )). The criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  is obtained for all the elements by one elasto-static finite element computation combined with the Neuber-type element-wise plastic correction algorithm, and does not need to be re-computed during the optimisation process. As the inverse function  g  1  (     2 ) superscript g 1  superscript  2 g^{-1}\\left(\\frac{\\Delta\\varepsilon^{*}}{2}\\right) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT end_ARG start_ARG 2 end_ARG )  depends on some of the parameters of the fatigue model ( A A A italic_A ,  B B B italic_B ,    \\alpha italic_  and    \\beta italic_ ), it needs to be re-computed for all the elements at every iteration of the optimisation process.",
            "The algorithm explained in Algorithm  1  explains how the log-likelihood is computed for this case, including taking run-outs into account.",
            "In this section, the behavior of the optimisation process presented in section  4  will be studied. The complexity of the fatigue model, i.e. number of required model parameters to fit lifetime data, will also be investigated. The data used is the previously presented experimental high-cycle fatigue data on non-porous and porous specimens (Figure  1 ). Finally, we will try to identify a fatigue model that is transferable between these two types of pore populations.",
            "Elasto-plastic computations (elasto-static FEA followed by Neuber-type elasto-plastic correction, as explained in section  3.3 ) were carried out on each of the synthetically generated porous specimens, for 9 nominal loading levels (  a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT  ranging from 20 to 100 MPa). We use the material parameters identified by  [ 28 ]  for the considered alloy. The parameters of the elasto-plastic model are recalled in table  2 . The boundary conditions (shown in Figure  9 ) replicates the experimental conditions under which the high-cycle fatigue data were obtained. Each loading sequence consisted of 20 symmetric tension-compression cycles ( R =  1 R 1 R=-1 italic_R = - 1 ), to allow for stabilization of the elasto-plastic response. The fatigue criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  in the stabilized (20 th ) cycle is extracted. An example of the criterion computation in two synthetically generated specimens for one of the nominal loading levels (  a = 80 subscript  a 80 \\Sigma_{a}=80 roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT = 80  MPa), is shown in Fig.  10 . In this figure, the axial stress-strain histories for some integration points having high values of       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  are shown, to highlight the stabilization of the stress-strain cycles.",
            "The multi-scale methodology is not required for identifying the parameters of the fatigue model on non-porous specimens, as the stress field is homogeneous in the gauge section. The maximum likelihood approach developed in section  4.1  is used to identify the parameters    \\mu italic_  of the fatigue model. Optimisation is carried out using the experimental fatigue lifetime data of non-porous specimens, as detailed in section  2 .",
            "For all three models, the optimizer (Nelder-Mead) converges towards solutions with very similar likelihood values. The evolution of the parameters and the solution for the two-line fatigue model (equation ( 19 )(i)) is shown in Fig.  11 . Even for an initialisation that is far away from the solution at convergence, the optimisation process is well behaved, as seen by the intermediate and final solutions in Fig.  11 (b-f).",
            "The results of optimisation are presented in Fig.  12 . For all the models, it is observed that the solutions for the first and second fatigue models (equation ( 19 )(i) and (ii)) are similar, which suggests that the parameters  B B B italic_B  and    \\beta italic_ , i.e. the second line in the fatigue model, are not required. In our view, this conclusion would have been different had we had access to a richer data-set with more experiments across more loading levels. The third fatigue model (equation ( 19 )(iii)) shows a significant decrease in the quality of the fit, indicating the requirement for the parameter  C C C italic_C  for getting a meaningful fatigue limit beyond which the lifetime is infinite.",
            "The fatigue model is now identified on the experimental fatigue lifetime data of porous material presented in Section  2 . The multi-scale methodology developed in section  3  for structures with heterogeneous stress distributions due to pores whose exact geometries and locations are unknown is used. The maximum likelihood approach developed in section  4.3  was used as the identification procedure. From the previously defined set  K ~ ~ K \\tilde{K} over~ start_ARG italic_K end_ARG , a total of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  synthetic specimens were randomly selected for each ( N i ,  a i superscript N i superscript subscript  a i N^{i},\\Sigma_{a}^{i} italic_N start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT , roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT ) pair in order to approximate the expectation operator in the expression ( 18 ) of the likelihood function. 2 2 2 The value of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  is chosen to balance robustness and computational cost in the model identification process. The robustness increases with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT : each experimental point has a likelihood of failing from a larger variety of pore configurations, which is ideal as the exact pore distribution associated to the failure point is unknown. However, as will be discussed later, the computational cost increases linearly with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT .",
            "As defined previously (section  5.1 ), the cases correspond to (i) the two-line fatigue model and (ii) the one-line fatigue model.",
            "The parameters stabilise after a certain number of iterations of optimisation, as shown in the Fig.  13 (a) for the two-line fatigue model. In Fig.  13  we show an optimisation process that converges well due to good initialisation. Indeed, if the initialisation is very far away from the expected solution, the optimisation process does not yield satisfactory results.",
            "Fatigue lifetime distributions for multiple realizations of synthetically generated porous specimens of the same volume but varying pore distributions (examples previously shown in  10 ) were obtained, at various nominal loading levels. The synthetically generated porous specimens show variations in their fatigue lifetime distributions, as shown in Fig.  14  for two different nominal applied stress amplitude levels, or in Fig.  15  for the entire Wohler curve for a couple of specimens.",
            "A fatigue lifetime distribution or Wohler curve representing uncertainty due to pore distributions can be constructed by combining samples from a certain number of porous specimens. The failure distribution representing this uncertainty in pore distributions is constructed by combining 1000 samples each from 10 different randomly generated porous test specimens (shown by the red histogram in Fig.  14 (c,d)). The quantiles are then computed on 10000 samples for each nominal stress level, which are joined to construct the quantiles of the porous Wohler curve (shown by the red area in Fig.  15 ). This failure distribution or Wohler curve represents uncertainty due to defects at two scales - micro-heterogeneity and varying pore distributions. We note that the uncertainty in fatigue lifetime due to varying pore distributions in the specimen is relatively low as compared to the uncertainty due to the micro-heterogeneity. In other words, at the scale of this specimen, the impact of varying pore distributions on the lifetime is not high. This is because of the volume of the specimen, which is large as compared to the pore size, which increases the likelihood of finding critical pore configurations in all the specimens, and makes all the synthetic specimens have similar stress distributions.",
            "The comparison between a two-line strain life model and one line strain life model is shown in Fig.  16 . The two models (with four and six parameters) yield qualitatively similar probability distributions for the specimen fatigue lifetime (with the 6 parameter model having only a very slightly lower likelihood value than the one obtained using the 4 parameter model). We will further investigate the more general two-line strain-life model with 6 parameters, to allow for the possibility of two distinct regimes.",
            "Ideally we should also be able to predict the fatigue lifetime of porous materials with different pore distributions than the ones that were experimentally tested. Using the two-line fatigue model identified on the porous data, we try to predict the fatigue behavior of a non-porous specimen. The results are shown in Fig.  17 . We see that the prediction on the non-porous specimens is incorrect. The predicted lifetime is lower than what experiments suggest. This could be due to three reasons:",
            "We now consider the fatigue lifetime data-set associated with non-porous and porous material presented in section  2 . A reduction of the non-porous fatigue lifetime data-set  I I \\mathcal{I} caligraphic_I  is done by randomly picking one experimental point for each applied stress amplitude level. The resulting reduced non-porous dataset  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  is shown in Fig.  18  (a).",
            "The model parameters are jointly identified on the reduced non-porous data-set  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  and the porous data-set  J J \\mathcal{J} caligraphic_J . The result of the optimisation process is shown in Fig.  18 . The fit is consistent on both the non-porous as well as porous cases, despite the reduction of non-porous data. This indicates that fewer fatigue experiments are required to identify the parameters when using the multi-scale approach. This is because the multi-scale approach considers porous and non-porous specimens as the same material, and information from the two sets of data are statistically correlated.",
            "Identifying a probabilistic fatigue model on the reduced data-set  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  is difficult due to an insufficient data-set, which makes several solutions possible. When considering the porous material as a new homogenised material, porous specimens may be considered to contain homogenised material with equivalent fatigue properties. A homogenised model is identified without using the multi-scale method, using the 0D identification procedure detailed in section  4.1  on the set  J J \\mathcal{J} caligraphic_J  of porous experimental data. This gives the fit shown by the red curve in Fig.  19 . While the fit is good on the porous specimens given the data, the model remains non-transferable to other types of pore populations. This is seen when extrapolating the homogenised porous model to the stress levels at which non-porous specimens were tested. The homogenised porous model overlaps with the non-porous experimental data, which is against the generally observed trend of porous material failing sooner than non-porous material.",
            "The influence of the mesh size on the median of the lifetime predicted by the model is studied in this subsection. A synthetic specimen with one pore was meshed at different levels of refinement. The two-line fatigue model with parameters taken from section  5.3  is taken. Figure  20  shows four different refinement levels, with the size of the smallest element going from 5 microns to 29 microns. Figure  21  shows the effect of these mesh sizes on the median lifetime, across several load levels. As seen in this figure, the median fatigue lifetime curve exhibits a dependence on mesh size. The lifetime curve for the mesh with the smallest element size of 5    \\mu italic_ m is identical to that for the 10    \\mu italic_ m mesh. The optimal mesh size, beyond which further refinement does not change the solution, therefore lies between 10 and 19    \\mu italic_ m.",
            "We will now generate synthetic data using the multi-scale method  A . A total of 10 cylindrical synthetically generated porous specimens were considered for data generation (examples of the geometries have previously been shown in section  10 ). For each synthetically generated porous specimen, 1000 samples each across 9 nominal loading levels were generated using this model, as shown by the green markers in Figure  24 .",
            "Using the 0D identification procedure as described in section  4.1 , the parameters of a fatigue lifetime model that maximized the likelihood of the synthetic generated data were obtained. This model  B  is a homogenised porous fatigue lifetime model. To check the quality of this homogenised model, a 3D mesh of a homogeneous pore-free cylindrical specimen of the same size and geometry as the porous cylindrical specimens was created (shown in Figure  24 (a)), and the model  B  was used to obtain predictions on it using the weakest link method developed in section  3.4 . The results, shown in Figure  24 (b), indicate that the homogenised model  B  works well to replace the multi-scale method for the given geometry.",
            "When optimisation is performed on only the non-porous data points (results shown in Fig.  12 ), we observe that the strain-life model with two lines (parameters  A A A italic_A ,    \\alpha italic_ ,  B B B italic_B ,    \\beta italic_  and  C C C italic_C ) and the model with one line (parameters  A A A italic_A ,    \\alpha italic_  and  C C C italic_C ) have the same quality of fit, i.e. there is no need for the second line when fitting data in only one regime (HCF regime). However, if more data is present, especially in the LCF regime, it is likely that both lines of the strain life model would be required to obtain a consistent fit. Fig.  12 (c) shows a significant decrease in the quality of the fit when the parameter  C C C italic_C  is omitted, which highlights its importance for getting a sensible fatigue limit. The probabilistic fatigue curves show a decrease in the uncertainty with increasing applied stress amplitude, which is a widely observed phenomenon in fatigue, and enforced with  g  1  (    2 ) superscript g 1   2 g^{-1}(\\frac{\\Delta\\varepsilon}{2}) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ end_ARG start_ARG 2 end_ARG )  in the numerator of the Weibull scale parameter, i.e. the scale reduces for higher loads and lower  N R subscript N R N_{R} italic_N start_POSTSUBSCRIPT italic_R end_POSTSUBSCRIPT  for a fixed shape parameter.",
            "When optimisation is performed on only the porous data points (results shown in Fig.  16 ) both the two-line model and one line model seem to give good fits. However, as the porous data points contain information about both LCF and HCF behavior of the alloy, it is better to work with the two-line strain-life model. Material points around pores that are highly loaded should behave in the LCF regime and points in the non-loaded zones should behave in the HCF regime."
        ]
    },
    "id_table_2": {
        "caption": "Table 2 :  Parameters of the elasto-plastic model  [ 28 ]",
        "table": "S2.F1.sf1.pic1.3.1.1",
        "footnotes": [
            ""
        ],
        "references": [
            "A computed tomography scan of a  12  13  3  mm 3 12 13 3 superscript mm 3 12\\times 13\\times 3\\,\\textrm{mm}^{3} 12  13  3 mm start_POSTSUPERSCRIPT 3 end_POSTSUPERSCRIPT  region of a planar specimen, made using the same porous material as the cylindrical specimens used for fatigue experiments, was carried out in order to get information on the pore characteristics likely to have caused fatigue failure. The planar specimen was cut from a larger slab, as was the case with the cylindrical specimens employed in fatigue testing. Thus, the pores in the planar specimen are also volumetric pores resulting from the manufacturing process. The resolution of the tomograph was   11    m similar-to absent 11  m \\sim 11\\,\\mu\\textrm{m}  11 italic_ m . The tomographic volume of interest was  424  1211  1000 424 1211 1000 424\\times 1211\\times 1000 424  1211  1000  voxels with 16-bit unsigned images. Segmentation of the pores was carried out using a threshold value in grey-level contrast levels, resulting in a binary 3D image of the pores. A surface mesh was generated using Avizo, employing smoothing to remove artefacts. The resulting surface mesh, illustrated in Fig.  2  is used in subsequent sections.",
            "The synthetically generated porous specimens have the same geometry as the specimens used for fatigue testing (Fig.  1 (a)), but with the pores inspired by the computed tomography (Fig.  2 ). These synthetically generated porous specimens thus resemble the traction specimens used for fatigue testing. The resulting meshes have linear elements with a piece-wise constant approximation of the stresses.",
            "The tomographic scan of the porous specimen used for getting information on pores was shown in Fig.  2 . A volume threshold is applied on this scan to exclude small pores. A pore is accepted if the radius of a sphere with the same volume as the pore is greater than  50 50 50 50     m  m \\mu m italic_ italic_m . This is justified by other authors, who show that in presence of large sized porosity, smaller pores have a negligible effect in fatigue life and that in the high cycle fatigue regime, cracks systematically originate from large pores  [ 37 ,  30 ,  4 ] . This size filter step is illustrated in Fig.  6 .",
            "A structure with a heterogeneous stress distribution, for example, a structure with pores that are explicitly meshed, or a structure with a notch, will have different values of the criterion (      superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ) in different elements of the structure for a given applied stress amplitude   a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT . We formally define a function       (  a ) :  a      :  superscript  subscript  a maps-to subscript  a  superscript  \\Delta\\varepsilon^{*}(\\Sigma_{a}):\\Sigma_{a}\\mapsto\\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ( roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT ) : roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT  roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  that maps the load applied to the structure as boundary condition to the fatigue criterion in element   *  . This function is computed by FEA. The probabilistic strain-life model developed in section  3.2  can subsequently be applied to all the elements of the FE mesh. The CDF of fatigue lifetime of a given element in the geometrically heterogeneous case is thus obtained as  F N R *  ( N ;      (  a ) , V  ,  ) subscript F superscript subscript N R * N  superscript  subscript  a superscript V  F_{N_{\\textrm{R}}^{\\textrm{*}}}(N;\\Delta\\varepsilon^{*}(\\Sigma_{a}),V^{*},\\mu) italic_F start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT * end_POSTSUPERSCRIPT end_POSTSUBSCRIPT ( italic_N ; roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ( roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT ) , italic_V start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT , italic_ ) , as given in equation ( 8 ).",
            "We now treat the case of structures with a fixed macroscopic geometry, that contains pores whose exact geometries and locations are unknown. In this case, no observations of the pore distribution in these structures were realized before fatigue testing, which makes the methodology presented in section  4.2 , with deterministic geometries, inapplicable. The purpose is to identify a lifetime distribution on fatigue data of structures accounting for all possible pore geometries and localization. This is done by taking an expectation over all the possible configurations of pore distributions in the structures. For example, if  J J \\mathcal{J} caligraphic_J  is the set of all the porous specimens of a given macroscopic geometry tested for fatigue failure, and  K K \\mathcal{K} caligraphic_K  is the set of all possible synthetically generated configurations of porous specimens, the parameters of the lifetime distribution are obtained using the following optimisation statement:",
            "The computational cost of this optimisation is broken down here. Elasto-static finite element computations are required to be performed once for  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT  synthetically generated porous specimens. The approximation of the criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  in all the elements of all the synthetic specimens, being a post-processing, takes virtually no time. As explained previously (section  4.2 ), the inverse function  g  1  (     2 ) superscript g 1  superscript  2 g^{-1}\\left(\\frac{\\Delta\\varepsilon^{*}}{2}\\right) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT end_ARG start_ARG 2 end_ARG )  needs to be computed for all elements of  n k subscript n k n_{\\textrm{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT  synthetic specimens, at every iteration of the optimisation process, for computation of the approximated expectation of the fatigue lifetime.",
            "Elasto-plastic computations (elasto-static FEA followed by Neuber-type elasto-plastic correction, as explained in section  3.3 ) were carried out on each of the synthetically generated porous specimens, for 9 nominal loading levels (  a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT  ranging from 20 to 100 MPa). We use the material parameters identified by  [ 28 ]  for the considered alloy. The parameters of the elasto-plastic model are recalled in table  2 . The boundary conditions (shown in Figure  9 ) replicates the experimental conditions under which the high-cycle fatigue data were obtained. Each loading sequence consisted of 20 symmetric tension-compression cycles ( R =  1 R 1 R=-1 italic_R = - 1 ), to allow for stabilization of the elasto-plastic response. The fatigue criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  in the stabilized (20 th ) cycle is extracted. An example of the criterion computation in two synthetically generated specimens for one of the nominal loading levels (  a = 80 subscript  a 80 \\Sigma_{a}=80 roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT = 80  MPa), is shown in Fig.  10 . In this figure, the axial stress-strain histories for some integration points having high values of       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  are shown, to highlight the stabilization of the stress-strain cycles.",
            "The multi-scale methodology is not required for identifying the parameters of the fatigue model on non-porous specimens, as the stress field is homogeneous in the gauge section. The maximum likelihood approach developed in section  4.1  is used to identify the parameters    \\mu italic_  of the fatigue model. Optimisation is carried out using the experimental fatigue lifetime data of non-porous specimens, as detailed in section  2 .",
            "The results of optimisation are presented in Fig.  12 . For all the models, it is observed that the solutions for the first and second fatigue models (equation ( 19 )(i) and (ii)) are similar, which suggests that the parameters  B B B italic_B  and    \\beta italic_ , i.e. the second line in the fatigue model, are not required. In our view, this conclusion would have been different had we had access to a richer data-set with more experiments across more loading levels. The third fatigue model (equation ( 19 )(iii)) shows a significant decrease in the quality of the fit, indicating the requirement for the parameter  C C C italic_C  for getting a meaningful fatigue limit beyond which the lifetime is infinite.",
            "The fatigue model is now identified on the experimental fatigue lifetime data of porous material presented in Section  2 . The multi-scale methodology developed in section  3  for structures with heterogeneous stress distributions due to pores whose exact geometries and locations are unknown is used. The maximum likelihood approach developed in section  4.3  was used as the identification procedure. From the previously defined set  K ~ ~ K \\tilde{K} over~ start_ARG italic_K end_ARG , a total of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  synthetic specimens were randomly selected for each ( N i ,  a i superscript N i superscript subscript  a i N^{i},\\Sigma_{a}^{i} italic_N start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT , roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT ) pair in order to approximate the expectation operator in the expression ( 18 ) of the likelihood function. 2 2 2 The value of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  is chosen to balance robustness and computational cost in the model identification process. The robustness increases with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT : each experimental point has a likelihood of failing from a larger variety of pore configurations, which is ideal as the exact pore distribution associated to the failure point is unknown. However, as will be discussed later, the computational cost increases linearly with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT .",
            "We now consider the fatigue lifetime data-set associated with non-porous and porous material presented in section  2 . A reduction of the non-porous fatigue lifetime data-set  I I \\mathcal{I} caligraphic_I  is done by randomly picking one experimental point for each applied stress amplitude level. The resulting reduced non-porous dataset  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  is shown in Fig.  18  (a).",
            "The influence of the mesh size on the median of the lifetime predicted by the model is studied in this subsection. A synthetic specimen with one pore was meshed at different levels of refinement. The two-line fatigue model with parameters taken from section  5.3  is taken. Figure  20  shows four different refinement levels, with the size of the smallest element going from 5 microns to 29 microns. Figure  21  shows the effect of these mesh sizes on the median lifetime, across several load levels. As seen in this figure, the median fatigue lifetime curve exhibits a dependence on mesh size. The lifetime curve for the mesh with the smallest element size of 5    \\mu italic_ m is identical to that for the 10    \\mu italic_ m mesh. The optimal mesh size, beyond which further refinement does not change the solution, therefore lies between 10 and 19    \\mu italic_ m.",
            "Thin specimens, transformed from a thicker specimen to have more surface area to volume ratio, while keeping the volume of the two specimens equal, have higher pore-surface interaction, and consequently have a lower lifetime - this effect has been reported before by other authors  [ 43 ,  5 ] . This effect is an automatic output of the two scale method introduced in this paper. Figure  22 (a) shows the geometries of two specimens: one specimen has radius  r r r italic_r  and length  L L L italic_L , the other specimen has radius  r / 4 r 4 r/4 italic_r / 4  and length  4 2  L superscript 4 2 L 4^{2}L 4 start_POSTSUPERSCRIPT 2 end_POSTSUPERSCRIPT italic_L  in order to keep the volume constant. Both of them are populated with pores using the same method presented in section  3.3 . For the thick specimen, the projected image of the pores (see Figure  22 (b)) shows a few pores interacting with the surface. The thin specimen, owing to lower cross-sectional area, has more pores interacting with the surface.",
            "To avoid the effect of randomness in pore distributions, the expected lifetime needs to be computed for both specimens. Similar to section  5.2 , a Wohler curve representing uncertainty due to varying pore distributions is constructed by combining samples from a certain number of realizations of synthetically generated pore fields in the two specimens. For each nominal stress level, the failure distribution representing this uncertainty in pore distributions is constructed by combining 1000 samples each from 10 different randomly generated realizations. The quantiles are then computed on 10000 samples for each nominal stress level, which are joined to construct the quantiles of the porous Wohler curve.",
            "The predictions of the fatigue lifetime model, shown in Fig.  22 (c), shows a decrease in the fatigue lifetime of a thinner specimen over all applied stress amplitude levels.",
            "As an automatic outcome of the model, specimens with different volumes but loaded under the same stress amplitude show a statistical size effect. Fig.  23  shows the Wohler curves of three synthetically generated porous specimens with volumes  V / 2 V 2 V/2 italic_V / 2 ,  V V V italic_V  and  2  V 2 V 2V 2 italic_V . The same pore population in the smallest specimen was tiled multiple times to get bigger specimens, to isolate only the specimen volume size effect (and not add lifetime variability due to changing pore distributions as demonstrated in section  5.2 ). Across all load levels, specimens with successively higher volumes show a decreasing fatigue lifetime. This is the well known statistical size effect in fatigue, i.e. bigger specimens have a larger probability of finding a critical flaw  [ 44 ,  45 ] .",
            "We will now generate synthetic data using the multi-scale method  A . A total of 10 cylindrical synthetically generated porous specimens were considered for data generation (examples of the geometries have previously been shown in section  10 ). For each synthetically generated porous specimen, 1000 samples each across 9 nominal loading levels were generated using this model, as shown by the green markers in Figure  24 .",
            "Using the 0D identification procedure as described in section  4.1 , the parameters of a fatigue lifetime model that maximized the likelihood of the synthetic generated data were obtained. This model  B  is a homogenised porous fatigue lifetime model. To check the quality of this homogenised model, a 3D mesh of a homogeneous pore-free cylindrical specimen of the same size and geometry as the porous cylindrical specimens was created (shown in Figure  24 (a)), and the model  B  was used to obtain predictions on it using the weakest link method developed in section  3.4 . The results, shown in Figure  24 (b), indicate that the homogenised model  B  works well to replace the multi-scale method for the given geometry.",
            "A geometry with a macroscopic notch was created, as shown in Fig.  25 . The sub-volume of pores used to create a porous version of this geometry was taken from the same tomography used to create the cylindrical porous specimens. Next, several configurations of the notched specimen were created:",
            "The criterion of the lifetime model was obtained on all these geometries via the plastic corrector methodology. The elements in the notched region were extracted for lifetime prediction, with the assumption that fatigue lifetime failure is influenced only by this volume. The extracted volumes of the different versions are shown in Fig.  26 . In the specimen with the normal expected pore density, there are two pores interacting with the notch that give rise to very high levels of plasticity. Concerning the specimen with removed surface-breaking pore interacting with the notch, there is a lesser amount of plasticity due to reduced pore-notch interaction. The specimen without pores has the least amount of plasticity, developing only due to the notch.",
            "We are now in a position to check the transferability of the homogenised model  B  to the notched geometry. Lifetime predictions (shown in  27 ) were obtained using the following configurations:",
            "The multi-scale method can be applied to arbitrary geometries for fatigue lifetime predictions. However, there is a need to explicitly mesh the pores in these geometries. This is because a homogenised model (simulating porous material behavior on the fatigue lifetime) that remains transferable across varying geometries of structures is difficult to obtain. The reasons for this difficulty are that (a) the core and surface materials exhibit different fatigue behaviour, as shown in section  6.2 , and (b) the homogenised model identified for one geometry cannot capture the pore-notch interaction in the notched geometries, as discussed in section  6.4 . Thus, there is a need to mesh the pores when using the multi-scale method for fatigue lifetime predictions on arbitrary geometries containing porous material.",
            "When optimisation is performed on only the non-porous data points (results shown in Fig.  12 ), we observe that the strain-life model with two lines (parameters  A A A italic_A ,    \\alpha italic_ ,  B B B italic_B ,    \\beta italic_  and  C C C italic_C ) and the model with one line (parameters  A A A italic_A ,    \\alpha italic_  and  C C C italic_C ) have the same quality of fit, i.e. there is no need for the second line when fitting data in only one regime (HCF regime). However, if more data is present, especially in the LCF regime, it is likely that both lines of the strain life model would be required to obtain a consistent fit. Fig.  12 (c) shows a significant decrease in the quality of the fit when the parameter  C C C italic_C  is omitted, which highlights its importance for getting a sensible fatigue limit. The probabilistic fatigue curves show a decrease in the uncertainty with increasing applied stress amplitude, which is a widely observed phenomenon in fatigue, and enforced with  g  1  (    2 ) superscript g 1   2 g^{-1}(\\frac{\\Delta\\varepsilon}{2}) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ end_ARG start_ARG 2 end_ARG )  in the numerator of the Weibull scale parameter, i.e. the scale reduces for higher loads and lower  N R subscript N R N_{R} italic_N start_POSTSUBSCRIPT italic_R end_POSTSUBSCRIPT  for a fixed shape parameter.",
            "For the example presented in this paper in section  5.2 , the two-line fatigue model (identified on the limited set of porous fatigue experiments, across a small range of loading levels) lacks information on distinguishing between the fatigue regimes. However, when the model is given some non-porous fatigue lifetime points at lower stress levels (in section  5.3 ), it learns to better differentiate between the two regimes of fatigue behaviour of the base material. The base material behavior in the HCF regime is identified using these non-porous points. In porous specimens, the base material near pores, being loaded at a higher level, informs the LCF fatigue behaviour. In other words, the model learns about different regimes of fatigue behavior of the base material from the lifetime data of the two grades of porosity.",
            "A plastic corrector is used for computation of the full-field       \\Delta\\varepsilon roman_ italic_  in the synthetically generated porous specimens  [ 26 ] . Figs.  28  and  29  show the quality of approximations as compared to a reference computation performed using the Z-Set suite  [ 46 ] . The plastic corrector approximates an elastoplastic solution pointwise using a plastic correction heuristic. The heuristic is a modified Neuber rule coupled with a local proportional evolution rule, which, along with the constitutive relations, form a closed set of equations which are solved for the approximated elasto-plastic response."
        ]
    },
    "id_table_3": {
        "caption": "",
        "table": "S2.F1.sf1.pic1.4.1.1.pic1.2.2",
        "footnotes": [],
        "references": [
            "The second scale, defined as the meso-scale, comprises tomography-informed pore distributions that are embedded in the base material containing the microstructural heterogeneity. This is shown schematically in Fig.  3 . The effects of the pore distribution on the fatigue lifetime are considered by explicitly modelling these pores via a finite element model (see Fig.  4 ). The sizes, shapes, and locations of pores with respect to other pores and the surfaces of the specimen all influence the fatigue lifetime. The meso-scale part of the model accounts for uncertainty due to varying pore distributions by synthetically generating them.",
            "In this section, a probabilistic element-wise strain life model (with two regimes) is developed. The element-wise model needs to be based on multiaxial criterion, as the local stress state for regions around the pores in specimens depicted in Fig.  3  is multiaxial. The fatigue lifetime of an element    E *\\in\\mathcal{E}   caligraphic_E  (where  E E \\mathcal{E} caligraphic_E  is the set of finite elements constituting a specimen) is obtained as a probability distribution, given a damage criterion      2  superscript  2 \\frac{\\Delta\\varepsilon^{*}}{2} divide start_ARG roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT end_ARG start_ARG 2 end_ARG  and the volume  V  superscript V V^{*} italic_V start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  of the element   *  .",
            "A structure with a heterogeneous stress distribution, for example, a structure with pores that are explicitly meshed, or a structure with a notch, will have different values of the criterion (      superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ) in different elements of the structure for a given applied stress amplitude   a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT . We formally define a function       (  a ) :  a      :  superscript  subscript  a maps-to subscript  a  superscript  \\Delta\\varepsilon^{*}(\\Sigma_{a}):\\Sigma_{a}\\mapsto\\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ( roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT ) : roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT  roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  that maps the load applied to the structure as boundary condition to the fatigue criterion in element   *  . This function is computed by FEA. The probabilistic strain-life model developed in section  3.2  can subsequently be applied to all the elements of the FE mesh. The CDF of fatigue lifetime of a given element in the geometrically heterogeneous case is thus obtained as  F N R *  ( N ;      (  a ) , V  ,  ) subscript F superscript subscript N R * N  superscript  subscript  a superscript V  F_{N_{\\textrm{R}}^{\\textrm{*}}}(N;\\Delta\\varepsilon^{*}(\\Sigma_{a}),V^{*},\\mu) italic_F start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT * end_POSTSUPERSCRIPT end_POSTSUBSCRIPT ( italic_N ; roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ( roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT ) , italic_V start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT , italic_ ) , as given in equation ( 8 ).",
            "We recall from section  3.4  that  f N R s subscript f superscript subscript N R s f_{N_{\\textrm{R}}^{\\textrm{s}}} italic_f start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT s end_POSTSUPERSCRIPT end_POSTSUBSCRIPT  is the PDF of the fatigue lifetime of a structure with a heterogeneous stress distribution. For specimens with a homogeneous stress distribution in their gauge section, i.e. without stress concentrations, the distribution of fatigue lifetime may be obtained without FEA.",
            "We remind the reader of the PDF of the fatigue lifetime of structures with a heterogeneous stress distribution  f N R s subscript f superscript subscript N R s f_{N_{\\textrm{R}}^{\\textrm{s}}} italic_f start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT s end_POSTSUPERSCRIPT end_POSTSUBSCRIPT  from section  3.4 . Structures with multiple distinct geometries can be taken into account here, provided that the exact geometries are known. This could, for example, be structures with different notch geometries, or porous specimens whose exact pore distribution is known for each of the specimens tested. In this case,  f N R s i subscript superscript f i superscript subscript N R s f^{i}_{N_{\\textrm{R}}^{\\textrm{s}}} italic_f start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT s end_POSTSUPERSCRIPT end_POSTSUBSCRIPT  for each distinct geometry  i i i italic_i  with fatigue lifetime  N i superscript N i N^{i} italic_N start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT  at load   a i superscript subscript  a i \\Sigma_{a}^{i} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT  is needed for identification of the model. For identification of the parameters of such a model, previous studies have used Bayesian calibration  [ 17 ]  or manual adjustment of parameters  [ 25 ] , especially on notched geometries. We use the maximum likelihood method:",
            "The set  K ~ ~ K \\tilde{K} over~ start_ARG italic_K end_ARG  is created with a total of 45 synthetically generated porous specimens  1 1 1 The size of the set  K ~ ~ K \\tilde{K} over~ start_ARG italic_K end_ARG  is limited to 45 as meshing and elasto-static finite element computations are required to be performed once for  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT  synthetically generated porous specimens. This step can become computationally expensive as the meshing and elastic computation time grows: each synthetic porous specimen contains between 1.5 to 3 million quadrature points  using the method detailed in section  3.3 .",
            "Elasto-plastic computations (elasto-static FEA followed by Neuber-type elasto-plastic correction, as explained in section  3.3 ) were carried out on each of the synthetically generated porous specimens, for 9 nominal loading levels (  a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT  ranging from 20 to 100 MPa). We use the material parameters identified by  [ 28 ]  for the considered alloy. The parameters of the elasto-plastic model are recalled in table  2 . The boundary conditions (shown in Figure  9 ) replicates the experimental conditions under which the high-cycle fatigue data were obtained. Each loading sequence consisted of 20 symmetric tension-compression cycles ( R =  1 R 1 R=-1 italic_R = - 1 ), to allow for stabilization of the elasto-plastic response. The fatigue criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  in the stabilized (20 th ) cycle is extracted. An example of the criterion computation in two synthetically generated specimens for one of the nominal loading levels (  a = 80 subscript  a 80 \\Sigma_{a}=80 roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT = 80  MPa), is shown in Fig.  10 . In this figure, the axial stress-strain histories for some integration points having high values of       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  are shown, to highlight the stabilization of the stress-strain cycles.",
            "The fatigue model is now identified on the experimental fatigue lifetime data of porous material presented in Section  2 . The multi-scale methodology developed in section  3  for structures with heterogeneous stress distributions due to pores whose exact geometries and locations are unknown is used. The maximum likelihood approach developed in section  4.3  was used as the identification procedure. From the previously defined set  K ~ ~ K \\tilde{K} over~ start_ARG italic_K end_ARG , a total of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  synthetic specimens were randomly selected for each ( N i ,  a i superscript N i superscript subscript  a i N^{i},\\Sigma_{a}^{i} italic_N start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT , roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT ) pair in order to approximate the expectation operator in the expression ( 18 ) of the likelihood function. 2 2 2 The value of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  is chosen to balance robustness and computational cost in the model identification process. The robustness increases with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT : each experimental point has a likelihood of failing from a larger variety of pore configurations, which is ideal as the exact pore distribution associated to the failure point is unknown. However, as will be discussed later, the computational cost increases linearly with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT .",
            "The parameters stabilise after a certain number of iterations of optimisation, as shown in the Fig.  13 (a) for the two-line fatigue model. In Fig.  13  we show an optimisation process that converges well due to good initialisation. Indeed, if the initialisation is very far away from the expected solution, the optimisation process does not yield satisfactory results.",
            "The influence of the mesh size on the median of the lifetime predicted by the model is studied in this subsection. A synthetic specimen with one pore was meshed at different levels of refinement. The two-line fatigue model with parameters taken from section  5.3  is taken. Figure  20  shows four different refinement levels, with the size of the smallest element going from 5 microns to 29 microns. Figure  21  shows the effect of these mesh sizes on the median lifetime, across several load levels. As seen in this figure, the median fatigue lifetime curve exhibits a dependence on mesh size. The lifetime curve for the mesh with the smallest element size of 5    \\mu italic_ m is identical to that for the 10    \\mu italic_ m mesh. The optimal mesh size, beyond which further refinement does not change the solution, therefore lies between 10 and 19    \\mu italic_ m.",
            "Thin specimens, transformed from a thicker specimen to have more surface area to volume ratio, while keeping the volume of the two specimens equal, have higher pore-surface interaction, and consequently have a lower lifetime - this effect has been reported before by other authors  [ 43 ,  5 ] . This effect is an automatic output of the two scale method introduced in this paper. Figure  22 (a) shows the geometries of two specimens: one specimen has radius  r r r italic_r  and length  L L L italic_L , the other specimen has radius  r / 4 r 4 r/4 italic_r / 4  and length  4 2  L superscript 4 2 L 4^{2}L 4 start_POSTSUPERSCRIPT 2 end_POSTSUPERSCRIPT italic_L  in order to keep the volume constant. Both of them are populated with pores using the same method presented in section  3.3 . For the thick specimen, the projected image of the pores (see Figure  22 (b)) shows a few pores interacting with the surface. The thin specimen, owing to lower cross-sectional area, has more pores interacting with the surface.",
            "As an automatic outcome of the model, specimens with different volumes but loaded under the same stress amplitude show a statistical size effect. Fig.  23  shows the Wohler curves of three synthetically generated porous specimens with volumes  V / 2 V 2 V/2 italic_V / 2 ,  V V V italic_V  and  2  V 2 V 2V 2 italic_V . The same pore population in the smallest specimen was tiled multiple times to get bigger specimens, to isolate only the specimen volume size effect (and not add lifetime variability due to changing pore distributions as demonstrated in section  5.2 ). Across all load levels, specimens with successively higher volumes show a decreasing fatigue lifetime. This is the well known statistical size effect in fatigue, i.e. bigger specimens have a larger probability of finding a critical flaw  [ 44 ,  45 ] .",
            "The multi-scale method developed in this paper is expensive to compute for entire structures, as several configurations of pore distributions need to be evaluated. In this section, we will try to replace the multi-scale method, termed  A , with a simplified, homogenised fatigue model, termed  B . For the identification of the homogenised model, we will generate synthetic data using the multi-scale method, for several realizations of pore distributions in a given geometry. The question is whether the homogenised model will accurately approximate the fatigue lifetime solution when applied to different geometries. The two-line fatigue model will be used for this study, with a fixed set of parameters (similar to those in section  5.3 ).",
            "Using the 0D identification procedure as described in section  4.1 , the parameters of a fatigue lifetime model that maximized the likelihood of the synthetic generated data were obtained. This model  B  is a homogenised porous fatigue lifetime model. To check the quality of this homogenised model, a 3D mesh of a homogeneous pore-free cylindrical specimen of the same size and geometry as the porous cylindrical specimens was created (shown in Figure  24 (a)), and the model  B  was used to obtain predictions on it using the weakest link method developed in section  3.4 . The results, shown in Figure  24 (b), indicate that the homogenised model  B  works well to replace the multi-scale method for the given geometry.",
            "For the example presented in this paper in section  5.2 , the two-line fatigue model (identified on the limited set of porous fatigue experiments, across a small range of loading levels) lacks information on distinguishing between the fatigue regimes. However, when the model is given some non-porous fatigue lifetime points at lower stress levels (in section  5.3 ), it learns to better differentiate between the two regimes of fatigue behaviour of the base material. The base material behavior in the HCF regime is identified using these non-porous points. In porous specimens, the base material near pores, being loaded at a higher level, informs the LCF fatigue behaviour. In other words, the model learns about different regimes of fatigue behavior of the base material from the lifetime data of the two grades of porosity."
        ]
    },
    "id_table_4": {
        "caption": "",
        "table": "S2.F1.sf1.pic1.5.1.1",
        "footnotes": [],
        "references": [
            "The second scale, defined as the meso-scale, comprises tomography-informed pore distributions that are embedded in the base material containing the microstructural heterogeneity. This is shown schematically in Fig.  3 . The effects of the pore distribution on the fatigue lifetime are considered by explicitly modelling these pores via a finite element model (see Fig.  4 ). The sizes, shapes, and locations of pores with respect to other pores and the surfaces of the specimen all influence the fatigue lifetime. The meso-scale part of the model accounts for uncertainty due to varying pore distributions by synthetically generating them.",
            "We recall from section  3.4  that  f N R s subscript f superscript subscript N R s f_{N_{\\textrm{R}}^{\\textrm{s}}} italic_f start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT s end_POSTSUPERSCRIPT end_POSTSUBSCRIPT  is the PDF of the fatigue lifetime of a structure with a heterogeneous stress distribution. For specimens with a homogeneous stress distribution in their gauge section, i.e. without stress concentrations, the distribution of fatigue lifetime may be obtained without FEA.",
            "We remind the reader of the PDF of the fatigue lifetime of structures with a heterogeneous stress distribution  f N R s subscript f superscript subscript N R s f_{N_{\\textrm{R}}^{\\textrm{s}}} italic_f start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT s end_POSTSUPERSCRIPT end_POSTSUBSCRIPT  from section  3.4 . Structures with multiple distinct geometries can be taken into account here, provided that the exact geometries are known. This could, for example, be structures with different notch geometries, or porous specimens whose exact pore distribution is known for each of the specimens tested. In this case,  f N R s i subscript superscript f i superscript subscript N R s f^{i}_{N_{\\textrm{R}}^{\\textrm{s}}} italic_f start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT s end_POSTSUPERSCRIPT end_POSTSUBSCRIPT  for each distinct geometry  i i i italic_i  with fatigue lifetime  N i superscript N i N^{i} italic_N start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT  at load   a i superscript subscript  a i \\Sigma_{a}^{i} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT  is needed for identification of the model. For identification of the parameters of such a model, previous studies have used Bayesian calibration  [ 17 ]  or manual adjustment of parameters  [ 25 ] , especially on notched geometries. We use the maximum likelihood method:",
            "We now treat the case of structures with a fixed macroscopic geometry, that contains pores whose exact geometries and locations are unknown. In this case, no observations of the pore distribution in these structures were realized before fatigue testing, which makes the methodology presented in section  4.2 , with deterministic geometries, inapplicable. The purpose is to identify a lifetime distribution on fatigue data of structures accounting for all possible pore geometries and localization. This is done by taking an expectation over all the possible configurations of pore distributions in the structures. For example, if  J J \\mathcal{J} caligraphic_J  is the set of all the porous specimens of a given macroscopic geometry tested for fatigue failure, and  K K \\mathcal{K} caligraphic_K  is the set of all possible synthetically generated configurations of porous specimens, the parameters of the lifetime distribution are obtained using the following optimisation statement:",
            "The computational cost of this optimisation is broken down here. Elasto-static finite element computations are required to be performed once for  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT  synthetically generated porous specimens. The approximation of the criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  in all the elements of all the synthetic specimens, being a post-processing, takes virtually no time. As explained previously (section  4.2 ), the inverse function  g  1  (     2 ) superscript g 1  superscript  2 g^{-1}\\left(\\frac{\\Delta\\varepsilon^{*}}{2}\\right) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT end_ARG start_ARG 2 end_ARG )  needs to be computed for all elements of  n k subscript n k n_{\\textrm{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT  synthetic specimens, at every iteration of the optimisation process, for computation of the approximated expectation of the fatigue lifetime.",
            "In this section, the behavior of the optimisation process presented in section  4  will be studied. The complexity of the fatigue model, i.e. number of required model parameters to fit lifetime data, will also be investigated. The data used is the previously presented experimental high-cycle fatigue data on non-porous and porous specimens (Figure  1 ). Finally, we will try to identify a fatigue model that is transferable between these two types of pore populations.",
            "The multi-scale methodology is not required for identifying the parameters of the fatigue model on non-porous specimens, as the stress field is homogeneous in the gauge section. The maximum likelihood approach developed in section  4.1  is used to identify the parameters    \\mu italic_  of the fatigue model. Optimisation is carried out using the experimental fatigue lifetime data of non-porous specimens, as detailed in section  2 .",
            "The fatigue model is now identified on the experimental fatigue lifetime data of porous material presented in Section  2 . The multi-scale methodology developed in section  3  for structures with heterogeneous stress distributions due to pores whose exact geometries and locations are unknown is used. The maximum likelihood approach developed in section  4.3  was used as the identification procedure. From the previously defined set  K ~ ~ K \\tilde{K} over~ start_ARG italic_K end_ARG , a total of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  synthetic specimens were randomly selected for each ( N i ,  a i superscript N i superscript subscript  a i N^{i},\\Sigma_{a}^{i} italic_N start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT , roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT ) pair in order to approximate the expectation operator in the expression ( 18 ) of the likelihood function. 2 2 2 The value of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  is chosen to balance robustness and computational cost in the model identification process. The robustness increases with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT : each experimental point has a likelihood of failing from a larger variety of pore configurations, which is ideal as the exact pore distribution associated to the failure point is unknown. However, as will be discussed later, the computational cost increases linearly with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT .",
            "Fatigue lifetime distributions for multiple realizations of synthetically generated porous specimens of the same volume but varying pore distributions (examples previously shown in  10 ) were obtained, at various nominal loading levels. The synthetically generated porous specimens show variations in their fatigue lifetime distributions, as shown in Fig.  14  for two different nominal applied stress amplitude levels, or in Fig.  15  for the entire Wohler curve for a couple of specimens.",
            "A fatigue lifetime distribution or Wohler curve representing uncertainty due to pore distributions can be constructed by combining samples from a certain number of porous specimens. The failure distribution representing this uncertainty in pore distributions is constructed by combining 1000 samples each from 10 different randomly generated porous test specimens (shown by the red histogram in Fig.  14 (c,d)). The quantiles are then computed on 10000 samples for each nominal stress level, which are joined to construct the quantiles of the porous Wohler curve (shown by the red area in Fig.  15 ). This failure distribution or Wohler curve represents uncertainty due to defects at two scales - micro-heterogeneity and varying pore distributions. We note that the uncertainty in fatigue lifetime due to varying pore distributions in the specimen is relatively low as compared to the uncertainty due to the micro-heterogeneity. In other words, at the scale of this specimen, the impact of varying pore distributions on the lifetime is not high. This is because of the volume of the specimen, which is large as compared to the pore size, which increases the likelihood of finding critical pore configurations in all the specimens, and makes all the synthetic specimens have similar stress distributions.",
            "Here, we are identifying the fatigue lifetime model on both structures with homogeneous stress distributions (non-porous specimens) and structures with pores whose exact distribution is unknown (porous specimens) simultaneously. The function to minimize is taken as a sum of the functions defined in section  4 :",
            "Identifying a probabilistic fatigue model on the reduced data-set  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  is difficult due to an insufficient data-set, which makes several solutions possible. When considering the porous material as a new homogenised material, porous specimens may be considered to contain homogenised material with equivalent fatigue properties. A homogenised model is identified without using the multi-scale method, using the 0D identification procedure detailed in section  4.1  on the set  J J \\mathcal{J} caligraphic_J  of porous experimental data. This gives the fit shown by the red curve in Fig.  19 . While the fit is good on the porous specimens given the data, the model remains non-transferable to other types of pore populations. This is seen when extrapolating the homogenised porous model to the stress levels at which non-porous specimens were tested. The homogenised porous model overlaps with the non-porous experimental data, which is against the generally observed trend of porous material failing sooner than non-porous material.",
            "We will now generate synthetic data using the multi-scale method  A . A total of 10 cylindrical synthetically generated porous specimens were considered for data generation (examples of the geometries have previously been shown in section  10 ). For each synthetically generated porous specimen, 1000 samples each across 9 nominal loading levels were generated using this model, as shown by the green markers in Figure  24 .",
            "Using the 0D identification procedure as described in section  4.1 , the parameters of a fatigue lifetime model that maximized the likelihood of the synthetic generated data were obtained. This model  B  is a homogenised porous fatigue lifetime model. To check the quality of this homogenised model, a 3D mesh of a homogeneous pore-free cylindrical specimen of the same size and geometry as the porous cylindrical specimens was created (shown in Figure  24 (a)), and the model  B  was used to obtain predictions on it using the weakest link method developed in section  3.4 . The results, shown in Figure  24 (b), indicate that the homogenised model  B  works well to replace the multi-scale method for the given geometry.",
            "The multi-scale method can be applied to arbitrary geometries for fatigue lifetime predictions. However, there is a need to explicitly mesh the pores in these geometries. This is because a homogenised model (simulating porous material behavior on the fatigue lifetime) that remains transferable across varying geometries of structures is difficult to obtain. The reasons for this difficulty are that (a) the core and surface materials exhibit different fatigue behaviour, as shown in section  6.2 , and (b) the homogenised model identified for one geometry cannot capture the pore-notch interaction in the notched geometries, as discussed in section  6.4 . Thus, there is a need to mesh the pores when using the multi-scale method for fatigue lifetime predictions on arbitrary geometries containing porous material."
        ]
    },
    "id_table_5": {
        "caption": "",
        "table": "S2.F1.sf1.pic1.6.1.1",
        "footnotes": [],
        "references": [
            "where  A A A italic_A  and    \\alpha italic_  correspond to the parameters of the high-cycle fatigue (HCF) line,  B B B italic_B  and    \\beta italic_  correspond to the parameters of the low-cycle fatigue (LCF) line and  C C C italic_C  controls the fatigue limit, as illustrated in Fig.  5 . As local plasticity may appear depending on the loading in the element,       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  is computed in the stabilized cycle with period  T c subscript T c \\mathcal{T}_{c} caligraphic_T start_POSTSUBSCRIPT italic_c end_POSTSUBSCRIPT , in the following manner  [ 15 ] :",
            "As defined previously (section  5.1 ), the cases correspond to (i) the two-line fatigue model and (ii) the one-line fatigue model.",
            "Fatigue lifetime distributions for multiple realizations of synthetically generated porous specimens of the same volume but varying pore distributions (examples previously shown in  10 ) were obtained, at various nominal loading levels. The synthetically generated porous specimens show variations in their fatigue lifetime distributions, as shown in Fig.  14  for two different nominal applied stress amplitude levels, or in Fig.  15  for the entire Wohler curve for a couple of specimens.",
            "A fatigue lifetime distribution or Wohler curve representing uncertainty due to pore distributions can be constructed by combining samples from a certain number of porous specimens. The failure distribution representing this uncertainty in pore distributions is constructed by combining 1000 samples each from 10 different randomly generated porous test specimens (shown by the red histogram in Fig.  14 (c,d)). The quantiles are then computed on 10000 samples for each nominal stress level, which are joined to construct the quantiles of the porous Wohler curve (shown by the red area in Fig.  15 ). This failure distribution or Wohler curve represents uncertainty due to defects at two scales - micro-heterogeneity and varying pore distributions. We note that the uncertainty in fatigue lifetime due to varying pore distributions in the specimen is relatively low as compared to the uncertainty due to the micro-heterogeneity. In other words, at the scale of this specimen, the impact of varying pore distributions on the lifetime is not high. This is because of the volume of the specimen, which is large as compared to the pore size, which increases the likelihood of finding critical pore configurations in all the specimens, and makes all the synthetic specimens have similar stress distributions.",
            "The influence of the mesh size on the median of the lifetime predicted by the model is studied in this subsection. A synthetic specimen with one pore was meshed at different levels of refinement. The two-line fatigue model with parameters taken from section  5.3  is taken. Figure  20  shows four different refinement levels, with the size of the smallest element going from 5 microns to 29 microns. Figure  21  shows the effect of these mesh sizes on the median lifetime, across several load levels. As seen in this figure, the median fatigue lifetime curve exhibits a dependence on mesh size. The lifetime curve for the mesh with the smallest element size of 5    \\mu italic_ m is identical to that for the 10    \\mu italic_ m mesh. The optimal mesh size, beyond which further refinement does not change the solution, therefore lies between 10 and 19    \\mu italic_ m.",
            "To avoid the effect of randomness in pore distributions, the expected lifetime needs to be computed for both specimens. Similar to section  5.2 , a Wohler curve representing uncertainty due to varying pore distributions is constructed by combining samples from a certain number of realizations of synthetically generated pore fields in the two specimens. For each nominal stress level, the failure distribution representing this uncertainty in pore distributions is constructed by combining 1000 samples each from 10 different randomly generated realizations. The quantiles are then computed on 10000 samples for each nominal stress level, which are joined to construct the quantiles of the porous Wohler curve.",
            "As an automatic outcome of the model, specimens with different volumes but loaded under the same stress amplitude show a statistical size effect. Fig.  23  shows the Wohler curves of three synthetically generated porous specimens with volumes  V / 2 V 2 V/2 italic_V / 2 ,  V V V italic_V  and  2  V 2 V 2V 2 italic_V . The same pore population in the smallest specimen was tiled multiple times to get bigger specimens, to isolate only the specimen volume size effect (and not add lifetime variability due to changing pore distributions as demonstrated in section  5.2 ). Across all load levels, specimens with successively higher volumes show a decreasing fatigue lifetime. This is the well known statistical size effect in fatigue, i.e. bigger specimens have a larger probability of finding a critical flaw  [ 44 ,  45 ] .",
            "The multi-scale method developed in this paper is expensive to compute for entire structures, as several configurations of pore distributions need to be evaluated. In this section, we will try to replace the multi-scale method, termed  A , with a simplified, homogenised fatigue model, termed  B . For the identification of the homogenised model, we will generate synthetic data using the multi-scale method, for several realizations of pore distributions in a given geometry. The question is whether the homogenised model will accurately approximate the fatigue lifetime solution when applied to different geometries. The two-line fatigue model will be used for this study, with a fixed set of parameters (similar to those in section  5.3 ).",
            "A geometry with a macroscopic notch was created, as shown in Fig.  25 . The sub-volume of pores used to create a porous version of this geometry was taken from the same tomography used to create the cylindrical porous specimens. Next, several configurations of the notched specimen were created:",
            "For the example presented in this paper in section  5.2 , the two-line fatigue model (identified on the limited set of porous fatigue experiments, across a small range of loading levels) lacks information on distinguishing between the fatigue regimes. However, when the model is given some non-porous fatigue lifetime points at lower stress levels (in section  5.3 ), it learns to better differentiate between the two regimes of fatigue behaviour of the base material. The base material behavior in the HCF regime is identified using these non-porous points. In porous specimens, the base material near pores, being loaded at a higher level, informs the LCF fatigue behaviour. In other words, the model learns about different regimes of fatigue behavior of the base material from the lifetime data of the two grades of porosity."
        ]
    },
    "id_table_6": {
        "caption": "",
        "table": "S2.F1.sf1.pic1.7.1.1.pic1.1.1",
        "footnotes": [],
        "references": [
            "The tomographic scan of the porous specimen used for getting information on pores was shown in Fig.  2 . A volume threshold is applied on this scan to exclude small pores. A pore is accepted if the radius of a sphere with the same volume as the pore is greater than  50 50 50 50     m  m \\mu m italic_ italic_m . This is justified by other authors, who show that in presence of large sized porosity, smaller pores have a negligible effect in fatigue life and that in the high cycle fatigue regime, cracks systematically originate from large pores  [ 37 ,  30 ,  4 ] . This size filter step is illustrated in Fig.  6 .",
            "The comparison between a two-line strain life model and one line strain life model is shown in Fig.  16 . The two models (with four and six parameters) yield qualitatively similar probability distributions for the specimen fatigue lifetime (with the 6 parameter model having only a very slightly lower likelihood value than the one obtained using the 4 parameter model). We will further investigate the more general two-line strain-life model with 6 parameters, to allow for the possibility of two distinct regimes.",
            "The criterion of the lifetime model was obtained on all these geometries via the plastic corrector methodology. The elements in the notched region were extracted for lifetime prediction, with the assumption that fatigue lifetime failure is influenced only by this volume. The extracted volumes of the different versions are shown in Fig.  26 . In the specimen with the normal expected pore density, there are two pores interacting with the notch that give rise to very high levels of plasticity. Concerning the specimen with removed surface-breaking pore interacting with the notch, there is a lesser amount of plasticity due to reduced pore-notch interaction. The specimen without pores has the least amount of plasticity, developing only due to the notch.",
            "The multi-scale method can be applied to arbitrary geometries for fatigue lifetime predictions. However, there is a need to explicitly mesh the pores in these geometries. This is because a homogenised model (simulating porous material behavior on the fatigue lifetime) that remains transferable across varying geometries of structures is difficult to obtain. The reasons for this difficulty are that (a) the core and surface materials exhibit different fatigue behaviour, as shown in section  6.2 , and (b) the homogenised model identified for one geometry cannot capture the pore-notch interaction in the notched geometries, as discussed in section  6.4 . Thus, there is a need to mesh the pores when using the multi-scale method for fatigue lifetime predictions on arbitrary geometries containing porous material.",
            "When optimisation is performed on only the porous data points (results shown in Fig.  16 ) both the two-line model and one line model seem to give good fits. However, as the porous data points contain information about both LCF and HCF behavior of the alloy, it is better to work with the two-line strain-life model. Material points around pores that are highly loaded should behave in the LCF regime and points in the non-loaded zones should behave in the HCF regime."
        ]
    },
    "id_table_7": {
        "caption": "",
        "table": "S2.F1.sf1.pic1.8.1.1",
        "footnotes": [],
        "references": [
            "Surface meshes of the remaining pores after the size-filtering step were obtained using smoothing based on a criterion on sharp angles between surfaces of the pores - the original surfaces from the tomography and the remeshed surfaces are shown in Fig.  7 . This smoothing is done to facilitate finite element meshing.",
            "To illustrate the computational complexity involved, we note that the computing the Weibull scale parameter of the structure,   s superscript  s \\lambda^{s} italic_ start_POSTSUPERSCRIPT italic_s end_POSTSUPERSCRIPT , requires summing the Weibull scale parameters,    \\lambda italic_ , of all elements in the FE mesh (equation ( 11 )). This result is then used to compute  f N R s subscript f superscript subscript N R s f_{N_{\\textrm{R}}^{\\textrm{s}}} italic_f start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT s end_POSTSUPERSCRIPT end_POSTSUBSCRIPT . The scale parameters of the elements in turn require the computation of the inverse function  g  1  (     2 ) superscript g 1  superscript  2 g^{-1}\\left(\\frac{\\Delta\\varepsilon^{*}}{2}\\right) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT end_ARG start_ARG 2 end_ARG )  for each element (equation ( 7 )). The criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  is obtained for all the elements by one elasto-static finite element computation combined with the Neuber-type element-wise plastic correction algorithm, and does not need to be re-computed during the optimisation process. As the inverse function  g  1  (     2 ) superscript g 1  superscript  2 g^{-1}\\left(\\frac{\\Delta\\varepsilon^{*}}{2}\\right) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT end_ARG start_ARG 2 end_ARG )  depends on some of the parameters of the fatigue model ( A A A italic_A ,  B B B italic_B ,    \\alpha italic_  and    \\beta italic_ ), it needs to be re-computed for all the elements at every iteration of the optimisation process.",
            "Ideally we should also be able to predict the fatigue lifetime of porous materials with different pore distributions than the ones that were experimentally tested. Using the two-line fatigue model identified on the porous data, we try to predict the fatigue behavior of a non-porous specimen. The results are shown in Fig.  17 . We see that the prediction on the non-porous specimens is incorrect. The predicted lifetime is lower than what experiments suggest. This could be due to three reasons:",
            "We are now in a position to check the transferability of the homogenised model  B  to the notched geometry. Lifetime predictions (shown in  27 ) were obtained using the following configurations:"
        ]
    },
    "id_table_8": {
        "caption": "",
        "table": "S2.F1.sf1.pic1.9.1.1.pic1.1.1",
        "footnotes": [],
        "references": [
            "The previous two steps were carried out 100 times, to get 100 such specimens each with a different region of pores (illustrated in Fig.  8  (a)).",
            "Elements in the porous subvolumes of these 100 specimens are extracted. A random combination of porous sub-volumes that equal the volume of the gauge section of the cylindrical specimen makes up one synthetically generated porous specimen (illustrated in Fig.  8  (b)).",
            "A structure with a heterogeneous stress distribution, for example, a structure with pores that are explicitly meshed, or a structure with a notch, will have different values of the criterion (      superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ) in different elements of the structure for a given applied stress amplitude   a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT . We formally define a function       (  a ) :  a      :  superscript  subscript  a maps-to subscript  a  superscript  \\Delta\\varepsilon^{*}(\\Sigma_{a}):\\Sigma_{a}\\mapsto\\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ( roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT ) : roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT  roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  that maps the load applied to the structure as boundary condition to the fatigue criterion in element   *  . This function is computed by FEA. The probabilistic strain-life model developed in section  3.2  can subsequently be applied to all the elements of the FE mesh. The CDF of fatigue lifetime of a given element in the geometrically heterogeneous case is thus obtained as  F N R *  ( N ;      (  a ) , V  ,  ) subscript F superscript subscript N R * N  superscript  subscript  a superscript V  F_{N_{\\textrm{R}}^{\\textrm{*}}}(N;\\Delta\\varepsilon^{*}(\\Sigma_{a}),V^{*},\\mu) italic_F start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT * end_POSTSUPERSCRIPT end_POSTSUBSCRIPT ( italic_N ; roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT ( roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT ) , italic_V start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT , italic_ ) , as given in equation ( 8 ).",
            "The fatigue model is now identified on the experimental fatigue lifetime data of porous material presented in Section  2 . The multi-scale methodology developed in section  3  for structures with heterogeneous stress distributions due to pores whose exact geometries and locations are unknown is used. The maximum likelihood approach developed in section  4.3  was used as the identification procedure. From the previously defined set  K ~ ~ K \\tilde{K} over~ start_ARG italic_K end_ARG , a total of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  synthetic specimens were randomly selected for each ( N i ,  a i superscript N i superscript subscript  a i N^{i},\\Sigma_{a}^{i} italic_N start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT , roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT ) pair in order to approximate the expectation operator in the expression ( 18 ) of the likelihood function. 2 2 2 The value of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  is chosen to balance robustness and computational cost in the model identification process. The robustness increases with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT : each experimental point has a likelihood of failing from a larger variety of pore configurations, which is ideal as the exact pore distribution associated to the failure point is unknown. However, as will be discussed later, the computational cost increases linearly with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT .",
            "We now consider the fatigue lifetime data-set associated with non-porous and porous material presented in section  2 . A reduction of the non-porous fatigue lifetime data-set  I I \\mathcal{I} caligraphic_I  is done by randomly picking one experimental point for each applied stress amplitude level. The resulting reduced non-porous dataset  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  is shown in Fig.  18  (a).",
            "The model parameters are jointly identified on the reduced non-porous data-set  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  and the porous data-set  J J \\mathcal{J} caligraphic_J . The result of the optimisation process is shown in Fig.  18 . The fit is consistent on both the non-porous as well as porous cases, despite the reduction of non-porous data. This indicates that fewer fatigue experiments are required to identify the parameters when using the multi-scale approach. This is because the multi-scale approach considers porous and non-porous specimens as the same material, and information from the two sets of data are statistically correlated.",
            "A plastic corrector is used for computation of the full-field       \\Delta\\varepsilon roman_ italic_  in the synthetically generated porous specimens  [ 26 ] . Figs.  28  and  29  show the quality of approximations as compared to a reference computation performed using the Z-Set suite  [ 46 ] . The plastic corrector approximates an elastoplastic solution pointwise using a plastic correction heuristic. The heuristic is a modified Neuber rule coupled with a local proportional evolution rule, which, along with the constitutive relations, form a closed set of equations which are solved for the approximated elasto-plastic response."
        ]
    },
    "id_table_9": {
        "caption": "",
        "table": "S3.F3.pic1.3.1.1",
        "footnotes": [],
        "references": [
            "Elasto-plastic computations (elasto-static FEA followed by Neuber-type elasto-plastic correction, as explained in section  3.3 ) were carried out on each of the synthetically generated porous specimens, for 9 nominal loading levels (  a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT  ranging from 20 to 100 MPa). We use the material parameters identified by  [ 28 ]  for the considered alloy. The parameters of the elasto-plastic model are recalled in table  2 . The boundary conditions (shown in Figure  9 ) replicates the experimental conditions under which the high-cycle fatigue data were obtained. Each loading sequence consisted of 20 symmetric tension-compression cycles ( R =  1 R 1 R=-1 italic_R = - 1 ), to allow for stabilization of the elasto-plastic response. The fatigue criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  in the stabilized (20 th ) cycle is extracted. An example of the criterion computation in two synthetically generated specimens for one of the nominal loading levels (  a = 80 subscript  a 80 \\Sigma_{a}=80 roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT = 80  MPa), is shown in Fig.  10 . In this figure, the axial stress-strain histories for some integration points having high values of       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  are shown, to highlight the stabilization of the stress-strain cycles.",
            "For all three models, the optimizer (Nelder-Mead) converges towards solutions with very similar likelihood values. The evolution of the parameters and the solution for the two-line fatigue model (equation ( 19 )(i)) is shown in Fig.  11 . Even for an initialisation that is far away from the solution at convergence, the optimisation process is well behaved, as seen by the intermediate and final solutions in Fig.  11 (b-f).",
            "The results of optimisation are presented in Fig.  12 . For all the models, it is observed that the solutions for the first and second fatigue models (equation ( 19 )(i) and (ii)) are similar, which suggests that the parameters  B B B italic_B  and    \\beta italic_ , i.e. the second line in the fatigue model, are not required. In our view, this conclusion would have been different had we had access to a richer data-set with more experiments across more loading levels. The third fatigue model (equation ( 19 )(iii)) shows a significant decrease in the quality of the fit, indicating the requirement for the parameter  C C C italic_C  for getting a meaningful fatigue limit beyond which the lifetime is infinite.",
            "Identifying a probabilistic fatigue model on the reduced data-set  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  is difficult due to an insufficient data-set, which makes several solutions possible. When considering the porous material as a new homogenised material, porous specimens may be considered to contain homogenised material with equivalent fatigue properties. A homogenised model is identified without using the multi-scale method, using the 0D identification procedure detailed in section  4.1  on the set  J J \\mathcal{J} caligraphic_J  of porous experimental data. This gives the fit shown by the red curve in Fig.  19 . While the fit is good on the porous specimens given the data, the model remains non-transferable to other types of pore populations. This is seen when extrapolating the homogenised porous model to the stress levels at which non-porous specimens were tested. The homogenised porous model overlaps with the non-porous experimental data, which is against the generally observed trend of porous material failing sooner than non-porous material.",
            "A plastic corrector is used for computation of the full-field       \\Delta\\varepsilon roman_ italic_  in the synthetically generated porous specimens  [ 26 ] . Figs.  28  and  29  show the quality of approximations as compared to a reference computation performed using the Z-Set suite  [ 46 ] . The plastic corrector approximates an elastoplastic solution pointwise using a plastic correction heuristic. The heuristic is a modified Neuber rule coupled with a local proportional evolution rule, which, along with the constitutive relations, form a closed set of equations which are solved for the approximated elasto-plastic response."
        ]
    },
    "id_table_10": {
        "caption": "",
        "table": "S3.F3.pic1.4.1.1",
        "footnotes": [],
        "references": [
            "Elasto-plastic computations (elasto-static FEA followed by Neuber-type elasto-plastic correction, as explained in section  3.3 ) were carried out on each of the synthetically generated porous specimens, for 9 nominal loading levels (  a subscript  a \\Sigma_{a} roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT  ranging from 20 to 100 MPa). We use the material parameters identified by  [ 28 ]  for the considered alloy. The parameters of the elasto-plastic model are recalled in table  2 . The boundary conditions (shown in Figure  9 ) replicates the experimental conditions under which the high-cycle fatigue data were obtained. Each loading sequence consisted of 20 symmetric tension-compression cycles ( R =  1 R 1 R=-1 italic_R = - 1 ), to allow for stabilization of the elasto-plastic response. The fatigue criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  in the stabilized (20 th ) cycle is extracted. An example of the criterion computation in two synthetically generated specimens for one of the nominal loading levels (  a = 80 subscript  a 80 \\Sigma_{a}=80 roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT = 80  MPa), is shown in Fig.  10 . In this figure, the axial stress-strain histories for some integration points having high values of       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  are shown, to highlight the stabilization of the stress-strain cycles.",
            "Fatigue lifetime distributions for multiple realizations of synthetically generated porous specimens of the same volume but varying pore distributions (examples previously shown in  10 ) were obtained, at various nominal loading levels. The synthetically generated porous specimens show variations in their fatigue lifetime distributions, as shown in Fig.  14  for two different nominal applied stress amplitude levels, or in Fig.  15  for the entire Wohler curve for a couple of specimens.",
            "We will now generate synthetic data using the multi-scale method  A . A total of 10 cylindrical synthetically generated porous specimens were considered for data generation (examples of the geometries have previously been shown in section  10 ). For each synthetically generated porous specimen, 1000 samples each across 9 nominal loading levels were generated using this model, as shown by the green markers in Figure  24 ."
        ]
    },
    "id_table_11": {
        "caption": "",
        "table": "S3.F3.pic1.5.1.1",
        "footnotes": [],
        "references": [
            "To illustrate the computational complexity involved, we note that the computing the Weibull scale parameter of the structure,   s superscript  s \\lambda^{s} italic_ start_POSTSUPERSCRIPT italic_s end_POSTSUPERSCRIPT , requires summing the Weibull scale parameters,    \\lambda italic_ , of all elements in the FE mesh (equation ( 11 )). This result is then used to compute  f N R s subscript f superscript subscript N R s f_{N_{\\textrm{R}}^{\\textrm{s}}} italic_f start_POSTSUBSCRIPT italic_N start_POSTSUBSCRIPT R end_POSTSUBSCRIPT start_POSTSUPERSCRIPT s end_POSTSUPERSCRIPT end_POSTSUBSCRIPT . The scale parameters of the elements in turn require the computation of the inverse function  g  1  (     2 ) superscript g 1  superscript  2 g^{-1}\\left(\\frac{\\Delta\\varepsilon^{*}}{2}\\right) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT end_ARG start_ARG 2 end_ARG )  for each element (equation ( 7 )). The criterion       superscript  \\Delta\\varepsilon^{*} roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT  is obtained for all the elements by one elasto-static finite element computation combined with the Neuber-type element-wise plastic correction algorithm, and does not need to be re-computed during the optimisation process. As the inverse function  g  1  (     2 ) superscript g 1  superscript  2 g^{-1}\\left(\\frac{\\Delta\\varepsilon^{*}}{2}\\right) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ start_POSTSUPERSCRIPT  end_POSTSUPERSCRIPT end_ARG start_ARG 2 end_ARG )  depends on some of the parameters of the fatigue model ( A A A italic_A ,  B B B italic_B ,    \\alpha italic_  and    \\beta italic_ ), it needs to be re-computed for all the elements at every iteration of the optimisation process.",
            "For all three models, the optimizer (Nelder-Mead) converges towards solutions with very similar likelihood values. The evolution of the parameters and the solution for the two-line fatigue model (equation ( 19 )(i)) is shown in Fig.  11 . Even for an initialisation that is far away from the solution at convergence, the optimisation process is well behaved, as seen by the intermediate and final solutions in Fig.  11 (b-f)."
        ]
    },
    "id_table_12": {
        "caption": "",
        "table": "S3.F3.pic1.6.1.1",
        "footnotes": [],
        "references": [
            "The results of optimisation are presented in Fig.  12 . For all the models, it is observed that the solutions for the first and second fatigue models (equation ( 19 )(i) and (ii)) are similar, which suggests that the parameters  B B B italic_B  and    \\beta italic_ , i.e. the second line in the fatigue model, are not required. In our view, this conclusion would have been different had we had access to a richer data-set with more experiments across more loading levels. The third fatigue model (equation ( 19 )(iii)) shows a significant decrease in the quality of the fit, indicating the requirement for the parameter  C C C italic_C  for getting a meaningful fatigue limit beyond which the lifetime is infinite.",
            "When optimisation is performed on only the non-porous data points (results shown in Fig.  12 ), we observe that the strain-life model with two lines (parameters  A A A italic_A ,    \\alpha italic_ ,  B B B italic_B ,    \\beta italic_  and  C C C italic_C ) and the model with one line (parameters  A A A italic_A ,    \\alpha italic_  and  C C C italic_C ) have the same quality of fit, i.e. there is no need for the second line when fitting data in only one regime (HCF regime). However, if more data is present, especially in the LCF regime, it is likely that both lines of the strain life model would be required to obtain a consistent fit. Fig.  12 (c) shows a significant decrease in the quality of the fit when the parameter  C C C italic_C  is omitted, which highlights its importance for getting a sensible fatigue limit. The probabilistic fatigue curves show a decrease in the uncertainty with increasing applied stress amplitude, which is a widely observed phenomenon in fatigue, and enforced with  g  1  (    2 ) superscript g 1   2 g^{-1}(\\frac{\\Delta\\varepsilon}{2}) italic_g start_POSTSUPERSCRIPT - 1 end_POSTSUPERSCRIPT ( divide start_ARG roman_ italic_ end_ARG start_ARG 2 end_ARG )  in the numerator of the Weibull scale parameter, i.e. the scale reduces for higher loads and lower  N R subscript N R N_{R} italic_N start_POSTSUBSCRIPT italic_R end_POSTSUBSCRIPT  for a fixed shape parameter."
        ]
    },
    "id_table_13": {
        "caption": "",
        "table": "S3.F3.pic1.7.1.1",
        "footnotes": [],
        "references": [
            "The parameters stabilise after a certain number of iterations of optimisation, as shown in the Fig.  13 (a) for the two-line fatigue model. In Fig.  13  we show an optimisation process that converges well due to good initialisation. Indeed, if the initialisation is very far away from the expected solution, the optimisation process does not yield satisfactory results."
        ]
    },
    "id_table_14": {
        "caption": "",
        "table": "S3.F3.pic1.8.1.1",
        "footnotes": [],
        "references": [
            "Fatigue lifetime distributions for multiple realizations of synthetically generated porous specimens of the same volume but varying pore distributions (examples previously shown in  10 ) were obtained, at various nominal loading levels. The synthetically generated porous specimens show variations in their fatigue lifetime distributions, as shown in Fig.  14  for two different nominal applied stress amplitude levels, or in Fig.  15  for the entire Wohler curve for a couple of specimens.",
            "A fatigue lifetime distribution or Wohler curve representing uncertainty due to pore distributions can be constructed by combining samples from a certain number of porous specimens. The failure distribution representing this uncertainty in pore distributions is constructed by combining 1000 samples each from 10 different randomly generated porous test specimens (shown by the red histogram in Fig.  14 (c,d)). The quantiles are then computed on 10000 samples for each nominal stress level, which are joined to construct the quantiles of the porous Wohler curve (shown by the red area in Fig.  15 ). This failure distribution or Wohler curve represents uncertainty due to defects at two scales - micro-heterogeneity and varying pore distributions. We note that the uncertainty in fatigue lifetime due to varying pore distributions in the specimen is relatively low as compared to the uncertainty due to the micro-heterogeneity. In other words, at the scale of this specimen, the impact of varying pore distributions on the lifetime is not high. This is because of the volume of the specimen, which is large as compared to the pore size, which increases the likelihood of finding critical pore configurations in all the specimens, and makes all the synthetic specimens have similar stress distributions."
        ]
    },
    "id_table_15": {
        "caption": "",
        "table": "S3.F4.pic1.6.1.1",
        "footnotes": [],
        "references": [
            "Fatigue lifetime distributions for multiple realizations of synthetically generated porous specimens of the same volume but varying pore distributions (examples previously shown in  10 ) were obtained, at various nominal loading levels. The synthetically generated porous specimens show variations in their fatigue lifetime distributions, as shown in Fig.  14  for two different nominal applied stress amplitude levels, or in Fig.  15  for the entire Wohler curve for a couple of specimens.",
            "A fatigue lifetime distribution or Wohler curve representing uncertainty due to pore distributions can be constructed by combining samples from a certain number of porous specimens. The failure distribution representing this uncertainty in pore distributions is constructed by combining 1000 samples each from 10 different randomly generated porous test specimens (shown by the red histogram in Fig.  14 (c,d)). The quantiles are then computed on 10000 samples for each nominal stress level, which are joined to construct the quantiles of the porous Wohler curve (shown by the red area in Fig.  15 ). This failure distribution or Wohler curve represents uncertainty due to defects at two scales - micro-heterogeneity and varying pore distributions. We note that the uncertainty in fatigue lifetime due to varying pore distributions in the specimen is relatively low as compared to the uncertainty due to the micro-heterogeneity. In other words, at the scale of this specimen, the impact of varying pore distributions on the lifetime is not high. This is because of the volume of the specimen, which is large as compared to the pore size, which increases the likelihood of finding critical pore configurations in all the specimens, and makes all the synthetic specimens have similar stress distributions."
        ]
    },
    "id_table_16": {
        "caption": "",
        "table": "S3.F4.pic1.7.1.1",
        "footnotes": [],
        "references": [
            "The comparison between a two-line strain life model and one line strain life model is shown in Fig.  16 . The two models (with four and six parameters) yield qualitatively similar probability distributions for the specimen fatigue lifetime (with the 6 parameter model having only a very slightly lower likelihood value than the one obtained using the 4 parameter model). We will further investigate the more general two-line strain-life model with 6 parameters, to allow for the possibility of two distinct regimes.",
            "When optimisation is performed on only the porous data points (results shown in Fig.  16 ) both the two-line model and one line model seem to give good fits. However, as the porous data points contain information about both LCF and HCF behavior of the alloy, it is better to work with the two-line strain-life model. Material points around pores that are highly loaded should behave in the LCF regime and points in the non-loaded zones should behave in the HCF regime."
        ]
    },
    "id_table_17": {
        "caption": "",
        "table": "S3.F4.pic1.8.1.1",
        "footnotes": [],
        "references": [
            "Ideally we should also be able to predict the fatigue lifetime of porous materials with different pore distributions than the ones that were experimentally tested. Using the two-line fatigue model identified on the porous data, we try to predict the fatigue behavior of a non-porous specimen. The results are shown in Fig.  17 . We see that the prediction on the non-porous specimens is incorrect. The predicted lifetime is lower than what experiments suggest. This could be due to three reasons:"
        ]
    },
    "id_table_18": {
        "caption": "",
        "table": "S3.F4.pic1.9.1.1",
        "footnotes": [],
        "references": [
            "The fatigue model is now identified on the experimental fatigue lifetime data of porous material presented in Section  2 . The multi-scale methodology developed in section  3  for structures with heterogeneous stress distributions due to pores whose exact geometries and locations are unknown is used. The maximum likelihood approach developed in section  4.3  was used as the identification procedure. From the previously defined set  K ~ ~ K \\tilde{K} over~ start_ARG italic_K end_ARG , a total of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  synthetic specimens were randomly selected for each ( N i ,  a i superscript N i superscript subscript  a i N^{i},\\Sigma_{a}^{i} italic_N start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT , roman_ start_POSTSUBSCRIPT italic_a end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_i end_POSTSUPERSCRIPT ) pair in order to approximate the expectation operator in the expression ( 18 ) of the likelihood function. 2 2 2 The value of  n k = 10 subscript n k 10 n_{\\text{k}}=10 italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT = 10  is chosen to balance robustness and computational cost in the model identification process. The robustness increases with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT : each experimental point has a likelihood of failing from a larger variety of pore configurations, which is ideal as the exact pore distribution associated to the failure point is unknown. However, as will be discussed later, the computational cost increases linearly with  n k subscript n k n_{\\text{k}} italic_n start_POSTSUBSCRIPT k end_POSTSUBSCRIPT .",
            "We now consider the fatigue lifetime data-set associated with non-porous and porous material presented in section  2 . A reduction of the non-porous fatigue lifetime data-set  I I \\mathcal{I} caligraphic_I  is done by randomly picking one experimental point for each applied stress amplitude level. The resulting reduced non-porous dataset  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  is shown in Fig.  18  (a).",
            "The model parameters are jointly identified on the reduced non-porous data-set  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  and the porous data-set  J J \\mathcal{J} caligraphic_J . The result of the optimisation process is shown in Fig.  18 . The fit is consistent on both the non-porous as well as porous cases, despite the reduction of non-porous data. This indicates that fewer fatigue experiments are required to identify the parameters when using the multi-scale approach. This is because the multi-scale approach considers porous and non-porous specimens as the same material, and information from the two sets of data are statistically correlated."
        ]
    },
    "id_table_19": {
        "caption": "",
        "table": "S3.F4.pic1.10.1.1",
        "footnotes": [],
        "references": [
            "For all three models, the optimizer (Nelder-Mead) converges towards solutions with very similar likelihood values. The evolution of the parameters and the solution for the two-line fatigue model (equation ( 19 )(i)) is shown in Fig.  11 . Even for an initialisation that is far away from the solution at convergence, the optimisation process is well behaved, as seen by the intermediate and final solutions in Fig.  11 (b-f).",
            "The results of optimisation are presented in Fig.  12 . For all the models, it is observed that the solutions for the first and second fatigue models (equation ( 19 )(i) and (ii)) are similar, which suggests that the parameters  B B B italic_B  and    \\beta italic_ , i.e. the second line in the fatigue model, are not required. In our view, this conclusion would have been different had we had access to a richer data-set with more experiments across more loading levels. The third fatigue model (equation ( 19 )(iii)) shows a significant decrease in the quality of the fit, indicating the requirement for the parameter  C C C italic_C  for getting a meaningful fatigue limit beyond which the lifetime is infinite.",
            "Identifying a probabilistic fatigue model on the reduced data-set  I red superscript I red \\mathcal{I^{\\text{red}}} caligraphic_I start_POSTSUPERSCRIPT red end_POSTSUPERSCRIPT  is difficult due to an insufficient data-set, which makes several solutions possible. When considering the porous material as a new homogenised material, porous specimens may be considered to contain homogenised material with equivalent fatigue properties. A homogenised model is identified without using the multi-scale method, using the 0D identification procedure detailed in section  4.1  on the set  J J \\mathcal{J} caligraphic_J  of porous experimental data. This gives the fit shown by the red curve in Fig.  19 . While the fit is good on the porous specimens given the data, the model remains non-transferable to other types of pore populations. This is seen when extrapolating the homogenised porous model to the stress levels at which non-porous specimens were tested. The homogenised porous model overlaps with the non-porous experimental data, which is against the generally observed trend of porous material failing sooner than non-porous material."
        ]
    },
    "id_table_20": {
        "caption": "",
        "table": "S3.F4.pic1.11.1.1",
        "footnotes": [],
        "references": [
            "The influence of the mesh size on the median of the lifetime predicted by the model is studied in this subsection. A synthetic specimen with one pore was meshed at different levels of refinement. The two-line fatigue model with parameters taken from section  5.3  is taken. Figure  20  shows four different refinement levels, with the size of the smallest element going from 5 microns to 29 microns. Figure  21  shows the effect of these mesh sizes on the median lifetime, across several load levels. As seen in this figure, the median fatigue lifetime curve exhibits a dependence on mesh size. The lifetime curve for the mesh with the smallest element size of 5    \\mu italic_ m is identical to that for the 10    \\mu italic_ m mesh. The optimal mesh size, beyond which further refinement does not change the solution, therefore lies between 10 and 19    \\mu italic_ m."
        ]
    },
    "id_table_21": {
        "caption": "",
        "table": "S3.F4.pic1.12.1.1",
        "footnotes": [],
        "references": [
            "The influence of the mesh size on the median of the lifetime predicted by the model is studied in this subsection. A synthetic specimen with one pore was meshed at different levels of refinement. The two-line fatigue model with parameters taken from section  5.3  is taken. Figure  20  shows four different refinement levels, with the size of the smallest element going from 5 microns to 29 microns. Figure  21  shows the effect of these mesh sizes on the median lifetime, across several load levels. As seen in this figure, the median fatigue lifetime curve exhibits a dependence on mesh size. The lifetime curve for the mesh with the smallest element size of 5    \\mu italic_ m is identical to that for the 10    \\mu italic_ m mesh. The optimal mesh size, beyond which further refinement does not change the solution, therefore lies between 10 and 19    \\mu italic_ m."
        ]
    },
    "id_table_22": {
        "caption": "",
        "table": "S3.F4.pic1.13.1.1",
        "footnotes": [],
        "references": [
            "Thin specimens, transformed from a thicker specimen to have more surface area to volume ratio, while keeping the volume of the two specimens equal, have higher pore-surface interaction, and consequently have a lower lifetime - this effect has been reported before by other authors  [ 43 ,  5 ] . This effect is an automatic output of the two scale method introduced in this paper. Figure  22 (a) shows the geometries of two specimens: one specimen has radius  r r r italic_r  and length  L L L italic_L , the other specimen has radius  r / 4 r 4 r/4 italic_r / 4  and length  4 2  L superscript 4 2 L 4^{2}L 4 start_POSTSUPERSCRIPT 2 end_POSTSUPERSCRIPT italic_L  in order to keep the volume constant. Both of them are populated with pores using the same method presented in section  3.3 . For the thick specimen, the projected image of the pores (see Figure  22 (b)) shows a few pores interacting with the surface. The thin specimen, owing to lower cross-sectional area, has more pores interacting with the surface.",
            "The predictions of the fatigue lifetime model, shown in Fig.  22 (c), shows a decrease in the fatigue lifetime of a thinner specimen over all applied stress amplitude levels."
        ]
    },
    "id_table_23": {
        "caption": "",
        "table": "S3.F4.pic1.14.1.1",
        "footnotes": [],
        "references": [
            "As an automatic outcome of the model, specimens with different volumes but loaded under the same stress amplitude show a statistical size effect. Fig.  23  shows the Wohler curves of three synthetically generated porous specimens with volumes  V / 2 V 2 V/2 italic_V / 2 ,  V V V italic_V  and  2  V 2 V 2V 2 italic_V . The same pore population in the smallest specimen was tiled multiple times to get bigger specimens, to isolate only the specimen volume size effect (and not add lifetime variability due to changing pore distributions as demonstrated in section  5.2 ). Across all load levels, specimens with successively higher volumes show a decreasing fatigue lifetime. This is the well known statistical size effect in fatigue, i.e. bigger specimens have a larger probability of finding a critical flaw  [ 44 ,  45 ] ."
        ]
    },
    "id_table_24": {
        "caption": "",
        "table": "S3.F4.pic1.15.1.1",
        "footnotes": [],
        "references": [
            "We will now generate synthetic data using the multi-scale method  A . A total of 10 cylindrical synthetically generated porous specimens were considered for data generation (examples of the geometries have previously been shown in section  10 ). For each synthetically generated porous specimen, 1000 samples each across 9 nominal loading levels were generated using this model, as shown by the green markers in Figure  24 .",
            "Using the 0D identification procedure as described in section  4.1 , the parameters of a fatigue lifetime model that maximized the likelihood of the synthetic generated data were obtained. This model  B  is a homogenised porous fatigue lifetime model. To check the quality of this homogenised model, a 3D mesh of a homogeneous pore-free cylindrical specimen of the same size and geometry as the porous cylindrical specimens was created (shown in Figure  24 (a)), and the model  B  was used to obtain predictions on it using the weakest link method developed in section  3.4 . The results, shown in Figure  24 (b), indicate that the homogenised model  B  works well to replace the multi-scale method for the given geometry."
        ]
    },
    "id_table_25": {
        "caption": "",
        "table": "S3.F4.pic1.16.1.1",
        "footnotes": [],
        "references": [
            "A geometry with a macroscopic notch was created, as shown in Fig.  25 . The sub-volume of pores used to create a porous version of this geometry was taken from the same tomography used to create the cylindrical porous specimens. Next, several configurations of the notched specimen were created:"
        ]
    },
    "id_table_26": {
        "caption": "",
        "table": "S3.F4.pic1.17.1.1",
        "footnotes": [],
        "references": [
            "The criterion of the lifetime model was obtained on all these geometries via the plastic corrector methodology. The elements in the notched region were extracted for lifetime prediction, with the assumption that fatigue lifetime failure is influenced only by this volume. The extracted volumes of the different versions are shown in Fig.  26 . In the specimen with the normal expected pore density, there are two pores interacting with the notch that give rise to very high levels of plasticity. Concerning the specimen with removed surface-breaking pore interacting with the notch, there is a lesser amount of plasticity due to reduced pore-notch interaction. The specimen without pores has the least amount of plasticity, developing only due to the notch."
        ]
    },
    "id_table_27": {
        "caption": "",
        "table": "S3.F4.pic1.18.1.1",
        "footnotes": [],
        "references": [
            "We are now in a position to check the transferability of the homogenised model  B  to the notched geometry. Lifetime predictions (shown in  27 ) were obtained using the following configurations:"
        ]
    },
    "id_table_28": {
        "caption": "",
        "table": "S3.F4.pic1.19.1.1",
        "footnotes": [],
        "references": [
            "A plastic corrector is used for computation of the full-field       \\Delta\\varepsilon roman_ italic_  in the synthetically generated porous specimens  [ 26 ] . Figs.  28  and  29  show the quality of approximations as compared to a reference computation performed using the Z-Set suite  [ 46 ] . The plastic corrector approximates an elastoplastic solution pointwise using a plastic correction heuristic. The heuristic is a modified Neuber rule coupled with a local proportional evolution rule, which, along with the constitutive relations, form a closed set of equations which are solved for the approximated elasto-plastic response."
        ]
    },
    "id_table_29": {
        "caption": "",
        "table": "S3.F4.pic1.20.1.1",
        "footnotes": [],
        "references": [
            "A plastic corrector is used for computation of the full-field       \\Delta\\varepsilon roman_ italic_  in the synthetically generated porous specimens  [ 26 ] . Figs.  28  and  29  show the quality of approximations as compared to a reference computation performed using the Z-Set suite  [ 46 ] . The plastic corrector approximates an elastoplastic solution pointwise using a plastic correction heuristic. The heuristic is a modified Neuber rule coupled with a local proportional evolution rule, which, along with the constitutive relations, form a closed set of equations which are solved for the approximated elasto-plastic response."
        ]
    },
    "id_table_30": {
        "caption": "",
        "table": "S3.F4.pic1.21.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_31": {
        "caption": "",
        "table": "S3.F4.pic1.22.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_32": {
        "caption": "",
        "table": "S3.F4.pic1.23.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_33": {
        "caption": "",
        "table": "S3.F4.pic1.24.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_34": {
        "caption": "",
        "table": "S3.F4.pic1.25.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_35": {
        "caption": "",
        "table": "S3.F4.pic1.26.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_36": {
        "caption": "",
        "table": "S3.F5.pic1.16.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_37": {
        "caption": "",
        "table": "S3.F5.pic1.17.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_38": {
        "caption": "",
        "table": "S3.F5.pic1.18.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_39": {
        "caption": "",
        "table": "S3.F5.pic1.19.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_40": {
        "caption": "",
        "table": "S3.F5.pic1.20.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_41": {
        "caption": "",
        "table": "S3.F5.pic1.2.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_42": {
        "caption": "",
        "table": "S3.F5.pic1.3.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_43": {
        "caption": "",
        "table": "S3.F5.pic1.4.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_44": {
        "caption": "",
        "table": "S3.F5.pic1.21.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_45": {
        "caption": "",
        "table": "S3.F5.pic1.22.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_46": {
        "caption": "",
        "table": "S3.F5.pic1.23.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_47": {
        "caption": "",
        "table": "S3.F5.pic1.24.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_48": {
        "caption": "",
        "table": "S3.F5.pic1.25.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_49": {
        "caption": "",
        "table": "S3.F5.pic1.26.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_50": {
        "caption": "",
        "table": "S3.F5.pic1.27.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_51": {
        "caption": "",
        "table": "S3.F5.pic1.5.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_52": {
        "caption": "",
        "table": "S3.F5.pic1.28.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_53": {
        "caption": "",
        "table": "S3.F5.pic1.29.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_54": {
        "caption": "",
        "table": "S3.F5.pic1.30.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_55": {
        "caption": "",
        "table": "S3.F5.pic1.31.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_56": {
        "caption": "",
        "table": "S3.F5.pic1.32.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_57": {
        "caption": "",
        "table": "S3.F5.pic1.33.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_58": {
        "caption": "",
        "table": "S3.F5.pic1.34.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_59": {
        "caption": "",
        "table": "S3.F5.pic1.35.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_60": {
        "caption": "",
        "table": "S3.F5.pic1.36.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_61": {
        "caption": "",
        "table": "S3.F5.pic1.37.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_62": {
        "caption": "",
        "table": "S3.F5.pic1.38.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_63": {
        "caption": "",
        "table": "S3.F5.pic1.39.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_64": {
        "caption": "",
        "table": "S3.F5.pic1.40.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_65": {
        "caption": "",
        "table": "S3.F5.pic1.41.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_66": {
        "caption": "",
        "table": "S3.F5.pic1.42.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_67": {
        "caption": "",
        "table": "S3.F5.pic1.43.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_68": {
        "caption": "",
        "table": "S3.F5.pic1.44.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_69": {
        "caption": "",
        "table": "S3.F5.pic1.45.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_70": {
        "caption": "",
        "table": "S3.F5.pic1.46.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_71": {
        "caption": "",
        "table": "S3.F5.pic1.47.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_72": {
        "caption": "",
        "table": "S3.F5.pic1.48.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_73": {
        "caption": "",
        "table": "S3.F5.pic1.49.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_74": {
        "caption": "",
        "table": "S3.F5.pic1.50.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_75": {
        "caption": "",
        "table": "S3.F5.pic1.51.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_76": {
        "caption": "",
        "table": "S3.F5.pic1.52.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_77": {
        "caption": "",
        "table": "S3.F5.pic1.53.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_78": {
        "caption": "",
        "table": "S3.F5.pic1.54.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_79": {
        "caption": "",
        "table": "S3.F5.pic1.6.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_80": {
        "caption": "",
        "table": "S3.F5.pic1.55.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_81": {
        "caption": "",
        "table": "S3.F5.pic1.56.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_82": {
        "caption": "",
        "table": "S3.F5.pic1.57.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_83": {
        "caption": "",
        "table": "S3.F5.pic1.58.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_84": {
        "caption": "",
        "table": "S3.F5.pic1.59.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_85": {
        "caption": "",
        "table": "S3.F5.pic1.10.3.3",
        "footnotes": [],
        "references": []
    },
    "id_table_86": {
        "caption": "",
        "table": "S3.F5.pic1.60.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_87": {
        "caption": "",
        "table": "S3.F5.pic1.14.3.3",
        "footnotes": [],
        "references": []
    },
    "id_table_88": {
        "caption": "",
        "table": "S3.T1.26.26",
        "footnotes": [],
        "references": []
    },
    "id_table_89": {
        "caption": "",
        "table": "S5.T2.1",
        "footnotes": [],
        "references": []
    }
}