{
    "id_table_1": {
        "caption": "Table 1 .  Comparative Analysis of Initialization and Simulation Time over a Ten-Day Simulation Period",
        "table": "S2.T1.2",
        "footnotes": [],
        "references": [
            "To fill this gap and enable research on large trajectory datasets, our team has developed the Patterns of Life Simulation  (Zufle et al . ,  2023 ; Kim et al . ,  2019 )  which was created in Java leveraging the MASON agent-based modeling toolkit  (Luke et al . ,  2018 ) . The simulation creates realistic worlds to support in-silico  (Zufle et al . ,  2024 )  experiments to study hypothesis without involving real populations. The simulation uses Maslowian  (Maslow,  1943 )  needs of agents (i.e., people) which drive agents actions and behaviors like going home to find shelter; working to make money; going to restaurants to eat; and visiting recreational sites to meet friends. Many more facets of the logic driving the behavior of agents in the Patterns of Life simulation can be found in  (Zufle et al . ,  2023 ) . Figure  1  shows a screenshot of the graphical user interface (GUI) used to show the movement of agents across a study region and their social network. We used the Patterns of Life simulation to generate large sets of check-in data  (Kim et al . ,  2020 )  and large sets of trajectory data  (Amiri et al . ,  2023 ) . However, these datasets pertain only to a small set of pre-selected study regions. This demonstration will show how the Patterns of Life Simulation can be adapted by users for their own purpose and their own study region. Specifically, this demonstration explains how to:",
            "The demonstration will be organized as follows: Section  2.1  provides an overview of the Patterns of Life Simulation using GUI, and Section  2.2  demonstrates how to use the simulation for data generation with the GUI. Then Section  2.3  describes how OpenStreetMap data can be used to change the simulation to any region of interest in the World. Section  2.4  details the changes we have made to increase the scalability of the simulation, and Section  2.5  demonstrates a framework to run many simulations in parallel for very large-scale trajectory data generation. In this demonstration, we utilized what we call the Vanilla simulation as a baseline and is located in the following GitHub repository:  {https://github.com/gmuggs/pol} . All the improvements, optimization, and documentation to reproduce this demonstration are found at  https://github.com/onspatial/generate-mobility-dataset",
            "For the demonstration to be presented at SIGSPATIAL 24, we will run the Patterns of Life Simulation live to generate trajectory data. We have prepared several maps, including those of Atlanta, USA; Beijing, China; Berlin, Germany; and San Francisco, USA. By default, we will use the Atlanta map using 1000 agents for this demonstration. We choose such as small number of agents to avoid waiting times during the demonstration for simulation initialization (we will come back to run time of the simulation in Section  2.4 ). First, we will demonstrate a single run of the simulation using the GUI to explain how the simulation works, how agents move across the map, and how they interact with each other to form social networks as seen in Figure  1 . While the simulation is running, we will give a brief overview of the theories of social behavior guiding agents behavior including Maslows Hierarchy of Needs  (Maslow,  1943 )  and the Theory of Planned Behavior  (Ajzen,  1991 ) . For the live-audience at SIGSPATIAL 24 we will include details of these theories on a poster that will be exhibited next to our demonstrator. We will also briefly explain how the social network (on the right of the GUI shown in Figure  1 ) is formed and evolves. The interested reader of this paper may find these details in our simulation description  (Zufle et al . ,  2023 ) . After simulating for about one minute (wall-clock time), about ten days of simulation time will have been generated. We will show the generated log files including trajectories, check-ins, and time-series of agent states.",
            "We conducted a comparative analysis of the initialization and simulation time between the original (Vanilla) and the improved (Improved) version of the Patters of Life Simulation. The results are presented in Table  1 . The new version is significantly faster than the Vanilla version in both initialization and simulation time. For instance, when simulating 1000 agents, the improved version is 3.8 times faster in initialization and 8.1 times faster in simulation time compared to the vanilla version. The performance improvement is more pronounced as the number of agents increases. For example, when simulating 150,000 agents, it was not reasonable to run the Vanilla version due to the long initialization and simulation time. In contrast, the Improved version can handle this number of agents with a reasonable time frame. An example of generated data can be found in  (Amiri et al . ,  2023 )  we used the framework to generate a dataset with various number of agents and maps for different regions. Since we wont have time to regenerate these very large datasets at SIGSPATIAL, we will instead explore already-generated datasets which include billions of check-ins, trillions of social links, and tens of trillions of trajectory points. We will note that these numbers are many orders of magnitude larger than any existing datasets. The reader can find more details in our Data & Resource Paper  (Amiri et al . ,  2023 ) ."
        ]
    }
}