{
    "id_table_1": {
        "caption": "TABLE I :  Original Dataset",
        "table": "S2.T1.2",
        "footnotes": [],
        "references": [
            "As shown in Figure  1  the generation process involves understanding the underlying distributions, correlations, and relationships within the real data and producing new data points that reflect these characteristics. This approach is valuable when access to real data is limited due to privacy concerns, regulatory restrictions, or the potential for information leakage.",
            "By visually comparing plots of the  longitude  and  latitude  data in both the real and synthetic datasets, Figure  10  presents a side-by-side comparison of the geographical data from the original and synthetic datasets. In these plots, data points are colour-coded based on the road surface type ( asphalt road ,  cobblestone road ,  dirt road ).",
            "From Figure  10 , several specific observations can be made:",
            "It is worth noting that this increased privacy has subsequently resulted in a fall in the utility of the data for road type classification as visually from  10  and from our results in  VII  it is clear to see the existence of poorly distributed road types relative to their original positioning."
        ]
    },
    "id_table_2": {
        "caption": "TABLE II :  k k k italic_k -Anonymized Dataset",
        "table": "S2.T2.1",
        "footnotes": [],
        "references": [
            "As shown in Figure  2 , numerous organisations rely on the personal data collected by your car. This then raises the question: what makes this data so valuable?"
        ]
    },
    "id_table_3": {
        "caption": "TABLE III :  Smart Vehicle Signal Taxonomy Grouped by Priority",
        "table": "S4.T3.5",
        "footnotes": [],
        "references": [
            "Having understood the benefits of synthetic data and the challenges at hand, we now turn to finding an effective solution. The question becomes: where do we start? Synthetic data generation is a broad concept encompassing a wide range of techniques for creating artificial data. The generation process can vary from using Instruct LLMs to create entire datasets from scratch to simple augmentation techniques like rotation and inversion of images, as illustrated in Figure  3 ."
        ]
    },
    "id_table_4": {
        "caption": "TABLE IV :  Processed Dataset with Reduced Features",
        "table": "S5.T4.4",
        "footnotes": [],
        "references": [
            "Given that we are working with single table data, with the focus on being able to capture the complex relationships between data points, using the proposed flow chart in Figure  4 , its clear that deep learning methods, in particular models such as GANs and VAEs, are most suitable for us.",
            "As Figure  4  describes, even once we have decided what method to use, we can use various models to generate our synthetic samples. We can simplify this by understanding that many of these models are flavours of both the GAN and the VAE architecture."
        ]
    },
    "id_table_5": {
        "caption": "TABLE V :  Statistical Comparison of Real and Synthetic Data",
        "table": "S6.T5.4.1",
        "footnotes": [],
        "references": [
            "Figure  5  illustrates the training loss over 200 epochs. Initially, the loss fluctuated during the first 50 epochs, which is typical as the model begins to learn the data distribution. By epoch 60, the loss stabilised, indicating that the model had effectively converged. This convergence suggests that the TVAE successfully captured the underlying patterns in the data, balancing reconstruction accuracy with generalisation capabilities."
        ]
    },
    "id_table_6": {
        "caption": "TABLE VI :  Performance of Classification Models Trained on Real Data",
        "table": "S6.T6.4",
        "footnotes": [],
        "references": [
            "To assess how well the synthetic data preserves the relationships between features, I examined the correlation matrices of both datasets. Figure   6  displays the correlation matrices for the real and synthetic data."
        ]
    },
    "id_table_7": {
        "caption": "TABLE VII :  Classification Report",
        "table": "S6.T7.4",
        "footnotes": [],
        "references": [
            "To visualize the distributions of individual features, I generated Kernel Density Estimation (KDE) plots for both the real and synthetic data. Figure  7  showcases the KDE plots for selected features."
        ]
    }
}