{
    "id_table_1": {
        "caption": "Table 1 .  Categorization of prior work on sociocultural norm ( Scn ) statements extraction. Frame encompasses the socio-cultural context, e.g. the topic and social relation. Chinese refers the culture of norms. Synthetic-Dial. refers to using synthetic dialogues for extracting  Scn . No Human denotes no need for human for  Scn  extraction (different from evaluation).",
        "table": "S2.T1.2",
        "footnotes": [],
        "references": [
            "To close the research gap, we propose a scalable approach for  Scn  bank construction using LLMs for socially aware dialogues. Then we construct the first frame-based  C hinese sociocultural  N orm  B ase,  ChineseNormBase ,  for investigating Chinese sociocultural norms.  Table  1  contextualises our work.  The norm base is grounded in the dialogues contexts through sociocultural frames, enabling pragmatic reasoning related to the situational context and reducing the hallucinations.  By applying these frames, we can embed domain knowledge into the model,  significantly improving the control over social norm extraction.  To lessen the dependence on real dialogue data, we suggest employing synthetically generated dialogue data. This strategy is particularly useful when the required real data is unavailable. We also experimentally demonstrate the effectiveness of using synthetic data. For the annotation and extraction of SCNs, we utilize LLMs instead of human effort, offering a scalable solution for the construction of the  Scn  bank.  Once  Scn s are extracted, we evaluate them both intrinsically and extrinsically. For the former, we use both automated (using GPT4) and human evaluation to assess the quality of the norm statements, and for the latter we employ  Scn s in a fine-tuned Multilingual-BERT and a Retrieval-Augmented Generation (RAG)-based  (Lewis et al . ,  2020 ; Ji et al . ,  2023b ,  a )  model which is a recent retrieval-augmented machine learning approach to reason about downstream tasks.  To summarise, our contributions are,",
            "SOCIAL CHEMISTRY  (Forbes et al . ,  2020 )  is a large-scale corpus of social and moral norms, which was constructed by crowdsourcing to elicit descriptive norms from situations via open-text rules-of-thumb as the basic conceptual units.   (Zhan et al . ,  2023 )  developed a dialogue corpus named  SocialDial , which is annotated with a variety of social factors to facilitate the study of Chinese social norms within conversations. Different in focus from ours,  SocialDial  is a corpus of dialogues rather than a database of norms.  Additional pivotal work includes the study by  (Ziems et al . ,  2023 ) . They developed a hierarchical taxonomy of constraints, named the Situational Constraints for Social Expectations, Norms, and Etiquette (SCENE). Following this, they engaged humans to annotate the rich SCENE taxonomy.  Our work primarily deviates from  NormBank  as we introduce an automated pipeline for extracting socio-cultural norms, whereas  NormBank  depends on human annotation.  Furthermore, another study  (Fung et al . ,  2023 )  proposed the  NormSage  framework, which was designed to tackle task of uncovering norms grounded in conversation. This framework is built upon LLM prompting and self-verification, sourcing its discussions from authentic settings such as negotiations, informal chats, and documentaries. Our work differentiates itself from  NormSage  by using social-cultural frame and synthetic-dialogues for norm extraction, as shown in Table  1 .",
            "We propose a pipeline (detailed in  3.2 ) based on LLMs   (Fung et al . ,  2023 ; Sap et al . ,  2020 ; Singhal et al . ,  2023 ) . Our approach is innovative in several key aspects.  By integrating a sociocultural frame into the pipeline, we enhance the extraction of  Scn  statements due to leveraging the pragmatic implication of utterances.  Furthermore, our pipeline is versatile, applicable not only to real dialogues but also effective in extracting high-quality  Scn  statements from synthetic dialogues, as analyzed in the experimental section  4.1 .",
            "We use ChatGPT (GPT-3.5-turbo) as the underlying LLM in the  Scn  extraction framework of Figure  1 .  For each dialogue, we set the maximum number of  Scn  statements that can be extracted to be  2  2\\times 2   the number of utterances in the dialogue. Dialogues contain varying numbers of utterances, making it difficult to define a universal upper limit for the number of sociocultural norms for all dialogues. However, it is easier to define it as a multiple of the number of utterances.  For dialogues lacking a frame, ChatGPT is first employed to predict a silver frame. The potential values for sociocultural factors are outlined in Subsection  3 . Our approach includes a  Scn  statement pool. When a new  Scn  statement is generated, its similarity with existing norms in the pool is assessed. If the similarity score is below a predefined threshold of 0.97 which is chosen based on empirical study, the statement is considered novel and added to the pool.",
            "In this section we study the quality of the  Scn  generated from  R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  and  S  y  n  t  h  e  t  i  c S y n t h e t i c Synthetic italic_S italic_y italic_n italic_t italic_h italic_e italic_t italic_i italic_c  dialogues. We also delineate the effect of the ground-truth social frames and the predicted social frames, referred to as  G  o  l  d G o l d Gold italic_G italic_o italic_l italic_d  and  S  i  l  v  e  r S i l v e r Silver italic_S italic_i italic_l italic_v italic_e italic_r , respectively. For our analysis, we randomly selected 100  R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  dialogues and 100  S  y  n  t  h  e  t  i  c S y n t h e t i c Synthetic italic_S italic_y italic_n italic_t italic_h italic_e italic_t italic_i italic_c  dialogues, each paired with their respective  G  o  l  d G o l d Gold italic_G italic_o italic_l italic_d  frames. We ensured that both sets of dialogues shared the same frame combination.Following the framework in Figure  1 , we extracted  Scn  statements from both  R  e  a  l + G  o  l  d R e a l G o l d Real+Gold italic_R italic_e italic_a italic_l + italic_G italic_o italic_l italic_d  and  S  y  n  t  h  e  t  i  c + G  o  l  d S y n t h e t i c G o l d Synthetic+Gold italic_S italic_y italic_n italic_t italic_h italic_e italic_t italic_i italic_c + italic_G italic_o italic_l italic_d . Then, we applied the same extraction pipeline on 100  R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  dialogues with  G  o  l  d G o l d Gold italic_G italic_o italic_l italic_d  frames and 100  R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  dialogues with  S  i  l  v  e  r S i l v e r Silver italic_S italic_i italic_l italic_v italic_e italic_r  frames, represented as  R  e  a  l + G  o  l  d R e a l G o l d Real+Gold italic_R italic_e italic_a italic_l + italic_G italic_o italic_l italic_d  and  R  e  a  l + S  i  l  v  e  r R e a l S i l v e r Real+Silver italic_R italic_e italic_a italic_l + italic_S italic_i italic_l italic_v italic_e italic_r , respectively.",
            "Similar to Subsection  5.1 , we extract  Scn  statements from real dialogues with gold frames, real dialogues with silver frames, and synthetic dialogues with gold frames. Subsequently, GPT-4 was employed to classify the extracted  Scn  statements into different categories of a specified social factor."
        ]
    },
    "id_table_2": {
        "caption": "Table 2 .  Intrinsic evaluation of  Scn  statements extracted from  synthetic dialogues  generated by ChatGPT. The evaluations are based on Likert scores (1-5), judged by GPT4 and human as evaluators.",
        "table": "S4.T2.2",
        "footnotes": [],
        "references": [
            "We propose a pipeline (detailed in  3.2 ) based on LLMs   (Fung et al . ,  2023 ; Sap et al . ,  2020 ; Singhal et al . ,  2023 ) . Our approach is innovative in several key aspects.  By integrating a sociocultural frame into the pipeline, we enhance the extraction of  Scn  statements due to leveraging the pragmatic implication of utterances.  Furthermore, our pipeline is versatile, applicable not only to real dialogues but also effective in extracting high-quality  Scn  statements from synthetic dialogues, as analyzed in the experimental section  4.1 .",
            "We use  NormSage   (Fung et al . ,  2023 )  as our baseline, which is also a norm extraction pipeline but lacks the notion of frames in comparison to  ChineseNormBase . We implement  NormSage  on the same dialogue dataset to extract norms based on its pipeline 1 1 1 The  NormSage  dataset is not released when we do this work. . We do this because there is no norm dataset released by  NormSage , and doing this can guarantee a fair comparison, which only evaluates the pipelines. We also study a scenario where the frame is not available, referred to as  ChineseNormBase S  i  l  v  e  r subscript ChineseNormBase S i l v e r \\textsc{ChineseNormBase}_{Silver} ChineseNormBase start_POSTSUBSCRIPT italic_S italic_i italic_l italic_v italic_e italic_r end_POSTSUBSCRIPT .  S  i  l  v  e  r S i l v e r Silver italic_S italic_i italic_l italic_v italic_e italic_r  indicates the predicted frame by LLM based on the given dialogue, while  ChineseNormBase G  o  l  d subscript ChineseNormBase G o l d \\textsc{ChineseNormBase}_{Gold} ChineseNormBase start_POSTSUBSCRIPT italic_G italic_o italic_l italic_d end_POSTSUBSCRIPT  represents real dialogues with real frames ( ChineseNormBase G  o  l  d subscript ChineseNormBase G o l d \\textsc{ChineseNormBase}_{Gold} ChineseNormBase start_POSTSUBSCRIPT italic_G italic_o italic_l italic_d end_POSTSUBSCRIPT  is a subset of  ChineseNormBase ).  We assess the extracted  Scn  statements using GPT4 and human evaluators using the five criteria mentioned earlier.  We hire university students from China for the human evaluation part. To ensure fairness in their evaluations, we do not disclose where these  Scn  statements come from.  The overall results can be found in Tables  2  and  3 .",
            "Table  2  demonstrates that on synthetic dialogues,  ChineseNormBase  consistently outperforms  NormSage  across 4 (out of 5) dimensions.  NormSage s primary limitation lies in its failure to consider the social frame information within dialogues, including aspects such as norm category, social distance, social relation, topic, location, and formality. These details are crucial for  Scn  statements, and our framework utilizes them as sources. As a result, our scores for  Relevance ,  Insightfulness  and  Relatableness  show significant improvements in both real and synthetic dialogues. However, for the remaining two dimensions,  Well-Formedness  and  Correctness , there isnt a significant difference between the two approaches, as frame information doesnt substantially impact  Scn  statement generation from these perspectives.  Table  3 , which focuses on real dialogues, validates that both  ChineseNormBase S  i  l  v  e  r subscript ChineseNormBase S i l v e r \\textsc{ChineseNormBase}_{Silver} ChineseNormBase start_POSTSUBSCRIPT italic_S italic_i italic_l italic_v italic_e italic_r end_POSTSUBSCRIPT  and  ChineseNormBase G  o  l  d subscript ChineseNormBase G o l d \\textsc{ChineseNormBase}_{Gold} ChineseNormBase start_POSTSUBSCRIPT italic_G italic_o italic_l italic_d end_POSTSUBSCRIPT  outperform  NormSage  when leveraging real dialogues. This further underscores the importance of incorporating social frame information. Notably,  ChineseNormBase S  i  l  v  e  r subscript ChineseNormBase S i l v e r \\textsc{ChineseNormBase}_{Silver} ChineseNormBase start_POSTSUBSCRIPT italic_S italic_i italic_l italic_v italic_e italic_r end_POSTSUBSCRIPT  achieves competitive results compared to  ChineseNormBase G  o  l  d subscript ChineseNormBase G o l d \\textsc{ChineseNormBase}_{Gold} ChineseNormBase start_POSTSUBSCRIPT italic_G italic_o italic_l italic_d end_POSTSUBSCRIPT , indicating that even when the ground-truth frame is not available, the predicted frame using language models is still useful for norm extraction.",
            "In this section, we evaluate  ChineseNormBase  on the downstream task of social factors prediction. The foundation model we use here is Retrieval-Augmented Generation (RAG) based large language models (LLMs)  (Lewis et al . ,  2020 ) . More specifically, given the target dialogue, top-k most similar dialogues are retrieved from a dialogue database. The target dialogue together with  Scn  statements of these top-k similar dialogues are input to the LLM for prediction. Here, we use  SocialDial  as the dialogue database to assess if it can help with the downstream task using RAG-based models.  Note that this retrieval process is accomplished by embedding all dialogues using the pre-trained language model BERT  (Cui et al . ,  2020 ) .  Then, we calculate cosine similarity to find the top-k similar dialogues of the target dialogue.  The overview of the process is illustrated in Figure  2 ."
        ]
    },
    "id_table_3": {
        "caption": "Table 3 .  Intrinsic evaluation of  Scn  statements extracted from  real dialogues  written by human. The evaluations are based on Likert scores (1-5), judged by GPT4 and human as evaluators.",
        "table": "S4.T3.4",
        "footnotes": [],
        "references": [
            "We propose a pipeline (detailed in  3.2 ) based on LLMs   (Fung et al . ,  2023 ; Sap et al . ,  2020 ; Singhal et al . ,  2023 ) . Our approach is innovative in several key aspects.  By integrating a sociocultural frame into the pipeline, we enhance the extraction of  Scn  statements due to leveraging the pragmatic implication of utterances.  Furthermore, our pipeline is versatile, applicable not only to real dialogues but also effective in extracting high-quality  Scn  statements from synthetic dialogues, as analyzed in the experimental section  4.1 .",
            "We use ChatGPT (GPT-3.5-turbo) as the underlying LLM in the  Scn  extraction framework of Figure  1 .  For each dialogue, we set the maximum number of  Scn  statements that can be extracted to be  2  2\\times 2   the number of utterances in the dialogue. Dialogues contain varying numbers of utterances, making it difficult to define a universal upper limit for the number of sociocultural norms for all dialogues. However, it is easier to define it as a multiple of the number of utterances.  For dialogues lacking a frame, ChatGPT is first employed to predict a silver frame. The potential values for sociocultural factors are outlined in Subsection  3 . Our approach includes a  Scn  statement pool. When a new  Scn  statement is generated, its similarity with existing norms in the pool is assessed. If the similarity score is below a predefined threshold of 0.97 which is chosen based on empirical study, the statement is considered novel and added to the pool.",
            "We use  NormSage   (Fung et al . ,  2023 )  as our baseline, which is also a norm extraction pipeline but lacks the notion of frames in comparison to  ChineseNormBase . We implement  NormSage  on the same dialogue dataset to extract norms based on its pipeline 1 1 1 The  NormSage  dataset is not released when we do this work. . We do this because there is no norm dataset released by  NormSage , and doing this can guarantee a fair comparison, which only evaluates the pipelines. We also study a scenario where the frame is not available, referred to as  ChineseNormBase S  i  l  v  e  r subscript ChineseNormBase S i l v e r \\textsc{ChineseNormBase}_{Silver} ChineseNormBase start_POSTSUBSCRIPT italic_S italic_i italic_l italic_v italic_e italic_r end_POSTSUBSCRIPT .  S  i  l  v  e  r S i l v e r Silver italic_S italic_i italic_l italic_v italic_e italic_r  indicates the predicted frame by LLM based on the given dialogue, while  ChineseNormBase G  o  l  d subscript ChineseNormBase G o l d \\textsc{ChineseNormBase}_{Gold} ChineseNormBase start_POSTSUBSCRIPT italic_G italic_o italic_l italic_d end_POSTSUBSCRIPT  represents real dialogues with real frames ( ChineseNormBase G  o  l  d subscript ChineseNormBase G o l d \\textsc{ChineseNormBase}_{Gold} ChineseNormBase start_POSTSUBSCRIPT italic_G italic_o italic_l italic_d end_POSTSUBSCRIPT  is a subset of  ChineseNormBase ).  We assess the extracted  Scn  statements using GPT4 and human evaluators using the five criteria mentioned earlier.  We hire university students from China for the human evaluation part. To ensure fairness in their evaluations, we do not disclose where these  Scn  statements come from.  The overall results can be found in Tables  2  and  3 .",
            "Table  2  demonstrates that on synthetic dialogues,  ChineseNormBase  consistently outperforms  NormSage  across 4 (out of 5) dimensions.  NormSage s primary limitation lies in its failure to consider the social frame information within dialogues, including aspects such as norm category, social distance, social relation, topic, location, and formality. These details are crucial for  Scn  statements, and our framework utilizes them as sources. As a result, our scores for  Relevance ,  Insightfulness  and  Relatableness  show significant improvements in both real and synthetic dialogues. However, for the remaining two dimensions,  Well-Formedness  and  Correctness , there isnt a significant difference between the two approaches, as frame information doesnt substantially impact  Scn  statement generation from these perspectives.  Table  3 , which focuses on real dialogues, validates that both  ChineseNormBase S  i  l  v  e  r subscript ChineseNormBase S i l v e r \\textsc{ChineseNormBase}_{Silver} ChineseNormBase start_POSTSUBSCRIPT italic_S italic_i italic_l italic_v italic_e italic_r end_POSTSUBSCRIPT  and  ChineseNormBase G  o  l  d subscript ChineseNormBase G o l d \\textsc{ChineseNormBase}_{Gold} ChineseNormBase start_POSTSUBSCRIPT italic_G italic_o italic_l italic_d end_POSTSUBSCRIPT  outperform  NormSage  when leveraging real dialogues. This further underscores the importance of incorporating social frame information. Notably,  ChineseNormBase S  i  l  v  e  r subscript ChineseNormBase S i l v e r \\textsc{ChineseNormBase}_{Silver} ChineseNormBase start_POSTSUBSCRIPT italic_S italic_i italic_l italic_v italic_e italic_r end_POSTSUBSCRIPT  achieves competitive results compared to  ChineseNormBase G  o  l  d subscript ChineseNormBase G o l d \\textsc{ChineseNormBase}_{Gold} ChineseNormBase start_POSTSUBSCRIPT italic_G italic_o italic_l italic_d end_POSTSUBSCRIPT , indicating that even when the ground-truth frame is not available, the predicted frame using language models is still useful for norm extraction.",
            "Figure  3  presents some sample  Scn  statements generated from real dialogues under three different conditions: with Gold Frames, with Silver Frames, and without Frames.  Firstly, in the first sub-table with Gold Frames, the  Scn  statements encapsulate the chief-subordinate relationship within the context of office affairs. Similarly, in the second sub-table with Silver Frames, the  Scn  statements encompass the student-professor dynamic in school life.  However, in the third sub-table, where dialogues are presented without frames, all the  Scn  statements revolve solely around conducting reports. This approach overlooks the broader context of the real dialogues, resulting in a lack of relevance and depth in the extracted  Scn  statements.  These observations underscore the value of incorporating frames in  Scn  statements extraction. By doing so, we can effectively infuse domain knowledge into the process, transcending the limitations of relying solely on the dialogue content."
        ]
    },
    "id_table_4": {
        "caption": "Table 4 .  Norm adherence and violation label prediction on  NormDial",
        "table": "S4.T4.5",
        "footnotes": [],
        "references": [
            "We propose a pipeline (detailed in  3.2 ) based on LLMs   (Fung et al . ,  2023 ; Sap et al . ,  2020 ; Singhal et al . ,  2023 ) . Our approach is innovative in several key aspects.  By integrating a sociocultural frame into the pipeline, we enhance the extraction of  Scn  statements due to leveraging the pragmatic implication of utterances.  Furthermore, our pipeline is versatile, applicable not only to real dialogues but also effective in extracting high-quality  Scn  statements from synthetic dialogues, as analyzed in the experimental section  4.1 .",
            "Table  4  displays the results of norm adherence and norm violation prediction on  NormDial . It is evident that  ChineseNormBase -BERT outperforms all the baselines in both norm adherence and norm violation prediction. While  NormSage -BERT also concentrates on Chinese culture,  ChineseNormBase -BERT gains an advantage by incorporating social frame information.  NormBank -BERT, despite having frame information, primarily focuses on American culture, whereas  ChineseNormBase -BERT is tailored for Chinese culture. Multilingual-BERT consistently performs the worst, mainly as it has not been pretrained or fine-tuned on any social norm datasets.",
            "From Figure  4 , in each sub-plot, the vertical axis quantifies the frequency of each category, while the horizontal axis represents categories with the three bars corresponding to different dialogue and frame combinations.",
            "For social factor norm categories, the candidates can be greetings, requests, apologies, persuasion, criticism, and others. The resulting distribution of  Scn  statements from different data sources is depicted in Figure  4 (a).  Our analysis reveals a non-uniform distribution of social norm categories across all datasets, a trend consistent in each dataset. This indicates the varied impact of different norm categories in daily life. Notably, the others category significantly surpasses others, suggesting the existence of numerous norm categories not encompassed by the predefined five categories. Additionally, the request and persuasion categories exhibit moderate frequencies, implying these social norms are more prevalent in everyday interactions."
        ]
    },
    "id_table_5": {
        "caption": "Table 5 .    Experimental results of exploring the impact of  Scn s on dialogue social factors. The relevant  Scn s are placed in the prompt of the underlying LLM reasoner together with the test case for the prediction of the target, amounting to a RAG-based approach for reasoning based on our  ChineseNormBase . Please note that, according to documents of sklearn,  when using macro to account for label imbalance, it can result in an F-score that is not between precision and recall.",
        "table": "S4.T5.7",
        "footnotes": [],
        "references": [
            "We use  SocialDial   (Zhan et al . ,  2023 )  annotated with rich social factors as the evaluation dataset for the downstream task.  The predicted social factors are norm category, formality, location, social distance, social relation, and topic. We use ChatGPT and GPT4 as the LLM reasoner, and use macro-precision, macro-recall, and macro-F1 as metrics with  k = 5 k 5 k=5 italic_k = 5 .  In Table  5 ,  0  indicates that only the original dialogue (no  Scn  statement at all) is used for prediction.  all  means that all the retrieved  Scn  statements are used for prediction. And  1  means using a randomly selected  Scn  statement from all the retrieved  Scn  statements for prediction.",
            "As we can see from Table  5 , for the prediction of norm category, formality, social distance, social relation, and topic, both ChatGPT and GPT4 show a stronger performance with  Scn  statements than without them. This result suggests that  Scn  statements do facilitate dialogue-oriented downstream tasks. Moreover, we can observe that in most cases,  all   Scn  statements induce better performance than  1   Scn  statement. This indicates that the more relevant  Scn  statements are provided, the greater the improvements to predicting social factors in dialogues. As for location prediction, especially recall, the results without  Scn  statements are better than those given  Scn  statement. We posit this happens because  Scn  statements are less closely related to where a dialogue occurs.  Providing such  Scn  adds noisy information, and can hurt location prediction.",
            "Similar to Subsection  5.1 , we extract  Scn  statements from real dialogues with gold frames, real dialogues with silver frames, and synthetic dialogues with gold frames. Subsequently, GPT-4 was employed to classify the extracted  Scn  statements into different categories of a specified social factor."
        ]
    },
    "id_table_6": {
        "caption": "Table 6 .  Scn  statements overlap analysis. Real vs Synthetic compares  Scn  statements derived from real dialogues and synthetic dialogues, both incorporating gold frames. Real gold vs pred refers to the comparison of  Scn  statements from real dialogues using gold frames against those using predicted frames.",
        "table": "S5.T6.10",
        "footnotes": [],
        "references": [
            "As shown in Table  6 , for the 100 real dialogues with gold frame, 100 synthetic dialogues with gold frame, and 100 real dialogue with silver frame, there are 486, 554, and 484 extracted  Scn  statements. The precision, recall, and F1 scores of the  Scn  statemens on  R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  +  G  o  l  d G o l d Gold italic_G italic_o italic_l italic_d  vs  S  y  n  t  h  e  t  i  c S y n t h e t i c Synthetic italic_S italic_y italic_n italic_t italic_h italic_e italic_t italic_i italic_c  +  G  o  l  d G o l d Gold italic_G italic_o italic_l italic_d  and  R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  +  G  o  l  d G o l d Gold italic_G italic_o italic_l italic_d  vs  R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  +  S  i  l  v  e  r S i l v e r Silver italic_S italic_i italic_l italic_v italic_e italic_r  both exceed 0.9. This result demonstrates the high quality of the synthetic dialogues and predicted frames: that they induce highly similar  Scn  to those induced from real dialogues and gold frames. Moreover, the experiment on  R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  +  G  o  l  d G o l d Gold italic_G italic_o italic_l italic_d   v . s . formulae-sequence v s v.s. italic_v . italic_s .   S  y  n  t  h  e  t  i  c S y n t h e t i c Synthetic italic_S italic_y italic_n italic_t italic_h italic_e italic_t italic_i italic_c  +  G  o  l  d G o l d Gold italic_G italic_o italic_l italic_d  show a high overlap in  Scn  despite the different content in the two dialogue datasets, underscoring the significance of frames in  Scn  statements extraction. Additionally, the higher overlap observed in the experiment  R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  +  G  o  l  d G o l d Gold italic_G italic_o italic_l italic_d   v . s . formulae-sequence v s v.s. italic_v . italic_s .   R  e  a  l R e a l Real italic_R italic_e italic_a italic_l  +  S  i  l  v  e  r S i l v e r Silver italic_S italic_i italic_l italic_v italic_e italic_r  suggests that  Scn  statements are more influenced by the dialogue itself than by the frames."
        ]
    },
    "global_footnotes": [
        "The",
        "dataset is not released when we do this work.",
        "https://github.com/google-research/bert/blob/master/multilingual.md",
        "https://openai.com"
    ]
}