{
    "id_table_1": {
        "caption": "TABLE I:  Details of the evaluation datasets. Concept drift is abbreviated as CDs.",
        "table": "S5.T1.1.1",
        "footnotes": [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        "references": [
            "Figure  1  illustrates our context of applying semi-supervised CDD. In our scenario, the ML models are first trained offline using labeled data. Then, they are deployed online to classify the time series. When concept drift happens, it causes accuracy deterioration, such as  T3 ,  T4 , and  T5  in the top right chart in Figure  1 . However, in reality, the true labels of the input time series are not available. Thus, it is difficult for maintainers to observe the accuracy deterioration.",
            "As CDSeer integrates a supervised CDD to detect changes in the distribution of the prediction error between the original and the inspector models (Algorithm  1 ), we use PHT as the integrated supervised CDD in this experiment. Similar to RQ1, we evaluate model accuracy, precision, recall, and percentage of labels required."
        ]
    },
    "id_table_2": {
        "caption": "TABLE II:  The performance of three concept-drift detection (CDD) approaches. PHT is a supervised CDD, which requires 100% manual labeling and is unrealistic in practice. ECHO and Our Prophet are semi-supervised CDD and are more practical.",
        "table": "S6.T2.1.1",
        "footnotes": [],
        "references": [
            "Figure  2  shows an overview of our proposed concept drift detection technique namely CDSeer. In this figure, the components are separated into two parts. The grey box  Online Model Prediction  shows a generic data stream classification process, where the online classifier model predicts the labels of incoming streaming data points. The blue box called  CDSeer  summarizes our framework at a high level."
        ]
    },
    "id_table_3": {
        "caption": "TABLE III:  The performance of CDSeer under different configurations of window size and memory size.",
        "table": "S6.T3.1.1",
        "footnotes": [],
        "references": []
    }
}