{
    "id_table_1": {
        "caption": "TABLE I:  List of existing surveys vs our work",
        "table": "S1.T1.1",
        "footnotes": [],
        "references": [
            "In the following sections of this paper, we provide a comprehensive exploration of memorization in LLMs, structured into six main sections. We begin with the  Spectrum of Memorization [ II ], where we examine the concept from multiple perspectives including intentionality, retrievability, severity, abstraction, and transparency, offering a deep understanding of how memorization occurs. Next, in  Measuring Memorization  [ III ], we review various methodologies that have been used in previous studies to quantify and assess memorization within LLMs. We then explore the  Influences and Dynamics of Memorization  [ III ], identifying key factors and conditions that contribute to this phenomenon. Following this, in section [ V ] we analyze how memorization appears in specific LLM architectures. Next, in the  Mitigating Memorization  section [ VI ], we discuss strategies and techniques employed to minimize or control memorization in LLMs, addressing concerns related to privacy and generalization. Finally, we conclude with  Future Directions and Open Challenges  [ VII ], outlining potential areas for further research and unresolved questions, before summarizing our findings in the  Conclusion  [ VIII ]. Figure  1  shows a visual overview of our systemization scope."
        ]
    },
    "id_table_2": {
        "caption": "TABLE II:  Influences and dynamics of memorization and their key findings (discussed in Section  IV )",
        "table": "S4.T2.1",
        "footnotes": [],
        "references": [
            "They discuss that this threshold was chosen based on qualitative analyses of the samples. Examples of this are shown in Table  2 . By adopting this definition of memorization, they show that the measurement of memorization can increase by a factor of two. However, they also note that this definition can lead to both false positives and false negatives when compared to human judgment, indicating a potential direction for future investigations."
        ]
    },
    "global_footnotes": [
        "https://lessen-project.nl"
    ]
}