{
    "id_table_1": {
        "caption": "TABLE I:  Table of Mathematical Notations",
        "table": "S1.T1.7",
        "footnotes": [],
        "references": [
            "In every direction where a ray was launched, on encountering an intersection with an obstruction, three types of rays are created for further propagation analysis - the specular reflected ray, the scattered rays, and the transmitted ray. By Snells Law, the reflected ray and the incident ray make equal angles with the normal to the obstruction, while the transmitted ray propagates in the same direction as the incident ray, with a lateral displacement. However, signals at mmWave and sub-THz frequencies do not penetrate through walls with significant thickness, such as brick and concrete walls. Hence a thin wall assumption is made in this article, wherein the signals are assumed to propagate along the same path as the incident ray. Scattered rays are launched from the vertices of a half-icosahedron, centered at the point of incidence of the signal on the obstruction, as seen in Fig. 1  . The strongest scattered signals are simulated close to the direction of the specular reflection. The number of scattered rays, equal to the number of vertices of the half-icosahedron, is a user-controlled number.",
            "Four factory measurement campaigns were conducted at 142 GHz  [ 50 ,  51 ] . The first factory site was two-storied, large factory building in Brooklyn, NY where multiple tech prototyping companies shared office space, with the TX-RX locations depicted in Fig.  8 . The factory had shared open-seating areas, dedicated meeting rooms with glass panes and metallic frames, lockers, and metal elevators. The second factory was a a medium-sized electronics manufacturing facility in Brooklyn, NY. Numerous manufacturing machines were present in the environment, leading to a dense multipath environment. The TX-RX locations for Factory B are shown in Fig.  9 . The third factory was a medium sized warehouse facility in Long Island, NY, depicted in Fig.  10 . The warehouse had several metallic storage aisles stocked with cardboard boxes, and a package inspection room consisting of multiple desks for package inspection, along with a conveyor belt. The fourth factory as illustrated in Fig.  11  was a single room manufacturing space in Brooklyn, NY. Prototyping machines such as 3D printing machines and PCB production equipment were present in the environment.",
            "To evaluate the performance of NYURay, the measured directional multipath power (in dB) was compared with the power predicted by NYURay for the nine measurement campaigns. A comparison of the value of the loss functions introduced in ( 11 ) and ( 15 ) via linear and logarithmic optimization techniques is provided in Table  III . The loss function in the decibel domain ( O  F d  B O subscript F d B OF_{dB} italic_O italic_F start_POSTSUBSCRIPT italic_d italic_B end_POSTSUBSCRIPT ) is better optimized via the log optimization technique, while the loss function in the linear domain ( O  F L  i  n O subscript F L i n OF_{Lin} italic_O italic_F start_POSTSUBSCRIPT italic_L italic_i italic_n end_POSTSUBSCRIPT ) is better optimized by the linear optimization technique.",
            "The RMS delay spread is a measure of the duration over which power is received in a multipath wireless channel  [ 36 ] . As seen in Fig.  14 , good agreement was observed between the measured RMS delay spread and the NYURay predicted RMS delay spread. The RMS delay spread at mmWave frequencies was observed to be greater than the RMS delay spread at sub-THz frequencies, with the greatest spread observed at 28 GHz in the outdoor environment. A reduction in RMS delay spread was observed at higher frequencies due to greater penetration loss through various obstructions in the environment, leading to fewer (and weaker) multipath components.",
            "The RMS angular spread is a measure of dispersion of power over arriving incident angles  [ 63 ] . As seen in Fig.  15 , there is a good agreement between the measured and simulated RMS angular spread.",
            "Using the optimization technique in the decibel domain, a good agreement between the measured and simulated multipath powers was observed for the indoor measurement campaigns at 28 and 142 GHz, the outdoor measurement campaigns at 28, 73, and 142 GHz, and for the four factory measurement campaigns (Factory A, Factory B, Factory C, and Factory D - all at 142 GHz), as seen in Fig.  12 .",
            "In Fig.  13 , a comparison of a sample PDP created by NYURay with a sample PDP measured during the 28 GHz indoor office measurement campaign is presented. Although NYURay does not predict all of the multipath components that are measured at a delay of 35 ns, there is often good agreement in the other multipath components powers. The strongest multipath components measured power, in particular, is within 2 dB of the power that NYURay predicted."
        ]
    },
    "id_table_2": {
        "caption": "TABLE II:  The environment, RF bandwidths, TX antenna HPBW beamwidth and gain, and RX antenna HPBW beamwidth and gain used in channel measurements at 28, 73, and 142 GHz  [ 2 ,  3 ,  39 ,  46 ,  52 ,  53 ,  54 ,  48 ,  55 ,  56 ] .",
        "table": "S10.EGx1",
        "footnotes": [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        "references": [
            "where  d = c  T  o  F d c T o F d=c\\times ToF italic_d = italic_c  italic_T italic_o italic_F  is the total propagation path length of the ray. Rays that arrive within the reception sphere are said to have reached the RX. Setting the radius of the reception sphere as in ( 2 ) ensures that a single ray from each wave front is captured by the reception sphere.",
            "The RF signal was transmitted out of a high-gain directional horn antenna mounted on an electronically controllable gimbal, capable of rotating in the azimuth and elevation plane. The RF signal is analogously received by high-gain directional horn antenna mounted on an identical gimbal at the RX. The RF signal at the RX is downconverted by an local oscillator (LO) signal, passed through a low noise amplifier (LNA) and is IQ demodulated to baseband. Details of the environment, RF bandwidths, TX and RX horn antenna half-power beamwidths, and gains of the TX and RX horn antennas used at each of the three frequencies (28, 73, and 142 GHz) are summarized in Table  II . A block diagram of the channel sounder is provided in Fig.  2",
            "Using the optimization technique in the decibel domain, a good agreement between the measured and simulated multipath powers was observed for the indoor measurement campaigns at 28 and 142 GHz, the outdoor measurement campaigns at 28, 73, and 142 GHz, and for the four factory measurement campaigns (Factory A, Factory B, Factory C, and Factory D - all at 142 GHz), as seen in Fig.  12 ."
        ]
    },
    "id_table_3": {
        "caption": "TABLE III:  Performance comparison of the linear and logarithmic optimization techniques in indoor, outdoor, and factory environments at 28, 73, and 140 GHz using measurement data reported in  [ 2 ,  3 ,  39 ,  46 ,  52 ,  53 ,  54 ,  48 ,  55 ] .",
        "table": "S10.EGx2",
        "footnotes": [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        "references": [
            "Since the horn antennas had similar antenna pattern in the E and H planes, to transform the 2D antenna patterns to 3D antenna patterns, rotational symmetry about the boresight axis of the antenna was assumed. The antenna pattern, measured in the azimuth plane, was rotated about the boresight direction of the horn antenna to generate the 3D antenna pattern. As seen, for example, in Fig.  3 , the 2-D antenna pattern of the horn antenna operating at 28 GHz is rotated about the x-axis, which aligns with the boresight direction of the horn antenna.",
            "In Fig.  13 , a comparison of a sample PDP created by NYURay with a sample PDP measured during the 28 GHz indoor office measurement campaign is presented. Although NYURay does not predict all of the multipath components that are measured at a delay of 35 ns, there is often good agreement in the other multipath components powers. The strongest multipath components measured power, in particular, is within 2 dB of the power that NYURay predicted."
        ]
    },
    "id_table_4": {
        "caption": "TABLE IV:  Difference (   \\Delta roman_ ) between the RMS angular spread (Meas.) using channel measurements and predicted (Pred.) by NYURay in the indoor office environment at 28 GHz and 142 GHz using measurement data reported in  [ 3 ,  2 ] .",
        "table": "S10.EGx3",
        "footnotes": [
            "",
            ""
        ],
        "references": [
            "Indoor office measurement campaigns were conducted at 28 and 142 GHz in an indoor open-office on the 9th floor of 2 Metrotech Center in 2014 and 2019, respectively  [ 3 ,  2 ] . The environment consisted of cubicles, private offices, classrooms, glass doors and elevators. The walls were made of drywall with metallic frames and metal studs interspersed. A map of the TX and RX measurement locations for indoor scenario is shown in Fig.  4 .",
            "The RMS delay spread is a measure of the duration over which power is received in a multipath wireless channel  [ 36 ] . As seen in Fig.  14 , good agreement was observed between the measured RMS delay spread and the NYURay predicted RMS delay spread. The RMS delay spread at mmWave frequencies was observed to be greater than the RMS delay spread at sub-THz frequencies, with the greatest spread observed at 28 GHz in the outdoor environment. A reduction in RMS delay spread was observed at higher frequencies due to greater penetration loss through various obstructions in the environment, leading to fewer (and weaker) multipath components."
        ]
    },
    "id_table_5": {
        "caption": "TABLE V:  Difference (   \\Delta roman_ ) between the RMS delay spread measured (Meas.) using channel measurements and predicted (Pred.) by NYURay in the indoor office environment at 28 GHz and 142 GHz using measurement data reported in  [ 3 ,  2 ] .",
        "table": "S10.EGx4",
        "footnotes": [
            "",
            ""
        ],
        "references": [
            "Outdoor measurement campaigns were conducted at 28, 73, and 142 GHz  [ 39 ,  46 ,  52 ,  53 ,  48 ] . The 28 GHz outdoor measurements were conducted at the NYU campus in downtown Manhattan, which was an urban environment surrounded by general university areas and high rise buildings  [ 46 ] . The 73 and 142 GHz outdoor measurements were conducted in an open square (O.S.) environment on the NYU Tandon campus in downtown Brooklyn  [ 52 ,  53 ,  48 ] . The TX-RX locations used in the 28 GHz measurement campaign are shown in Fig.  5 , the TX-RX locations of the 73 GHz measurement campaign are shown in Fig.  6 , while the locations used in the 142 GHz measurement campaign are shown in Fig.  7 . Reflective metallic objects such as benches and lampposts were present in the environment. An orchard of cherry trees was in the center of the environment, with buildings that were four to fifteen stories surrounding the four sides of the orchard.",
            "To evaluate the performance of NYURay, the measured directional multipath power (in dB) was compared with the power predicted by NYURay for the nine measurement campaigns. A comparison of the value of the loss functions introduced in ( 11 ) and ( 15 ) via linear and logarithmic optimization techniques is provided in Table  III . The loss function in the decibel domain ( O  F d  B O subscript F d B OF_{dB} italic_O italic_F start_POSTSUBSCRIPT italic_d italic_B end_POSTSUBSCRIPT ) is better optimized via the log optimization technique, while the loss function in the linear domain ( O  F L  i  n O subscript F L i n OF_{Lin} italic_O italic_F start_POSTSUBSCRIPT italic_L italic_i italic_n end_POSTSUBSCRIPT ) is better optimized by the linear optimization technique.",
            "The RMS angular spread is a measure of dispersion of power over arriving incident angles  [ 63 ] . As seen in Fig.  15 , there is a good agreement between the measured and simulated RMS angular spread."
        ]
    },
    "id_table_6": {
        "caption": "TABLE VI:  Difference (   \\Delta roman_ ) between the RMS angular spread measured (Meas.) using channel measurements and predicted (Pred.) by NYURay in the outdoor environments at 28 GHz, 73 GHz, and 142 GHz using measurement data reported in  [ 39 ,  46 ,  48 ,  56 ] .",
        "table": "S10.EGx5",
        "footnotes": [
            "",
            "",
            "",
            ""
        ],
        "references": [
            "Outdoor measurement campaigns were conducted at 28, 73, and 142 GHz  [ 39 ,  46 ,  52 ,  53 ,  48 ] . The 28 GHz outdoor measurements were conducted at the NYU campus in downtown Manhattan, which was an urban environment surrounded by general university areas and high rise buildings  [ 46 ] . The 73 and 142 GHz outdoor measurements were conducted in an open square (O.S.) environment on the NYU Tandon campus in downtown Brooklyn  [ 52 ,  53 ,  48 ] . The TX-RX locations used in the 28 GHz measurement campaign are shown in Fig.  5 , the TX-RX locations of the 73 GHz measurement campaign are shown in Fig.  6 , while the locations used in the 142 GHz measurement campaign are shown in Fig.  7 . Reflective metallic objects such as benches and lampposts were present in the environment. An orchard of cherry trees was in the center of the environment, with buildings that were four to fifteen stories surrounding the four sides of the orchard."
        ]
    },
    "id_table_7": {
        "caption": "TABLE VII:  Difference (   \\Delta roman_ ) between the RMS delay spread measured (Meas.) using channel measurements and predicted (Pred.) by NYURay in the outdoor environments at 28 GHz, 73 GHz, and 142 GHz using measurement data reported in  [ 39 ,  46 ,  48 ,  56 ] .",
        "table": "S10.EGx6",
        "footnotes": [
            "",
            "",
            "",
            ""
        ],
        "references": [
            "Outdoor measurement campaigns were conducted at 28, 73, and 142 GHz  [ 39 ,  46 ,  52 ,  53 ,  48 ] . The 28 GHz outdoor measurements were conducted at the NYU campus in downtown Manhattan, which was an urban environment surrounded by general university areas and high rise buildings  [ 46 ] . The 73 and 142 GHz outdoor measurements were conducted in an open square (O.S.) environment on the NYU Tandon campus in downtown Brooklyn  [ 52 ,  53 ,  48 ] . The TX-RX locations used in the 28 GHz measurement campaign are shown in Fig.  5 , the TX-RX locations of the 73 GHz measurement campaign are shown in Fig.  6 , while the locations used in the 142 GHz measurement campaign are shown in Fig.  7 . Reflective metallic objects such as benches and lampposts were present in the environment. An orchard of cherry trees was in the center of the environment, with buildings that were four to fifteen stories surrounding the four sides of the orchard."
        ]
    },
    "id_table_8": {
        "caption": "TABLE VIII:  Difference (   \\Delta roman_ ) between the RMS angular spread measured (Meas.) using channel measurements and predicted (Pred.) by NYURay in the factory environments at 142 GHz using measurement data reported in  [ 55 ] .",
        "table": "S10.EGx7",
        "footnotes": [
            ""
        ],
        "references": [
            "Four factory measurement campaigns were conducted at 142 GHz  [ 50 ,  51 ] . The first factory site was two-storied, large factory building in Brooklyn, NY where multiple tech prototyping companies shared office space, with the TX-RX locations depicted in Fig.  8 . The factory had shared open-seating areas, dedicated meeting rooms with glass panes and metallic frames, lockers, and metal elevators. The second factory was a a medium-sized electronics manufacturing facility in Brooklyn, NY. Numerous manufacturing machines were present in the environment, leading to a dense multipath environment. The TX-RX locations for Factory B are shown in Fig.  9 . The third factory was a medium sized warehouse facility in Long Island, NY, depicted in Fig.  10 . The warehouse had several metallic storage aisles stocked with cardboard boxes, and a package inspection room consisting of multiple desks for package inspection, along with a conveyor belt. The fourth factory as illustrated in Fig.  11  was a single room manufacturing space in Brooklyn, NY. Prototyping machines such as 3D printing machines and PCB production equipment were present in the environment.",
            "Directional real-world measurements capture the power contained in one or more multipath components. Due to the directional horn antennas used during channel measurements, typically one strong multipath component was observed. The power measured in the strongest multipath component was compared to the power predicted via ( 8 )."
        ]
    },
    "id_table_9": {
        "caption": "TABLE IX:  Difference (   \\Delta roman_ ) between the RMS delay spread measured (Meas.) using channel measurements and predicted (Pred.) by NYURay in the factory environments at 142 GHz using measurement data reported in  [ 55 ] .",
        "table": "S5.T2.1",
        "footnotes": [
            ""
        ],
        "references": [
            "Four factory measurement campaigns were conducted at 142 GHz  [ 50 ,  51 ] . The first factory site was two-storied, large factory building in Brooklyn, NY where multiple tech prototyping companies shared office space, with the TX-RX locations depicted in Fig.  8 . The factory had shared open-seating areas, dedicated meeting rooms with glass panes and metallic frames, lockers, and metal elevators. The second factory was a a medium-sized electronics manufacturing facility in Brooklyn, NY. Numerous manufacturing machines were present in the environment, leading to a dense multipath environment. The TX-RX locations for Factory B are shown in Fig.  9 . The third factory was a medium sized warehouse facility in Long Island, NY, depicted in Fig.  10 . The warehouse had several metallic storage aisles stocked with cardboard boxes, and a package inspection room consisting of multiple desks for package inspection, along with a conveyor belt. The fourth factory as illustrated in Fig.  11  was a single room manufacturing space in Brooklyn, NY. Prototyping machines such as 3D printing machines and PCB production equipment were present in the environment.",
            "Consider each individual summation term in ( 9 ). The TX power of the directional measurement was obtained using a power meter during the calibration of the channel sounder, as described in  [ 61 ] . The antenna gains in the direction of departure and arrival of the multipath component were obtained by utilizing the antenna pattern of the TX and RX horn antennas, which were measured in the laboratory as described in Section  V-A . The path length traversed by a particular multipath component, as predicted by NYURay, is independent of the electrical properties of the material in the environment (depending only on the geometry of the environment). Thus, the free space path loss of each multipath component ( F  S  P  L  ( d j , f ) F S P L subscript d j f FSPL(d_{j},f) italic_F italic_S italic_P italic_L ( italic_d start_POSTSUBSCRIPT italic_j end_POSTSUBSCRIPT , italic_f ) ) was obtained by utilizing an uncalibrated version of the ray tracer, which provided accurate information of path length (although the power of the multipath component is not accurate when an uncalibrated ray tracer is used). To ensure that each multipath component was predicted by the uncalibrated ray tracer with sufficient power, the reflection coefficient of all materials was initialized to   = 0.9  0.9 \\Gamma=0.9 roman_ = 0.9  (highly reflective) with a partition loss of 1 dB. The material properties are fine-tuned as part of the calibration process. Finally,  P j , m  e  a  s subscript P j m e a s P_{j,meas} italic_P start_POSTSUBSCRIPT italic_j , italic_m italic_e italic_a italic_s end_POSTSUBSCRIPT  is the power contained in the multipath component as obtained from the directional field measurement. Thus, all quantities other than   i = 1 N ( w i , j p  e  n  L i p  e  n + w i , j r  e  f  L i r  e  f ) superscript subscript i 1 N subscript superscript w p e n i j subscript superscript L p e n i subscript superscript w r e f i j subscript superscript L r e f i \\sum_{i=1}^{N}\\left(w^{pen}_{i,j}L^{pen}_{i}+w^{ref}_{i,j}L^{ref}_{i}\\right)  start_POSTSUBSCRIPT italic_i = 1 end_POSTSUBSCRIPT start_POSTSUPERSCRIPT italic_N end_POSTSUPERSCRIPT ( italic_w start_POSTSUPERSCRIPT italic_p italic_e italic_n end_POSTSUPERSCRIPT start_POSTSUBSCRIPT italic_i , italic_j end_POSTSUBSCRIPT italic_L start_POSTSUPERSCRIPT italic_p italic_e italic_n end_POSTSUPERSCRIPT start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT + italic_w start_POSTSUPERSCRIPT italic_r italic_e italic_f end_POSTSUPERSCRIPT start_POSTSUBSCRIPT italic_i , italic_j end_POSTSUBSCRIPT italic_L start_POSTSUPERSCRIPT italic_r italic_e italic_f end_POSTSUPERSCRIPT start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT )  are known for the directional measurement corresponding to multipath component  j j j italic_j . Thus, ( 9 ) may be simplified to:"
        ]
    },
    "id_table_10": {
        "caption": "TABLE X:  Reflection and penetration loss of common building materials obtained from NYURay calibration at 28, 73, and 142 GHz. The reflection and penetration loss increases with increase in frequency.",
        "table": "S5.T2.1.1.1.1.1",
        "footnotes": [],
        "references": [
            "Four factory measurement campaigns were conducted at 142 GHz  [ 50 ,  51 ] . The first factory site was two-storied, large factory building in Brooklyn, NY where multiple tech prototyping companies shared office space, with the TX-RX locations depicted in Fig.  8 . The factory had shared open-seating areas, dedicated meeting rooms with glass panes and metallic frames, lockers, and metal elevators. The second factory was a a medium-sized electronics manufacturing facility in Brooklyn, NY. Numerous manufacturing machines were present in the environment, leading to a dense multipath environment. The TX-RX locations for Factory B are shown in Fig.  9 . The third factory was a medium sized warehouse facility in Long Island, NY, depicted in Fig.  10 . The warehouse had several metallic storage aisles stocked with cardboard boxes, and a package inspection room consisting of multiple desks for package inspection, along with a conveyor belt. The fourth factory as illustrated in Fig.  11  was a single room manufacturing space in Brooklyn, NY. Prototyping machines such as 3D printing machines and PCB production equipment were present in the environment."
        ]
    },
    "id_table_11": {
        "caption": "",
        "table": "S5.T2.1.1.1.3.1",
        "footnotes": [],
        "references": [
            "Four factory measurement campaigns were conducted at 142 GHz  [ 50 ,  51 ] . The first factory site was two-storied, large factory building in Brooklyn, NY where multiple tech prototyping companies shared office space, with the TX-RX locations depicted in Fig.  8 . The factory had shared open-seating areas, dedicated meeting rooms with glass panes and metallic frames, lockers, and metal elevators. The second factory was a a medium-sized electronics manufacturing facility in Brooklyn, NY. Numerous manufacturing machines were present in the environment, leading to a dense multipath environment. The TX-RX locations for Factory B are shown in Fig.  9 . The third factory was a medium sized warehouse facility in Long Island, NY, depicted in Fig.  10 . The warehouse had several metallic storage aisles stocked with cardboard boxes, and a package inspection room consisting of multiple desks for package inspection, along with a conveyor belt. The fourth factory as illustrated in Fig.  11  was a single room manufacturing space in Brooklyn, NY. Prototyping machines such as 3D printing machines and PCB production equipment were present in the environment.",
            "To evaluate the performance of NYURay, the measured directional multipath power (in dB) was compared with the power predicted by NYURay for the nine measurement campaigns. A comparison of the value of the loss functions introduced in ( 11 ) and ( 15 ) via linear and logarithmic optimization techniques is provided in Table  III . The loss function in the decibel domain ( O  F d  B O subscript F d B OF_{dB} italic_O italic_F start_POSTSUBSCRIPT italic_d italic_B end_POSTSUBSCRIPT ) is better optimized via the log optimization technique, while the loss function in the linear domain ( O  F L  i  n O subscript F L i n OF_{Lin} italic_O italic_F start_POSTSUBSCRIPT italic_L italic_i italic_n end_POSTSUBSCRIPT ) is better optimized by the linear optimization technique."
        ]
    },
    "id_table_12": {
        "caption": "",
        "table": "S5.T2.1.1.1.4.1",
        "footnotes": [],
        "references": [
            "Using the optimization technique in the decibel domain, a good agreement between the measured and simulated multipath powers was observed for the indoor measurement campaigns at 28 and 142 GHz, the outdoor measurement campaigns at 28, 73, and 142 GHz, and for the four factory measurement campaigns (Factory A, Factory B, Factory C, and Factory D - all at 142 GHz), as seen in Fig.  12 ."
        ]
    },
    "id_table_13": {
        "caption": "",
        "table": "S5.T2.1.1.1.5.1",
        "footnotes": [],
        "references": [
            "In Fig.  13 , a comparison of a sample PDP created by NYURay with a sample PDP measured during the 28 GHz indoor office measurement campaign is presented. Although NYURay does not predict all of the multipath components that are measured at a delay of 35 ns, there is often good agreement in the other multipath components powers. The strongest multipath components measured power, in particular, is within 2 dB of the power that NYURay predicted."
        ]
    },
    "id_table_14": {
        "caption": "",
        "table": "S5.T2.1.1.1.6.1",
        "footnotes": [],
        "references": [
            "The RMS delay spread is a measure of the duration over which power is received in a multipath wireless channel  [ 36 ] . As seen in Fig.  14 , good agreement was observed between the measured RMS delay spread and the NYURay predicted RMS delay spread. The RMS delay spread at mmWave frequencies was observed to be greater than the RMS delay spread at sub-THz frequencies, with the greatest spread observed at 28 GHz in the outdoor environment. A reduction in RMS delay spread was observed at higher frequencies due to greater penetration loss through various obstructions in the environment, leading to fewer (and weaker) multipath components."
        ]
    },
    "id_table_15": {
        "caption": "",
        "table": "S5.T2.1.1.1.7.1",
        "footnotes": [],
        "references": [
            "To evaluate the performance of NYURay, the measured directional multipath power (in dB) was compared with the power predicted by NYURay for the nine measurement campaigns. A comparison of the value of the loss functions introduced in ( 11 ) and ( 15 ) via linear and logarithmic optimization techniques is provided in Table  III . The loss function in the decibel domain ( O  F d  B O subscript F d B OF_{dB} italic_O italic_F start_POSTSUBSCRIPT italic_d italic_B end_POSTSUBSCRIPT ) is better optimized via the log optimization technique, while the loss function in the linear domain ( O  F L  i  n O subscript F L i n OF_{Lin} italic_O italic_F start_POSTSUBSCRIPT italic_L italic_i italic_n end_POSTSUBSCRIPT ) is better optimized by the linear optimization technique.",
            "The RMS angular spread is a measure of dispersion of power over arriving incident angles  [ 63 ] . As seen in Fig.  15 , there is a good agreement between the measured and simulated RMS angular spread."
        ]
    },
    "id_table_16": {
        "caption": "",
        "table": "S10.EGx8",
        "footnotes": [],
        "references": []
    },
    "id_table_17": {
        "caption": "",
        "table": "S10.EGx9",
        "footnotes": [],
        "references": []
    },
    "id_table_18": {
        "caption": "",
        "table": "S10.EGx10",
        "footnotes": [],
        "references": []
    },
    "id_table_19": {
        "caption": "",
        "table": "S10.EGx11",
        "footnotes": [],
        "references": []
    },
    "id_table_20": {
        "caption": "",
        "table": "S10.EGx12",
        "footnotes": [],
        "references": []
    },
    "id_table_21": {
        "caption": "",
        "table": "S10.EGx13",
        "footnotes": [],
        "references": []
    },
    "id_table_22": {
        "caption": "",
        "table": "S10.EGx14",
        "footnotes": [],
        "references": []
    },
    "id_table_23": {
        "caption": "",
        "table": "S8.T3.2",
        "footnotes": [],
        "references": []
    },
    "id_table_24": {
        "caption": "",
        "table": "S8.T4.8",
        "footnotes": [],
        "references": []
    },
    "id_table_25": {
        "caption": "",
        "table": "S8.T4.4.2.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_26": {
        "caption": "",
        "table": "S8.T4.8.6.7.1",
        "footnotes": [],
        "references": []
    },
    "id_table_27": {
        "caption": "",
        "table": "S8.T4.5.3.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_28": {
        "caption": "",
        "table": "S8.T4.8.6.8.1",
        "footnotes": [],
        "references": []
    },
    "id_table_29": {
        "caption": "",
        "table": "S8.T4.6.4.2.1",
        "footnotes": [],
        "references": []
    },
    "id_table_30": {
        "caption": "",
        "table": "S8.T4.8.6.10.1",
        "footnotes": [],
        "references": []
    },
    "id_table_31": {
        "caption": "",
        "table": "S8.T4.7.5.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_32": {
        "caption": "",
        "table": "S8.T4.8.6.11.1",
        "footnotes": [],
        "references": []
    },
    "id_table_33": {
        "caption": "",
        "table": "S8.T4.8.6.4.1",
        "footnotes": [],
        "references": []
    },
    "id_table_34": {
        "caption": "",
        "table": "S8.T5.8",
        "footnotes": [],
        "references": []
    },
    "id_table_35": {
        "caption": "",
        "table": "S8.T5.4.2.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_36": {
        "caption": "",
        "table": "S8.T5.8.6.7.1",
        "footnotes": [],
        "references": []
    },
    "id_table_37": {
        "caption": "",
        "table": "S8.T5.5.3.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_38": {
        "caption": "",
        "table": "S8.T5.8.6.8.1",
        "footnotes": [],
        "references": []
    },
    "id_table_39": {
        "caption": "",
        "table": "S8.T5.6.4.2.1",
        "footnotes": [],
        "references": []
    },
    "id_table_40": {
        "caption": "",
        "table": "S8.T5.8.6.10.1",
        "footnotes": [],
        "references": []
    },
    "id_table_41": {
        "caption": "",
        "table": "S8.T5.7.5.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_42": {
        "caption": "",
        "table": "S8.T5.8.6.11.1",
        "footnotes": [],
        "references": []
    },
    "id_table_43": {
        "caption": "",
        "table": "S8.T5.8.6.4.1",
        "footnotes": [],
        "references": []
    },
    "id_table_44": {
        "caption": "",
        "table": "S8.T6.8",
        "footnotes": [],
        "references": []
    },
    "id_table_45": {
        "caption": "",
        "table": "S8.T6.4.2.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_46": {
        "caption": "",
        "table": "S8.T6.8.6.7.1",
        "footnotes": [],
        "references": []
    },
    "id_table_47": {
        "caption": "",
        "table": "S8.T6.5.3.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_48": {
        "caption": "",
        "table": "S8.T6.8.6.8.1",
        "footnotes": [],
        "references": []
    },
    "id_table_49": {
        "caption": "",
        "table": "S8.T6.6.4.2.1",
        "footnotes": [],
        "references": []
    },
    "id_table_50": {
        "caption": "",
        "table": "S8.T6.8.6.10.1",
        "footnotes": [],
        "references": []
    },
    "id_table_51": {
        "caption": "",
        "table": "S8.T6.7.5.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_52": {
        "caption": "",
        "table": "S8.T6.8.6.11.1",
        "footnotes": [],
        "references": []
    },
    "id_table_53": {
        "caption": "",
        "table": "S8.T6.8.6.4.1",
        "footnotes": [],
        "references": []
    },
    "id_table_54": {
        "caption": "",
        "table": "S8.T7.8",
        "footnotes": [],
        "references": []
    },
    "id_table_55": {
        "caption": "",
        "table": "S8.T7.4.2.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_56": {
        "caption": "",
        "table": "S8.T7.8.6.7.1",
        "footnotes": [],
        "references": []
    },
    "id_table_57": {
        "caption": "",
        "table": "S8.T7.5.3.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_58": {
        "caption": "",
        "table": "S8.T7.8.6.8.1",
        "footnotes": [],
        "references": []
    },
    "id_table_59": {
        "caption": "",
        "table": "S8.T7.6.4.2.1",
        "footnotes": [],
        "references": []
    },
    "id_table_60": {
        "caption": "",
        "table": "S8.T7.8.6.10.1",
        "footnotes": [],
        "references": []
    },
    "id_table_61": {
        "caption": "",
        "table": "S8.T7.7.5.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_62": {
        "caption": "",
        "table": "S8.T7.8.6.11.1",
        "footnotes": [],
        "references": []
    },
    "id_table_63": {
        "caption": "",
        "table": "S8.T7.8.6.4.1",
        "footnotes": [],
        "references": []
    },
    "id_table_64": {
        "caption": "",
        "table": "S8.T8.8",
        "footnotes": [],
        "references": []
    },
    "id_table_65": {
        "caption": "",
        "table": "S8.T8.4.2.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_66": {
        "caption": "",
        "table": "S8.T8.8.6.7.1",
        "footnotes": [],
        "references": []
    },
    "id_table_67": {
        "caption": "",
        "table": "S8.T8.5.3.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_68": {
        "caption": "",
        "table": "S8.T8.8.6.8.1",
        "footnotes": [],
        "references": []
    },
    "id_table_69": {
        "caption": "",
        "table": "S8.T8.6.4.2.1",
        "footnotes": [],
        "references": []
    },
    "id_table_70": {
        "caption": "",
        "table": "S8.T8.8.6.10.1",
        "footnotes": [],
        "references": []
    },
    "id_table_71": {
        "caption": "",
        "table": "S8.T8.7.5.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_72": {
        "caption": "",
        "table": "S8.T8.8.6.11.1",
        "footnotes": [],
        "references": []
    },
    "id_table_73": {
        "caption": "",
        "table": "S8.T8.8.6.4.1",
        "footnotes": [],
        "references": []
    },
    "id_table_74": {
        "caption": "",
        "table": "S8.T9.8",
        "footnotes": [],
        "references": []
    },
    "id_table_75": {
        "caption": "",
        "table": "S8.T9.4.2.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_76": {
        "caption": "",
        "table": "S8.T9.8.6.7.1",
        "footnotes": [],
        "references": []
    },
    "id_table_77": {
        "caption": "",
        "table": "S8.T9.5.3.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_78": {
        "caption": "",
        "table": "S8.T9.8.6.8.1",
        "footnotes": [],
        "references": []
    },
    "id_table_79": {
        "caption": "",
        "table": "S8.T9.6.4.2.1",
        "footnotes": [],
        "references": []
    },
    "id_table_80": {
        "caption": "",
        "table": "S8.T9.8.6.10.1",
        "footnotes": [],
        "references": []
    },
    "id_table_81": {
        "caption": "",
        "table": "S8.T9.7.5.3.1",
        "footnotes": [],
        "references": []
    },
    "id_table_82": {
        "caption": "",
        "table": "S8.T9.8.6.11.1",
        "footnotes": [],
        "references": []
    },
    "id_table_83": {
        "caption": "",
        "table": "S8.T9.8.6.4.1",
        "footnotes": [],
        "references": []
    },
    "id_table_84": {
        "caption": "",
        "table": "S8.1.1",
        "footnotes": [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        "references": []
    }
}