{
    "id_table_1": {
        "caption": "Table 1.  The breakdown of TNM classifications for the 100 fictional lung cancer patients.",
        "table": "S2.T1.1",
        "footnotes": [],
        "references": [
            "An overview of the experimental process is schematically summarized in  Fig.   1 .",
            "Two radiologists from our team generated CT findings for 100 fictional lung cancer patients, along with TNM classifications based on the latest lung cancer staging guideline in Japan, i.e., the 8th edition of the General Rule for Clinical and Pathological Record of Lung Cancer  ( theJapanLungCancerSociety,  ) . The CT findings and TNM classifications were subsequently reviewed and confirmed by two additional radiologists. The entire process was verified by a senior radiologist. The breakdown of TNM classifications for the 100 fictional lung cancer patients is listed in  Table   1 . All the fictional CT findings with TNM classifications are available in Online Resource 1 2 2 2 Online Resources 1 to 3 can be found in the ancillary files uploaded with this paper on arXiv. , with the first of the 100 cases provided below as an example:"
        ]
    },
    "id_table_2": {
        "caption": "",
        "table": "S2.T1.1.1.1.1.1",
        "footnotes": [],
        "references": [
            "In the experiment using 100 fictional lung cancer cases, NotebookLM with REK diagnosed TNM classifications with a high accuracy of  \\qty 86, whereas GPT-4o with REK showed a lower diagnostic accuracy of  \\qty 39, and without REK, it dropped further to  \\qty 25 ( Fig.   2 ). In contrast to GPT-4o with and without REK, NotebookLM explicitly presented the reference locations it searched within the REK as the basis for its diagnoses (see  Footnote   2  for an example), and its search accuracy, representing the appropriateness of these locations, was quite high at  \\qty 95 ( Fig.   2 ). A similar trend was observed in the diagnostic accuracies for each of the T, N, and M factors, and in particular, NotebookLMs diagnostic accuracy for the T factor was notably higher than that of GPT-4o with and without REK ( Fig.   4 ). Even so, with the high accuracy of NotebookLM, there were a few cases where, similar to GPT-4o, NotebookLM made errors in numerical comparisons (see  Footnote   2  for an example).",
            "There have been several previous studies on lung cancer stage classification using traditional LLMs, including GPT-4o, but their diagnostic accuracy is not considered high enough for clinical application  ( Nakamura,  ;  Matsuo,  ;  Lee,  ) . Similarly, in our experiment, the accuracy of lung cancer staging by GPT-4o was found to be insufficient ( Figs.   2  and  4 ). As the guidelines for lung cancer TNM classification in various countries are frequently updated, the difficulty in determining which standards to reference from the vast amount of online information may be one reason for the low diagnostic accuracy of traditional LLMs.",
            "To improve the diagnostic accuracy of LLMs, we provided the latest lung cancer staging guideline in Japan as REK to the LLMs. As seen in  Figs.   2  and  4 , providing GPT-4o with the REK in its prompt resulted in slightly better performance compared to when the REK was not provided, but the diagnostic accuracy was still not sufficient. On the other hand, NotebookLM with REK demonstrated remarkably high diagnostic accuracy. This is likely because NotebookLM is designed to generate responses exclusively based on the provided REK through RAG, avoiding irrelevant information.",
            "In our experiment, unlike GPT-4o, NotebookLM was able to clearly indicate the reference locations it found within the REK (see  Footnote   2  for an example), and its search accuracy was notably high ( Fig.   2 ). Although the search accuracy was slightly short of  \\qty 100, at  \\qty 95, the explicit indication of reference locations allows radiologists to easily verify the correctness of NotebookLMs responses as needed, making it a promising tool for providing reliable assistance in clinical diagnosis.",
            "Among the cases where the reference locations identified within the REK by NotebookLM were appropriate, there were a few instances of diagnostic errors, primarily caused by numerical comparison mistakes (see  Footnote   2  for an example). Such numerical reasoning errors were observed in GPT-4o as well and are recognized as a common issue with LLMs in general  ( Li,  ) . This is not an issue that can be resolved by RAG, and we hope that future advancements in LLMs will provide a solution."
        ]
    },
    "id_table_3": {
        "caption": "",
        "table": "S2.T1.1.2.2.1.1",
        "footnotes": [],
        "references": []
    },
    "id_table_4": {
        "caption": "",
        "table": "S2.T1.1.3.3.1.1",
        "footnotes": [],
        "references": [
            "In the experiment using 100 fictional lung cancer cases, NotebookLM with REK diagnosed TNM classifications with a high accuracy of  \\qty 86, whereas GPT-4o with REK showed a lower diagnostic accuracy of  \\qty 39, and without REK, it dropped further to  \\qty 25 ( Fig.   2 ). In contrast to GPT-4o with and without REK, NotebookLM explicitly presented the reference locations it searched within the REK as the basis for its diagnoses (see  Footnote   2  for an example), and its search accuracy, representing the appropriateness of these locations, was quite high at  \\qty 95 ( Fig.   2 ). A similar trend was observed in the diagnostic accuracies for each of the T, N, and M factors, and in particular, NotebookLMs diagnostic accuracy for the T factor was notably higher than that of GPT-4o with and without REK ( Fig.   4 ). Even so, with the high accuracy of NotebookLM, there were a few cases where, similar to GPT-4o, NotebookLM made errors in numerical comparisons (see  Footnote   2  for an example).",
            "There have been several previous studies on lung cancer stage classification using traditional LLMs, including GPT-4o, but their diagnostic accuracy is not considered high enough for clinical application  ( Nakamura,  ;  Matsuo,  ;  Lee,  ) . Similarly, in our experiment, the accuracy of lung cancer staging by GPT-4o was found to be insufficient ( Figs.   2  and  4 ). As the guidelines for lung cancer TNM classification in various countries are frequently updated, the difficulty in determining which standards to reference from the vast amount of online information may be one reason for the low diagnostic accuracy of traditional LLMs.",
            "To improve the diagnostic accuracy of LLMs, we provided the latest lung cancer staging guideline in Japan as REK to the LLMs. As seen in  Figs.   2  and  4 , providing GPT-4o with the REK in its prompt resulted in slightly better performance compared to when the REK was not provided, but the diagnostic accuracy was still not sufficient. On the other hand, NotebookLM with REK demonstrated remarkably high diagnostic accuracy. This is likely because NotebookLM is designed to generate responses exclusively based on the provided REK through RAG, avoiding irrelevant information."
        ]
    },
    "global_footnotes": [
        "Online Resources 1 to 3 can be found in the ancillary files uploaded with this paper on arXiv.",
        "Online Resources 1 to 3 can be found in the ancillary files uploaded with this paper on arXiv.",
        "Online Resources 1 to 3 can be found in the ancillary files uploaded with this paper on arXiv.",
        "Online Resources 1 to 3 can be found in the ancillary files uploaded with this paper on arXiv."
    ]
}