{
    "id_table_1": {
        "caption": "Table 1:  Information of Raw Datasets",
        "table": "S5.T1.24",
        "footnotes": [],
        "references": [
            "For the rest of the paper, it is organized as following. Section  2  provides an overview on previous works studying the meaningfulness of NNS. And in Section  3 , we provide precise mathematical definition to the relative contrast, local intrinsic dimensionality, and nearest neighbor search. In Section  4 , we provide meticulous discussion on what is a meaningful NNS. Then, starting from Section  5.1 , we discuss experiment settings of the study. And starting from Section  5.3 , we demonstrate the experimental results and performed analysis. Lastly, in Section  6 , we end the paper with a brief summary of discussion.",
            "To obtain a more compressive overview regarding the relation between RC and LID, we conduct an experiment, using  25 25 25 25  dataset of various modalities and various dimensionality, to evaluate the homogeneity of two different metrics. In Fig. 1 , it shows that the RC and LID exhibit almost identical behaviour. It means that if a dataset is considered to be meaningful by one metric, the other will give the same comment, vice versa.",
            "Therefore, considering the emphasis of scopes of RC and LID, as well as the experimental result in Fig. 1 , we select the relative contrast (RC) as the measure for the meaningfulness of nearest neighbor search problem. Additionally, in this subsection, we only discuss reasons that the RC is selected as the measure, and studies on the meaningfulness of various datasets, will be discussed, from different perspectives, starting from Section  5.3 .",
            "In this study, we include several types of different vector data in the high-dimensional space. Overall, we primarily focus on the following: synthesized random vector datasets, following Gaussian distribution; vectors extracted from image feature using traditional algorithm in computer vision (SIFT1M [ 24 ]  and GIST1M [ 30 ] ); text embeddings are generated with prestigious embedding models [ 32 ,  34 ]  with real-world text datasets [ 9 ,  25 ,  21 ,  22 ,  33 ,  7 ] . To further diversify modalities of datasets, we include two image embedding datasets [ 27 ,  39 ] , generated by the State-of-the-Art CLIP  [ 31 ]  by OpenAI. Technical details of datasets could be found with Table  1 ."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Technical Details: Text Embedding Models",
        "table": "S5.T2.1",
        "footnotes": [],
        "references": [
            "For the rest of the paper, it is organized as following. Section  2  provides an overview on previous works studying the meaningfulness of NNS. And in Section  3 , we provide precise mathematical definition to the relative contrast, local intrinsic dimensionality, and nearest neighbor search. In Section  4 , we provide meticulous discussion on what is a meaningful NNS. Then, starting from Section  5.1 , we discuss experiment settings of the study. And starting from Section  5.3 , we demonstrate the experimental results and performed analysis. Lastly, in Section  6 , we end the paper with a brief summary of discussion.",
            "To illustrate how these distance similar vectors appear in the original space, we present two examples of two modalities: Fig.  2  and Fig.  3 , where NNS effectively retrieves these similar objects within the original space."
        ]
    },
    "global_footnotes": []
}