{
    "id_table_1": {
        "caption": "TABLE I:  Comparison of QDGset with available object-centric grasping datasets.",
        "table": "Sx1.EGx1",
        "footnotes": [],
        "references": [
            "We leverage this approach to introduce  QDGset  (Fig.  1 ), a large-scale dataset of about 60M parallel jaw gripper grasps and 40k simulated objects, which is significantly larger than the state-of-the-art;",
            "QDGset.  Table  I  compares QDGSet with available 6DoF pose datasets for 2-finger grippers. The generated dataset contains 29651 objects, reaching 40353 objects when including the augmented ones. Considering the diversity of included objects (Fig.  1 ), augmented ones can be considered as new objects: an augmented bottle results in many realistic 3D meshes of bottles (Fig.  6 ). Their difference is comparable to mugs that can be found in KIT, 3DNet, or YCB datasets, or even several objects from redundant datasets such as KIT or ShapeNet. This amount of objects is 4.5 times greater than the widely used ACRONYM set  [ 18 ] .",
            "Moreover, QDGset contains 62M grasps, up to 3.5 times more than previous state-of-the-art  [ 18 ] . Both objects and grasp poses are diverse (Fig.  1 ) and have been produced with QDG-6DoF sample efficiency  [ 26 ] . This work takes a step further with the proposed bootstrapping method, which increases the sample efficiency even more."
        ]
    },
    "id_table_2": {
        "caption": "",
        "table": "S3.T1.1",
        "footnotes": [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        "references": [
            "Grasp transfer.  Fig.  2  overviews the proposed approach. A 3D model of a gripper and an object contact meshes are provided to QDG-6DoF for generating some grasp poses. The 3D model of the object is then augmented by applying the previously described linear deformations. The resulting augmented objects are then provided with a QDG-6DoF process, which is initialized with the grasps found on the reference object. The optimization process is stopped right after this bootstrapping step, reducing the number of evaluations. It results in new objects and associated grasp poses, obtained at limited cost (see section  V )."
        ]
    }
}