{
    "id_table_1": {
        "caption": "",
        "table": "Ax1.EGx1",
        "footnotes": [],
        "references": [
            "This pipeline is visually reported in  fig.   1 .",
            "The full pseudocode of the MA-XRF data generation is reported in  algorithm   1  (from  [ 30 ] ).",
            "We now report few examples extracted from the test dataset. For each example, we show a triplet of figures: the leftmost one, is the embedded synthetic MA-XRF image; the middle one, is the output of the SmallUViT; the rightmost one, is the true RGB image. On top of the image in the middle are reported two metric scores, computed between the prediction and the target: the Multi-Scale Similarity Index, and the  Universal Image Quality Index  (UiQi)  [ 82 ] . The four examples presented in  figs.   6 ,  7 ,  8  and  9  are selected because they present relevant feature of the inference of the model (pros and cons); they are not the ones with the higher MS-SSIM nor UiQi scores in the test dataset. Furthermore, we choose to show the comparison of the inferred RGB with the actual (resized) image, and not with its  IKMeans IKMeans \\mathrm{IKMeans} roman_IKMeans  clustered version employed in the synthetic dataset generating algorithm (we refer to  algorithm   1 ).",
            "Interesting examples are  fig.   6 ,  fig.   7 ; the network was able of identifying the dark colours (the blueish black and the dark blue of the background, as well as the black of the jacket), the light colours (the white and the light blue of the mans Ruff), and, quite surprisingly, the red, which is given (in the example) by the embedding of signals formed (in part) by a red ochre, which is, in composition, quite similar to the Gold Ochre 8 8 8 At least, in the spectra contained in the database we use. See  https://infraart.inoe.ro/sample/1578/show/  and  https://infraart.inoe.ro/sample/130/show/  for yellow and red ochre, respectively. From  [ 38 ] . . Yet, the incarnate has been not properly coloured, at least in  fig.   7  (instead, for the peculiar visual aspect of  fig.   6 , the  IKMeans IKMeans \\mathrm{IKMeans} roman_IKMeans  clustering performed on the RGB has to be blamed, see  fig.   10a ). The poor performance on such incarnate may also be attributed to the complex pigment selection during this image generation - fact that can be hinted from the false rgb representation of the embedded synthetic MA-XRF.",
            "In  fig.   8 , the model correctly coloured the frames yellow (a difficult pigment), the leaves greens are quite correctly identified and, apart from a slight colour deviation, so are the ground and horses colours. Yet, no clouds appears in the sky. This is due to the aforementioned RGB clustering (see  fig.   10c )."
        ]
    }
}