{
    "id_table_1": {
        "caption": "Table 1:  States, U.S. census divisions, climatic zones and usage.",
        "table": "Sx4.T1.1",
        "footnotes": [],
        "references": [
            "In the second step, we employ a bottom-up approach to generate hourly solar production using an analytical model, where we have focused on the detailed aspect of hourly rooftop solar energy production for households across the U.S. In addition, we quantify uncertainties associated with each household for every hour. This method enables us to produce data with high spatial and temporal resolution, facilitating aggregation to broader scales, from households to census tracts, counties, states, and the entire country, or to any temporal resolution, including hourly, daily, weekly, monthly, or specific years (Figure  1 a). The dataset is validated against existing real-world datasets from Lawrence Berkeley Lab (LBNL) residential solar project  [ 14 ] , DeepSolar project  [ 7 ,  9 ]  and Pecan Street  [ 22 ] . Finally, using our framework and the datasets, we present a case study on the effect of different policies in the penetration of rooftop solar adoption in the Commonwealth of Virginia (VA). Our analysis has three key components: individual characteristics, peer effects, and spatial factors, thereby offering a holistic view of solar adoption penetration. We also analyze the distribution of solar adoption across Low-to-Moderate-Income (LMI) and non-LMI communities in both rural and urban settings. This analysis provides valuable insights into the relationships between rooftop solar adoption and local socioeconomic and demographic characteristics.",
            "As an initial step, we identify solar adopters in each state of the U.S. (methodology is outlined in Section  Identification of solar adopters  and the pre-processing steps along with the performance metrics are given in Supplementary Note 2 and Supplementary Note 3). We then perform county-level solar adoption visualization that offers insights into the geographic distribution of solar energy adoption across the U.S., highlighting areas with both high penetration and untapped potential. Results of the county-level adoption rates are shown in Figure  1 b. Solar adoption in each county is normalized with respect to the number of households in that county. This provides a comparative view of solar adoption relative to the population in each region. The Western states, particularly counties in California (CA), exhibit significantly higher adoption rates, followed by the Northeast. The map also reveals that the South trails behind the West regarding solar adoption. This observed pattern aligns with the general solar adoption trends in the U.S.  [ 25 ] .",
            "Our study focuses on different states in the U.S., chosen as representative examples for our result analysis and validation purposes. The details are described in Table  1 . For SQFTRANGE classification and spatial-temporal dynamics study, we selected five states across the U.S. These selected states bring insights into the spatial distribution and geographical nuances across the U.S. as they belong to different U.S. census divisions and climatic zones defined by the International Energy Conservation Code (IECC)  [ 42 ] .",
            "The SQFTRANGE classification predicted by the trained ensemble model, along with the voting mechanisms in the synthetic population of the representative states in Table  1 , is depicted in Figure  8 .",
            "The heatmap in Figure  10  shows daily solar energy patterns for four homes in each of the five states, chosen randomly from each month. In VA, homes are from Fairfax, Hampton, Lynchburg, and Wythe counties, covering a range of locations and sizes (1100-1700 ft2). All homes see lower solar production in November and December. An interesting April pattern shows the first two eastern homes with nearly no production at times, unlike the central and western homes. This possibly denotes cloud cover effects. Similar patterns are observed in LA and MA, suggesting regional cloud impacts. In December, an eastern home in VA shows minimal solar production, emphasizing climates role in solar generation. For LA, the study includes homes from East Carol, Beenville, Jefferson, and Morehouse, varying in size (1600-2700 ft2). Homes in neighboring eastern counties and a distinct southern countys home show different solar production patterns, with December seeing minimal production in most homes, highlighting seasonal effects. In ID, homes from Butte, Adams, Boundary, and Bannock reflect diverse solar production patterns, with square footage ranging from 1200-2800 ft2. Notably, a northern home (Boundary) shows unique patterns, and a localized cloud event in June significantly affected solar production. WA data for homes in Clark, Snohomish, Pacific, and Skagit counties (900-2300 ft2) reveal varied production trends, even among neighboring counties. Coastal homes exhibit unique patterns, with minimal production in January, consistent with seasonal variability observed in Figure  9 . MA covers homes in Hampden, Dukes, Berkshire, and Bristol, varying widely in size (800-3000 ft2). January shows unusually high production compared to other states, while November and December are low. A specific June date shows no morning production in the first and third homes, with Dukes Countys home maintaining normal levels but averaging lower production overall, indicating micro-geographical impacts on solar output.",
            "Finally, we analyze the yearly aggregate residential solar production with respect to roof area in the state of VA, as depicted in Figure  11 . This figure comprises three plots, each offering a different perspective on solar production relative to property size. The first plot provides a comprehensive overview of average yearly solar production, including its uncertainties, across various roof areas. The second plot delves into detail, presenting the distribution of households. Here, the frequency distribution is notably higher for roof areas ranging between 200-300  m 2 superscript m 2 m^{2} italic_m start_POSTSUPERSCRIPT 2 end_POSTSUPERSCRIPT  compared to other ranges. The plots in the second row further enhance this analysis by providing insights into the average solar production and its uncertainties across ten randomly selected households in each roof area range. Across all three roof area categories, the annual average solar production shows slight variations, mostly ranging between 4000 kWh and 7000 kWh. While total roof area is a contributing factor to this variability, other elements such as the number of planes, tilt, and orientation of the panels, as well as the location of the households also play a significant role in solar energy production.",
            "Figure  12  delves into individual SHAP waterfall plots for households in VA and NC, showcasing how different features affect solar adoption predictions. These plots highlight the importance of diversity in features across households.",
            "Figure  13  showcases two scatter plots, with the first pertaining to VA and the second to NC. In the VA plot, the focus is on the variability of a single feature, while the NC plot delves into the interplay between two key features: household income and year of construction. In the NC plot, YEARMADERANGE typically yields a positive SHAP value contribution in comparison to other values in its range. This effect is further amplified when paired with higher MONEYPY values (indicated by the pink coloration), in contrast to lower values (represented in blue), highlighting the significant influence of feature interaction on SHAP values.",
            "Similar to the VA-NC model, Figure  14  presents household-level plots to provide local insights into feature contributions. Unlike the household-level plots in VA-NC, where the same feature shows high importance across households within the state, the importance varies across both TX and NY. All four plots demonstrate that the final model output  f  ( x ) f x f(x) italic_f ( italic_x )  for these households is higher than the states mean output  E  ( f  ( x ) ) E f x E(f(x)) italic_E ( italic_f ( italic_x ) ) . Additionally, most feature values exhibit either a positive or negligibly negative impact on the model.",
            "Figure  15  is a scatter plot for Texas, which facilitates the understanding of the significance of interactions between features. It clearly shows that lower values, particularly a value of 2 in YEARMADERANGE, are associated with higher SHAP values. In this scenario, lower income values result in lower SHAP values, while middle and high-income values are correlated with higher SHAP values. However, it remains challenging to differentiate between the SHAP contributions of high and medium income levels, as the pairwise feature interaction does not offer adequate distinction. Furthermore, the SHAP value is significantly lower for YEARMADERANGE values greater than 2. The bars (composed of points) appear flipped in these ranges, indicating that the SHAP value increases as the MONEYPY decreases in these ranges of YEARMADERANGE.",
            "The last plot in the series for the TX-NY model comparison is a cohort multi-bar plot for the NY model, as shown in Figure  15 . This plot categorizes the data into different cohorts based on a specific feature and then compares the mean SHAP values of these cohorts using a multi-bar plot. This form of visualization aids in understanding the impact of features on the models predictions with respect to a particular segment. It is important to note that actual SHAP values can be either positive or negative, while the cohort bar plot primarily indicates the significance of a particular feature in influencing the SHAP value. In this figure, the cohorts are formed based on the key feature BEDROOMS. While BEDROOMS   \\geq   2.5 shows a higher feature contribution with a SHAP value of 6.2, it is crucial to recognize that the direction of this contribution is negative. This insight is obtained by analyzing this plot in conjunction with the bee swarm plot for the NY model presented in Figure  3 (b).",
            "We compared different real-world datasets (LBNL and DeepSolar) with our synthetic solar adopter dataset in Figure  16 . LBNL and DeepSolar define the lower and the upper bound in each state. They are calculated as:",
            "Synthetic solar adopters calibrated with LBNL dataset and DeepSolar dataset as the ground truths are depicted as green and red points respectively. The synthetic solar adopter counts are comparable to either of the datasets. Next, we compared the two available datasets in Figure  17 a. In 10 states, the relative percentage exceeds 100%, revealing significant differences between the two datasets. It is important to note that the LBNL solar adopter count is based on 2020 and is for single-family households; the DeepSolar solar adopter count is for 2022, which is more recent and considers all rooftops. The relative percentage difference between LBNLs real solar adopter data  [ 14 ]  and our synthetic data is depicted in Figure  17 b. DeepSolar solar adopter data  [ 9 ]  and our synthetic data are shown in Figure  17 c. As the LBNL dataset was also used as ground truth adopters, the discrepancy between the synthetic datasets and LBNLs real adopters is less compared to DeepSolar. In comparison between the LBNL dataset, 88% of states have a difference under 25%. Differences over 100% in states like ND, NE, SD, and WV are capped at 100% for visualization. These high discrepancies, especially in low-adoption areas, result in significant percentage differences. For instance, West Virginias actual count of 62 versus a synthetic 338 leads to a 449% difference. In comparison with the DeepSolar dataset, 60% of the states have a difference under 50%. Differences over 100% in the DeepSolar dataset are in states IA, ID, ND, and NC.",
            "Here, we describe our algorithms and runtime complexity for solar adoption and energy profile generation. The algorithm for the first step, i.e., predicting solar adopters, is presented in Algorithm  1 . The runtime complexity of this process is  O  ( m + h + p  log  p ) O m h p p \\mathcal{O}(m+h+p\\log p) caligraphic_O ( italic_m + italic_h + italic_p roman_log italic_p ) , where  m m m italic_m  denotes the model training and testing,  h h h italic_h  denotes the hyperparameter tuning for the Gaussian process, and  p  log  p p p p\\log p italic_p roman_log italic_p  is for sorting  X t  e  s  t subscript X t e s t X_{test} italic_X start_POSTSUBSCRIPT italic_t italic_e italic_s italic_t end_POSTSUBSCRIPT  by expected improvement, considering  p p p italic_p  points."
        ]
    },
    "id_table_2": {
        "caption": "Table 2:  Parameter values used in CSonNet simulation framework",
        "table": "Sx4.T2.9",
        "footnotes": [
            "",
            ""
        ],
        "references": [
            "Next, we summarize the solar energy production pattern across different geographic and temporal resolutions in Figure  2 . We selected Washington (WA), Virginia (VA), Idaho (ID), Louisiana (LA), and Massachusetts (MA) to act as representative states for the U.S. as they showcase diverse geographic regions, climates, and population densities, providing a comprehensive view of spatial-temporal dynamics across the country. Figure  2 (a) provides insights into month-to-month fluctuations in residential solar energy generation, influenced by geographic location and seasonal climatic variations. For instance, WA and ID demonstrate significant variations in their solar energy contributions during winter, likely influenced by their colder climate zones. July has the highest solar energy production for VA, ID, and WA, although LA and MA peak in May. Despite varied winter lows, the minor differences in solar output from spring through fall suggest a reliable level of solar energy generation during these periods, which can significantly reduce energy bills and offset carbon emissions. Figure  2 (b) compares hourly solar energy production by season, showing distinct seasonal curves for WA, MA, and ID. VAs spring and autumn curves overlap until noon, illustrating longer solar production in summer. LAs curves overlap, with winter morning production being the lowest. MA stands out with the highest solar energy production, nearly ten times that of other states, due to its large number of solar adopters. We provide more insights at different resolutions on the spatial and temporal dynamics in Supplementary Note 4.",
            "The list of modeling parameters along with a short description, range, and values chosen is shown in Table  2 . Parameter values are either obtained from the literature or calibrated during the simulation setup.",
            "Figure  12  delves into individual SHAP waterfall plots for households in VA and NC, showcasing how different features affect solar adoption predictions. These plots highlight the importance of diversity in features across households.",
            "The algorithms for the second step are given in two steps: ( i i i italic_i ) Algorithm  2  for time-invariant variables sample generation, and ( i  i i i ii italic_i italic_i ) Algorithm  3 . The first Algorithm is computed only once as these variables do not change w.r.t to time. The runtime complexity of Algorithm  2  is  O  ( N  ( n + P ) ) O  N n P \\mathcal{O}(N\\cdot(n+P)) caligraphic_O ( italic_N  ( italic_n + italic_P ) ) , where  N N N italic_N  is the number of houses,  n n n italic_n  is the number of samples generated and  P P P italic_P  is a set of planes."
        ]
    },
    "id_table_3": {
        "caption": "Supplementary Table 3:  Datasets used for this research",
        "table": "Sx5.T3.1",
        "footnotes": [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        "references": [
            "In Figure  3 , we purposefully selected the state-level solar adoption ML models for VA-North Carolina (NC) and Texas (TX)- New York (NY) state-level models to highlight their geographic, political, and climatic similarities/contrasts. The variables used and their descriptions are mentioned in Section  Synthetic household square footage range classification . In the VA-NC model [Figure  3 (a)], houses constructed recently (YEARMADERANGE) have high SHAP values for VA, suggesting their high contribution to solar adoption. Conversely, NC shows mid-range YEARMADERANGE with higher SHAP values. In this model, recent constructions negatively impact predictions. VA finds medium-sized properties and households with higher income (MONEYPY) positively influencing SHAP values, linking them to solar production. In NC, larger homes and middle incomes positively affect SHAP values, differing from VAs pattern.",
            "In the TX-NY model [Figure  3 (b)], a notable contrast is observed in the beeswarm plots for MONEYPY, where the direction and magnitude of this feature contribution appear to reverse between the two states. Property size significantly influences solar adoption predictions in the TX model, while in the NY model, household income and the number of bedrooms are identified as key determinants. Additional analysis for VA-NC and TX-NY models are presented in Supplementary Note 5. Thus, the contrasting SHAP value trends in the state-level models uncover the importance of property-specific details (e.g., square footage range and construction period), demographic characteristics (e.g., number of household members), and socio-economic factors (e.g., income level) across different geographic landscapes in solar adoption.",
            "The different datasets used in this research, along with the sections where they are used, is mentioned in Table  3 .",
            "Figure  13  showcases two scatter plots, with the first pertaining to VA and the second to NC. In the VA plot, the focus is on the variability of a single feature, while the NC plot delves into the interplay between two key features: household income and year of construction. In the NC plot, YEARMADERANGE typically yields a positive SHAP value contribution in comparison to other values in its range. This effect is further amplified when paired with higher MONEYPY values (indicated by the pink coloration), in contrast to lower values (represented in blue), highlighting the significant influence of feature interaction on SHAP values.",
            "The last plot in the series for the TX-NY model comparison is a cohort multi-bar plot for the NY model, as shown in Figure  15 . This plot categorizes the data into different cohorts based on a specific feature and then compares the mean SHAP values of these cohorts using a multi-bar plot. This form of visualization aids in understanding the impact of features on the models predictions with respect to a particular segment. It is important to note that actual SHAP values can be either positive or negative, while the cohort bar plot primarily indicates the significance of a particular feature in influencing the SHAP value. In this figure, the cohorts are formed based on the key feature BEDROOMS. While BEDROOMS   \\geq   2.5 shows a higher feature contribution with a SHAP value of 6.2, it is crucial to recognize that the direction of this contribution is negative. This insight is obtained by analyzing this plot in conjunction with the bee swarm plot for the NY model presented in Figure  3 (b).",
            "The algorithms for the second step are given in two steps: ( i i i italic_i ) Algorithm  2  for time-invariant variables sample generation, and ( i  i i i ii italic_i italic_i ) Algorithm  3 . The first Algorithm is computed only once as these variables do not change w.r.t to time. The runtime complexity of Algorithm  2  is  O  ( N  ( n + P ) ) O  N n P \\mathcal{O}(N\\cdot(n+P)) caligraphic_O ( italic_N  ( italic_n + italic_P ) ) , where  N N N italic_N  is the number of houses,  n n n italic_n  is the number of samples generated and  P P P italic_P  is a set of planes.",
            "For Algorithm  3 , the period  T T T italic_T  depends on the type of input specified by the user. It can be a date  t t t italic_t , year-month, or year-week combination. The runtime complexity of the framework is  O  ( N + ( ( ( N  W ) / w  o  r  k  e  r  _  s  i  z  e ) +  )  T ) O N   N W w o r k e r _ s i z e italic- T \\mathcal{O}(N+(((N\\cdot W)/worker\\_size)+\\epsilon)\\cdot T) caligraphic_O ( italic_N + ( ( ( italic_N  italic_W ) / italic_w italic_o italic_r italic_k italic_e italic_r _ italic_s italic_i italic_z italic_e ) + italic_ )  italic_T )  where  N N N italic_N  is the number of houses,  W W W italic_W  is the total number of hours (24 hours),  w  o  r  k  e  r  _  s  i  z  e w o r k e r _ s i z e worker\\_size italic_w italic_o italic_r italic_k italic_e italic_r _ italic_s italic_i italic_z italic_e  is the size of the worker processes,   italic- \\epsilon italic_  denotes the communication overhead between the worker processes and main process and  T T T italic_T  is a constant number based on the type of period input specified by the user. The size of worker processes depends on the number of nodes allocated based on the number of solar-adopted houses in  c c c italic_c ."
        ]
    },
    "id_table_4": {
        "caption": "Supplementary Table 4:   Variables used and their explanations",
        "table": "Sx5.T4.1",
        "footnotes": [],
        "references": [
            "In Figure  4 a, we compared the synthetic solar adopter counts with two residential solar adopter datasets. The results show that the synthetic solar adopter counts are analogous to the two real-world residential solar adopter datasets. More detailed insights on the solar adopter validation are presented in Supplementary Note 6. Next, we compared daily load patterns between the Pecan Street and our synthetic dataset for TX and NY, selecting an equivalent number of households through random sampling from the synthetic dataset. The average monthly Pearson correlation coefficients calculated between pairs of randomly selected synthetic households and Pecan Street households for every hour are shown in Figure  4 (b) and they reveal a consistently high positive correlation for both states across all months. We compare solar generation distributions from Pecan Street data and synthetic data in kWh in Figures  4 (c) and  4 (d). In Figure  4 (c), the Pecan Street dataset is represented as a solid blue curve. The mean and standard deviation of the synthetic data are represented by solid and dotted red curves, respectively, enveloping the blue curve. Jensen Shannon Divergence (JSD) values for TXs distributions are 0.18 (histogram) and 0.42 (KDE). In Figure  4 (d), the synthetic data is shown in green, comparing NYs distributions. The JSD values are 0.39 (histogram) and 0.12 (KDE).",
            "Similar to the VA-NC model, Figure  14  presents household-level plots to provide local insights into feature contributions. Unlike the household-level plots in VA-NC, where the same feature shows high importance across households within the state, the importance varies across both TX and NY. All four plots demonstrate that the final model output  f  ( x ) f x f(x) italic_f ( italic_x )  for these households is higher than the states mean output  E  ( f  ( x ) ) E f x E(f(x)) italic_E ( italic_f ( italic_x ) ) . Additionally, most feature values exhibit either a positive or negligibly negative impact on the model."
        ]
    },
    "id_table_5": {
        "caption": "Supplementary Table 5:   Performance Metrics for each of the five chosen divisions: The table consists of Test Accuracy percentages from the RF classifier, GB classifier, and SVM classifier presented in the second column, and F1 score metrics in the percentage provided in the third column.",
        "table": "Sx5.T5.1",
        "footnotes": [],
        "references": [
            "Figure  5 a summarizes our policy study results and shows overall solar adoption trends: Cases 4, 1b, and 5 have unique patterns, while Cases 1a, 2a, 2b, and 3 follow similar paths. The 30% tax credit policy leads to the highest adoption in all communities. Figure  5 b reveals that equal opportunity policies are effective in urban and rural LMI areas, influenced by community and network structures. This suggests the significant role of community effects and peer influence in adoption, with non-LMI adopters notably impacting overall penetration. Our case study suggest that policy interventions, like tax credits to all individuals, are essential for higher adoption.",
            "We calculate residential solar energy profiles for each household using the Equation  5 .",
            "Finally, we compute the household rooftop PV energy hourly profiles using Equation  5 . This equation estimates the energy generated by a household PV system, measured in kilowatt-hours for each hour of the day. To analyze the variability and typical performance of these systems, we calculate the mean and standard deviation of the generated energy values. For each hour, we consider all possible energy output values and compute their average (mean) and measure of variability (standard deviation). This statistical approach provides insights into the expected performance of a household PV system under different settings. We describe the algorithms and running time complexity of solar adoption and energy profile generation in Supplementary Note 7.",
            "Next, the square footage range classification performance metrics are presented in Table  5 . Although the accuracy and F1 scores for all divisions fall below 80%, the confusion matrices in Table  6  for the validation set and Table  7  for the test set indicate that the square footage range is predominantly classified into neighboring ranges, which is acceptable for our analysis. The other divisions exhibit patterns similar to those of the South Atlantic division.",
            "Figure  15  is a scatter plot for Texas, which facilitates the understanding of the significance of interactions between features. It clearly shows that lower values, particularly a value of 2 in YEARMADERANGE, are associated with higher SHAP values. In this scenario, lower income values result in lower SHAP values, while middle and high-income values are correlated with higher SHAP values. However, it remains challenging to differentiate between the SHAP contributions of high and medium income levels, as the pairwise feature interaction does not offer adequate distinction. Furthermore, the SHAP value is significantly lower for YEARMADERANGE values greater than 2. The bars (composed of points) appear flipped in these ranges, indicating that the SHAP value increases as the MONEYPY decreases in these ranges of YEARMADERANGE.",
            "The last plot in the series for the TX-NY model comparison is a cohort multi-bar plot for the NY model, as shown in Figure  15 . This plot categorizes the data into different cohorts based on a specific feature and then compares the mean SHAP values of these cohorts using a multi-bar plot. This form of visualization aids in understanding the impact of features on the models predictions with respect to a particular segment. It is important to note that actual SHAP values can be either positive or negative, while the cohort bar plot primarily indicates the significance of a particular feature in influencing the SHAP value. In this figure, the cohorts are formed based on the key feature BEDROOMS. While BEDROOMS   \\geq   2.5 shows a higher feature contribution with a SHAP value of 6.2, it is crucial to recognize that the direction of this contribution is negative. This insight is obtained by analyzing this plot in conjunction with the bee swarm plot for the NY model presented in Figure  3 (b)."
        ]
    },
    "id_table_6": {
        "caption": "Supplementary Table 6:   Confusion matrix for validation set for South Atlantic division",
        "table": "Sx5.T6.1",
        "footnotes": [],
        "references": [
            "We aim to generate hourly PV energy profiles for households that have adopted solar energy. All datasets, the variables/abbreviations along with their explanations used in this research are mentioned in Supplementary Note 1. We employ the synthetic population dataset  [ 31 ]  for this purpose. However, this dataset lacks detailed information on household square footage and solar adoption status. To overcome this limitation, we integrate data from the RECS to enrich the synthetic population with the necessary details on square footage and solar adoption. After identifying the solar adopters, we proceed with the energy profile generation for the solar-adopted households. Our approach for solar adoption and PV energy profile generation is presented in Figure  6 . Our methodology unfolds in three distinct steps to systematically enhance the dataset and produce reliable PV energy profiles: ( i i i italic_i ) classifying synthetic households into predetermined square footage range categories (Synthetic household square footage range classification), ( i  i i i ii italic_i italic_i ) identifying the households within the synthetic population that have solar panels (Identification of solar adopters), and ( i  i  i i i i iii italic_i italic_i italic_i ) producing hourly PV energy profiles for homes recognized as solar energy adopters (Generation of Hourly PV Energy Profiles).",
            "First, we generate weighted random samples for the number of planes in the roof  [ 40 ] . Next, we proceed to calculate the suitable roof area. The households are categorized based on their roof size, and specific parameters  [ 40 ]  are assigned according to the number of planes in the roof. Utilizing a uniform distribution, we generate a set of roof areas and apply an exponential probability density function to assign weights to these areas, reflecting their suitability for solar installation  [ 40 ] . Next, we employ a weighted sampling technique to select a subset of suitable areas. This approach ensures a tailored identification of possible solar installation areas, accommodating the diverse characteristics and orientations of household roofs. We employ a uniform sampling mechanism to select each sample with equal probability for solar yield and performance ratio. We estimate potential roof tilts and azimuth directions for the household by using weighted random sampling mechanism. The weights are assigned based on the distribution of rooftop planes in each tilt and azimuth category building type, as informed by the existing literature  [ 40 ] . We calculate the radiation incident on a tilted surface by using the equation  6   [ 41 ] . We also apply a degradation value based on the selected azimuth direction (  i subscript  i \\omega_{i} italic_ start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT ).",
            "Next, the square footage range classification performance metrics are presented in Table  5 . Although the accuracy and F1 scores for all divisions fall below 80%, the confusion matrices in Table  6  for the validation set and Table  7  for the test set indicate that the square footage range is predominantly classified into neighboring ranges, which is acceptable for our analysis. The other divisions exhibit patterns similar to those of the South Atlantic division.",
            "We compared different real-world datasets (LBNL and DeepSolar) with our synthetic solar adopter dataset in Figure  16 . LBNL and DeepSolar define the lower and the upper bound in each state. They are calculated as:"
        ]
    },
    "id_table_7": {
        "caption": "Supplementary Table 7:   Confusion matrix for test set for South Atlantic division",
        "table": "Sx5.T7.1",
        "footnotes": [],
        "references": [
            "SQFTRANGE classification is a pre-processing step before proceeding with solar adoption, as this is one of the features used to predict adoption. The correlation matrix before and after SMOTE to address the class imbalance issue in the South Atlantic division is presented in Figure  7 . The values in the matrix range from 0, indicating low correlation, to 1, denoting high correlation. The left panel displays the matrix for the original dataset from the South Atlantic division of the RECS survey, while the right panel shows the matrix post-application of SMOTE. The correlation between features remains consistent after applying SMOTE. This consistency is observed in other divisions as well. Besides input features, the matrix also includes the output label SQFTRANGE. Furthermore, the variable SOLAR is included to examine its correlation with other variables.",
            "Next, the square footage range classification performance metrics are presented in Table  5 . Although the accuracy and F1 scores for all divisions fall below 80%, the confusion matrices in Table  6  for the validation set and Table  7  for the test set indicate that the square footage range is predominantly classified into neighboring ranges, which is acceptable for our analysis. The other divisions exhibit patterns similar to those of the South Atlantic division.",
            "Synthetic solar adopters calibrated with LBNL dataset and DeepSolar dataset as the ground truths are depicted as green and red points respectively. The synthetic solar adopter counts are comparable to either of the datasets. Next, we compared the two available datasets in Figure  17 a. In 10 states, the relative percentage exceeds 100%, revealing significant differences between the two datasets. It is important to note that the LBNL solar adopter count is based on 2020 and is for single-family households; the DeepSolar solar adopter count is for 2022, which is more recent and considers all rooftops. The relative percentage difference between LBNLs real solar adopter data  [ 14 ]  and our synthetic data is depicted in Figure  17 b. DeepSolar solar adopter data  [ 9 ]  and our synthetic data are shown in Figure  17 c. As the LBNL dataset was also used as ground truth adopters, the discrepancy between the synthetic datasets and LBNLs real adopters is less compared to DeepSolar. In comparison between the LBNL dataset, 88% of states have a difference under 25%. Differences over 100% in states like ND, NE, SD, and WV are capped at 100% for visualization. These high discrepancies, especially in low-adoption areas, result in significant percentage differences. For instance, West Virginias actual count of 62 versus a synthetic 338 leads to a 449% difference. In comparison with the DeepSolar dataset, 60% of the states have a difference under 50%. Differences over 100% in the DeepSolar dataset are in states IA, ID, ND, and NC."
        ]
    },
    "id_table_8": {
        "caption": "Supplementary Table 8:   Performance metrics for solar adoption classification in each of the five chosen states.",
        "table": "Sx5.T8.2",
        "footnotes": [],
        "references": [
            "The SQFTRANGE classification predicted by the trained ensemble model, along with the voting mechanisms in the synthetic population of the representative states in Table  1 , is depicted in Figure  8 .",
            "\\beta italic_  value to reduce wrong predictions is set between 0 and 2. We also adjust the decision threshold,    \\tau italic_ , from 0.05 to 0.95 to further address the class imbalance issue. The values of    \\beta italic_  and    \\tau italic_ , along with accuracy and F1-score, are shown in Table  8 . Most states showed high accuracy and F1-score, but MA had lower scores, around 70%. The difference between the actual number of solar adopters and our predicted number is small, at 1.95%, according to the Berkeley Lab dataset  [ 14 ] ."
        ]
    },
    "id_table_9": {
        "caption": "Supplementary Table 9:  Synthetic solar adopter comparison calibrated using DeepSolar and LBNL",
        "table": "Sx5.EGx1",
        "footnotes": [],
        "references": [
            "Pie charts in Figure  9  reveal seasonal solar production variations, highlighting that summer has the highest output across all states, followed by spring, autumn, and winter. WA and ID contribute 11% and 13.3% in winter, while MA contributes 15.3%, indicating that cold climates impact solar output. LA shows consistent summer, spring, and fall contributions around 25% to 29%, with a notable 19% in winter.",
            "The heatmap in Figure  10  shows daily solar energy patterns for four homes in each of the five states, chosen randomly from each month. In VA, homes are from Fairfax, Hampton, Lynchburg, and Wythe counties, covering a range of locations and sizes (1100-1700 ft2). All homes see lower solar production in November and December. An interesting April pattern shows the first two eastern homes with nearly no production at times, unlike the central and western homes. This possibly denotes cloud cover effects. Similar patterns are observed in LA and MA, suggesting regional cloud impacts. In December, an eastern home in VA shows minimal solar production, emphasizing climates role in solar generation. For LA, the study includes homes from East Carol, Beenville, Jefferson, and Morehouse, varying in size (1600-2700 ft2). Homes in neighboring eastern counties and a distinct southern countys home show different solar production patterns, with December seeing minimal production in most homes, highlighting seasonal effects. In ID, homes from Butte, Adams, Boundary, and Bannock reflect diverse solar production patterns, with square footage ranging from 1200-2800 ft2. Notably, a northern home (Boundary) shows unique patterns, and a localized cloud event in June significantly affected solar production. WA data for homes in Clark, Snohomish, Pacific, and Skagit counties (900-2300 ft2) reveal varied production trends, even among neighboring counties. Coastal homes exhibit unique patterns, with minimal production in January, consistent with seasonal variability observed in Figure  9 . MA covers homes in Hampden, Dukes, Berkshire, and Bristol, varying widely in size (800-3000 ft2). January shows unusually high production compared to other states, while November and December are low. A specific June date shows no morning production in the first and third homes, with Dukes Countys home maintaining normal levels but averaging lower production overall, indicating micro-geographical impacts on solar output.",
            "Furthermore, we calibrated the ground truth adopter dataset from LBNL to DeepSolar and reran the solar adoption model in the ten states where the LBNL and DeepSolar vary significantly. This experiment demonstrates the frameworks adaptability to calibrate the new ground truth dataset. Moreover, the models can be applied to any geographic region as they are generalizable. The results in Table  9  further demonstrate this capability."
        ]
    },
    "id_table_10": {
        "caption": "",
        "table": "Sx5.T9.1",
        "footnotes": [],
        "references": [
            "The heatmap in Figure  10  shows daily solar energy patterns for four homes in each of the five states, chosen randomly from each month. In VA, homes are from Fairfax, Hampton, Lynchburg, and Wythe counties, covering a range of locations and sizes (1100-1700 ft2). All homes see lower solar production in November and December. An interesting April pattern shows the first two eastern homes with nearly no production at times, unlike the central and western homes. This possibly denotes cloud cover effects. Similar patterns are observed in LA and MA, suggesting regional cloud impacts. In December, an eastern home in VA shows minimal solar production, emphasizing climates role in solar generation. For LA, the study includes homes from East Carol, Beenville, Jefferson, and Morehouse, varying in size (1600-2700 ft2). Homes in neighboring eastern counties and a distinct southern countys home show different solar production patterns, with December seeing minimal production in most homes, highlighting seasonal effects. In ID, homes from Butte, Adams, Boundary, and Bannock reflect diverse solar production patterns, with square footage ranging from 1200-2800 ft2. Notably, a northern home (Boundary) shows unique patterns, and a localized cloud event in June significantly affected solar production. WA data for homes in Clark, Snohomish, Pacific, and Skagit counties (900-2300 ft2) reveal varied production trends, even among neighboring counties. Coastal homes exhibit unique patterns, with minimal production in January, consistent with seasonal variability observed in Figure  9 . MA covers homes in Hampden, Dukes, Berkshire, and Bristol, varying widely in size (800-3000 ft2). January shows unusually high production compared to other states, while November and December are low. A specific June date shows no morning production in the first and third homes, with Dukes Countys home maintaining normal levels but averaging lower production overall, indicating micro-geographical impacts on solar output."
        ]
    }
}