{
    "id_table_1": {
        "caption": "TABLE I:  Comparison of Generative Methods For Synthetic Data",
        "table": "S5.EGx1",
        "footnotes": [],
        "references": []
    },
    "id_table_2": {
        "caption": "TABLE II:  Standard Deviation and SNR for Side Scan Sonar Images",
        "table": "S5.EGx2",
        "footnotes": [],
        "references": []
    },
    "id_table_3": {
        "caption": "TABLE III:  Precision Values for Model Trained on Different Datasets",
        "table": "S4.T1.1",
        "footnotes": [],
        "references": [
            "where the image state  x t subscript x t x_{t} italic_x start_POSTSUBSCRIPT italic_t end_POSTSUBSCRIPT  at time  t t t italic_t  is influenced by its past values and random noise terms. It is expressed as a combination of its previous value  x t  1 subscript x t 1 x_{t-1} italic_x start_POSTSUBSCRIPT italic_t - 1 end_POSTSUBSCRIPT  weighted by   t subscript  t \\sqrt{\\alpha_{t}} square-root start_ARG italic_ start_POSTSUBSCRIPT italic_t end_POSTSUBSCRIPT end_ARG  and a noise term  1   t   t  1 1 subscript  t subscript italic- t 1 \\sqrt{1-\\alpha_{t}}\\epsilon_{t-1} square-root start_ARG 1 - italic_ start_POSTSUBSCRIPT italic_t end_POSTSUBSCRIPT end_ARG italic_ start_POSTSUBSCRIPT italic_t - 1 end_POSTSUBSCRIPT , where   t subscript  t \\alpha_{t} italic_ start_POSTSUBSCRIPT italic_t end_POSTSUBSCRIPT  represents the weight. This relationship extends to the value at time  t  2 t 2 t-2 italic_t - 2 , incorporating the cumulative effect of   t subscript  t \\alpha_{t} italic_ start_POSTSUBSCRIPT italic_t end_POSTSUBSCRIPT  and   t  1 subscript  t 1 \\alpha_{t-1} italic_ start_POSTSUBSCRIPT italic_t - 1 end_POSTSUBSCRIPT . The evolution of  x t subscript x t x_{t} italic_x start_POSTSUBSCRIPT italic_t end_POSTSUBSCRIPT  from an initial condition  x 0 subscript x 0 x_{0} italic_x start_POSTSUBSCRIPT 0 end_POSTSUBSCRIPT  is determined by     t subscript    t \\bar{\\alpha}_{t} over  start_ARG italic_ end_ARG start_POSTSUBSCRIPT italic_t end_POSTSUBSCRIPT , representing the cumulative product of   t subscript  t \\alpha_{t} italic_ start_POSTSUBSCRIPT italic_t end_POSTSUBSCRIPT . These expressions capture the dynamic nature of  x t subscript x t x_{t} italic_x start_POSTSUBSCRIPT italic_t end_POSTSUBSCRIPT  over time, influenced by its past values and random fluctuations as given in eq.  3 .",
            "A visual assessment of the generated images is conducted; some examples of the sampled images are shown in Fig.  3 . Specifically, DDPM exhibits superior capability in rendering clear representations of mines and their associated shadows, as evident from the ORR score. In particular, the images generated by DDIM display a noticeable amount of noise, as observed in Fig.  3  (a) and (d). In contrast, DDPM-generated images illustrated in Fig.  3  (b) and (e), present well-defined boundaries and minimal noise. The results shown in Table  II  support these conclusions. Furthermore, images produced by the DCGAN model show reconstructed backgrounds accurately, as depicted in Fig.  3  (c) and (f). The ORR values in Table  I , further suggest that these synthetic images struggle to capture crucial details like mines and shadows. Hence, the DCGAN-generated images are not considered for the segmentation task due to their incredibly low ORR."
        ]
    },
    "id_table_4": {
        "caption": "",
        "table": "S5.EGx3",
        "footnotes": [],
        "references": [
            "This section first discusses the synthetic data generation models and the hyperparameters used. Further, the semantic segmentation model and the training data used have been explained. An overview of the architecture of the diffusion model with Mask RCNN can be found in Fig.  4 . The green boxes represent the trainable segments of the workflow, and the blue boxes represent the datasets used for training. Original Dataset refers to the true SSS image dataset. Synthetic Dataset represents The images generated via the Diffusion Model.",
            "As previously indicated, we employ heuristic criteria to assess the performance of generative models. The FID is calculated as given in eq.  4 :"
        ]
    },
    "id_table_5": {
        "caption": "",
        "table": "S4.F3.6",
        "footnotes": [],
        "references": [
            "where    \\mu italic_  shows the mean of the feature vector and    \\Sigma roman_  shows the covariance matrix of the image. The KID is calculation is provided in eq.  5 :"
        ]
    },
    "id_table_6": {
        "caption": "",
        "table": "S4.T2.1",
        "footnotes": [],
        "references": [
            "where  x i subscript x i x_{i} italic_x start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  and  y i subscript y i y_{i} italic_y start_POSTSUBSCRIPT italic_i end_POSTSUBSCRIPT  are real(empirical) feature representations and general feature representations respectively. The choice of the kernel function  k k k italic_k  can vary. However, a commonly used one is the Gaussian (RBF) kernel as given in equation  6 ."
        ]
    },
    "id_table_7": {
        "caption": "",
        "table": "S4.T3.5.5",
        "footnotes": [],
        "references": []
    }
}